      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
       IDENTIFICATION              DIVISION.
       PROGRAM-ID.                 ORCSNYULIFE2.
      *****************************************************************
      *  ¥·¥¹¥Æ¥àÌ¾        : £Ï£Ò£Ã£Á
      *  ¥µ¥Ö¥·¥¹¥Æ¥àÌ¾    : Æþ±¡
      *  ¥³¥ó¥Ý¡¼¥Í¥ó¥ÈÌ¾  : Æþ±¡»þÀ¸³èÎÅÍÜÈñÉéÃ´³Û¼èÆÀ¥µ¥Ö
      *                      ¡ÊÊ¿À®£²£¸Ç¯£´·î²þÀµÂÐ±þ¡Ë
      *  ´ÉÍý¼Ô            : 
      *  ºîÀ®ÆüÉÕ    ºî¶È¼Ô        µ­½Ò
      *  16/02/17    NACL¡Ý¾®Æ¦Âô  ¿·µ¬ºîÀ®
      *****************************************************************
      *  ¥×¥í¥°¥é¥à½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *  03.05.00    NACL-ÂÀÅÄ    07/05/10  ¥°¥ë¡¼¥×¿ÇÎÅÂÐ±þ
      *              NACL-¾®Æ¦Âô  07/07/12  ´µ¼Ô½êÆÀ¾ðÊó¤Î¼èÆÀ¤ò¥µ¥Ö
      *                                     ¥ë¡¼¥Á¥ó¤ËÊÑ¹¹
      *  04.01.00    NACL-¾®Æ¦Âô  07/12/17  Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¤ÎÆþ±¡
      *                                     ÍâÆü¿©»ö»»ÄêÂÐ±þ
      *Ê¿À®£²£°Ç¯£´·î²þÄêÂÐ±þ
      *  04.02.00    NACL-¾®Æ¦Âô  08/03/05  ¸å´ü¹âÎð¼Ô¤ÎÈ½ÄêÊÑ¹¹
      *                                     À¸³èÎÅÍÜ¤ÎÆþ±¡ÎÁÈ½ÄêÄÉ²Ã
      *                                       Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£³
      *                                       ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£±
      *                                       ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£²
      *  04.02.00    NACL-¾®Æ¦Âô  08/04/11  ¸å´ü¹âÎð¼Ô¤ÎÈ½Äê¤ò¥µ¥Ö¥ë¡¼¥Á¥ó»ÈÍÑ
      *                                     ¤ËÊÑ¹¹
      *  04.02.00    NACL-¾®Æ¦Âô  08/05/02  ÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Ë£Á£Ä£ÌÆþÎÏ¤«¤é
      *                                     °åÎÅÅÙ¤Î¹â¤¤´µ¼Ô¤òÈ½Äê
      *Ê¿À®£²£·Ç¯£±·îÆñÉÂÂÐ±þ
      *  04.07.00    NACL-¾®Æ¦Âô  15/06/02  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁµÚ¤Ó
      *                                     ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¤Î
      *                                     »»Äê¤ÇÆñÉÂ¸øÈñ¤Î»»Äê»þ¤Ë
      *                                     °åÎÅÅÙ¤Î¹â¤¤´µ¼Ô¤È¤¹¤ëÈ½ÄêÄÉ²Ã
      *Ê¿À®£²£¸Ç¯£´·î²þÀµÂÐ±þ
      *  04.08.00    NACL-¾®Æ¦Âô  16/02/17  ORCSNYULIFE.CBL -->  ORCSNYULIFE2.CBL
      *                                   ¡¦·ÐÄ²±ÉÍÜÂÐ±þ¤Î°Ù¡¢¿©»ö¤ÎÊÖµÑ¤ò
      *                                     Ä«ÃëÍ¼¤ËÊ¬³ä
      *                                   ¡¦ÆñÉÂ¡¢Ëô¤Ï¾®»ùËýÀ­ÆÃÄê¼À´µ¤Ï
      *                                     °åÎÅÅÙ¤Î¹â¤¤´µ¼Ô¤È¤¹¤ë
      *Ê¿À®£²£¹Ç¯£±£°·î²þÀµÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  17/08/16  µï½»Èñ¶â³ÛÊÑ¹¹ÂÐ±þ
      *                                     ¶­³¦ÁØÂÐ±þ
      *                                     À¸³èÎÅÍÜÉéÃ´¥³¡¼¥ÉÊ¬³äÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  17/08/24  ÆÃÄêÆþ±¡ÎÁ¤Î»»ÄêÍ×·ï³°¤Ç»»Äê
      *                                     ¤¹¤ëÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£É¤Î
      *                                     ¥³¡¼¥ÉÈ½ÄêÄÉ²Ã
      *  05.00.00    NACL-¾®Æ¦Âô  17/11/22  ´µ¼ÔÇ¯Îð£¶£³ºÐ°Ê²¼¤ÏÀ¸³èÎÅÍÜ
      *                                     ÂÐ¾Ý³°¤Î¥ê¥¿¡¼¥ó¥³¡¼¥ÉÊÖµÑ
      *Ê¿À®£³£°Ç¯£´·î²þÀµÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/02/27  À¸³èÎÅÍÜ¿©»öÉéÃ´³ÛÊÑ¹¹ÂÐ±þ
      *                                     µï½»ÈñÉéÃ´³ÛÊÑ¹¹ÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/03/07  À¸³èÎÅÍÜ¤Î°åÎÅÅÙÈ½ÄêÊÑ¹¹
      *  05.00.00    NACL-¾®Æ¦Âô  18/11/14  ÆñÉÂÈ½Äê¤ËµÞÀ­Áý°­¤Ë¤è¤ëÅ¾Åï
      *                                     ¤Î¥·¥¹¥Æ¥àÍ½Ìó¥³¡¼¥ÉÆþÎÏÄÉ²Ã
      *ÎáÏÂ£²Ç¯£´·î²þÀµÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  20/03/09  Ã»´üÂÚºß£³ÇÑ»ßµÚ¤ÓÄÉ²ÃÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  20/03/09  ÎÅÍÜÉÂÅïÆþ±¡£²¡Ê·Ð²áÁ¼ÃÖ£²¡ËÇÑ»ßÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  20/03/09  À¸³èÎÅÍÜ¿©»öÎÅÍÜÉ¸½àÉéÃ´»»Äê
      *                                     197002410 -> 197002310
      *  05.00.00    NACL-¾®Æ¦Âô  20/09/17  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¤Î·Ð²áÁ¼ÃÖ
      *                                     ½ªÎ»¤ËÈ¼¤¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ
      *                                     ¤ÎÄÉ²Ã
      *  05.00.00    NACL-¾®Æ¦Âô  20/10/09  °Ê²¼¤ÎÆÃÄêÆþ±¡ÎÁ¤Ë¤Ä¤¤¤Æ¿ÇÎÅ¹Ô°Ù¤Ç
      *                                     ÆñÉÂ¸øÈñ¤ò»ÈÍÑ¤µ¤ì¤¿¾ì¹ç¤â¿ø¤¨ÃÖ¤­
      *                                     ¤Î¿©»öÉéÃ´¤È¤¹¤ë
      *                                     ¡¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ
      *                                     ¡¦ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ
      *  05.00.00    NACL-¾®Æ¦Âô  20/10/28  ·îÆâ¤Î¿©»öÎÅÍÜÈñÊÑ¹¹¤ËÂÐ±þ
      *  05.02.01    ORCAMO       24/05/15  ÎáÏÂ£¶Ç¯²þÀµÂÐ±þ
      *****************************************************************
      *
      *
       ENVIRONMENT                 DIVISION.
       CONFIGURATION               SECTION.
       INPUT-OUTPUT                SECTION.
       FILE-CONTROL.
      *
      *
       DATA                        DIVISION.
      *FILE                        SECTION.
      *
       WORKING-STORAGE             SECTION.
      *
      *    ¥Õ¥é¥°ÎÎ°è
       01  FLG-AREA.
           03  FLG-NYUINACCT               PIC 9(01).
           03  FLG-NYUINACT                PIC 9(01).
           03  FLG-PTINF                   PIC 9(01).
           03  FLG-PTHKNINF                PIC 9(01).
           03  FLG-PTKOHINF                PIC 9(01).
           03  FLG-SYSKANRI                PIC 9(01).
           03  FLG-OK                      PIC 9(01).
           03  FLG-RJN                     PIC 9(01).
           03  FLG-SEI                     PIC 9(01).
           03  FLG-PTNYUINRRK              PIC 9(01).
           03  FLG-HKNCOMBI                PIC 9(01).
           03  FLG-NANBYO                  PIC 9(01).
      *    Åº»úÎÎ°è
       01  IDX-AREA.
           03  IDX                         PIC 9(04).
           03  IDX1                        PIC 9(04).
           03  IDV                         PIC 9(02).
           03  TSY90-IDX                   PIC 9(02).
           03  IDX-RJN                     PIC 9(02).
           03  IDX-SEI                     PIC 9(04).
           03  IDX-SEI2                    PIC 9(04).
           03  IDX-T                       PIC 9(04).
           03  IDX-ST                      PIC 9(02).
           03  IDX-ED                      PIC 9(02).
      *
      *    ¥³¥ó¥¹¥¿¥ó¥ÈÃÍ
      *    Ê¿À®£²£¸Ç¯ÅÙ²þÄêÀ¸³èÎÅÍÜÈ½ÄêÍÑ
      *  ¡Ê°åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ¤ò¾å°Ì¤Ë¤Þ¤È¤á¤Æ¤¤¤ë¤Î¤Ç¡¢¥Ç¡¼¥¿¤ÎÊÂ¤Ó¤ËÃí°Õ¤¹¤ë¤³¤È¡Ë
      *  ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¤ÏÆÃÊÌ¤ÊÈ½Äê¤¬¤¢¤ë¤³¤È¤«¤é¥Ç¡¼¥¿¤ÎºÇ¸å¤È¤¹¤ë¡Ë
       01  TBL-H28-SEIKATSU-AREA.
      *  °åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190150210".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190141710".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190141910".
      *    Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190125310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124410".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124510".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155410".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155810".
      *10  ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156210".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123710".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123810".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123910".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124110".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131710".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132510".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132710".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132910".
      *20  ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133110".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133310".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133510".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190166210".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190166410".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190166610".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190166810".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190167010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190167210".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190183810".
      *30  ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190184010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190184210".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190184410".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190184610".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190184810".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190185610".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190185810".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190186010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190186210".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190186410".
      *40  ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190186610".
      *
      *  °åÎÅÅÙ¤Î¹â¤¯¤Ê¤¤À¸³èÎÅÍÜ
      *41  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124610".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124710".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156610".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190157010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131910".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132110".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£±¡ÊÆþ±¡´ðËÜÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132310".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133710".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133910".
      *50  ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190134110".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190167410".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190167610".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÄ¶²á¸º»»¡Ë
           03   FILLER                     PIC X(09) VALUE "190167810".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190185010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190185210".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê´Ç¸î¿¦°÷¿ôÅù·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190185410".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190186810".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190187010".
      *    ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÌë¶Ð»þ´ÖÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
           03   FILLER                     PIC X(09) VALUE "190187210".
      *60  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190177710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190177910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178510".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179510".
      *70  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180510".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181510".
      *80  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190182110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196010".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196210".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196410".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196810".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197010".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197410".
      *90  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197510".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197610".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197810".
      *93  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190198010".
      *94  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190175410".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190175610".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190175810".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190176010".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190176210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190176410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190176610".
      *101 ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190176810".
      *
      *102 Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124810".
      *103 ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124210".
      *
       01  TBL-H28-SEIKATSU-R     REDEFINES  TBL-H28-SEIKATSU-AREA.
           03   TBL-H28-SEISRYCD           PIC X(09)  OCCURS  103.
      *
      *
      *    Ê¿À®£³£°Ç¯ÅÙ²þÄêÀ¸³èÎÅÍÜÈ½ÄêÍÑ
      *  ¡Ê°åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ¤ò¾å°Ì¤Ë¤Þ¤È¤á¤Æ¤¤¤ë¤Î¤Ç¡¢¥Ç¡¼¥¿¤ÎÊÂ¤Ó¤ËÃí°Õ¤¹¤ë¤³¤È¡Ë
      *  ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¤ÏÆÃÊÌ¤ÊÈ½Äê¤¬¤¢¤ë¤³¤È¤«¤é¥Ç¡¼¥¿¤ÎºÇ¸å¤È¤¹¤ë¡Ë
       01  TBL-H30-SEIKATSU-AREA.
      *  °åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208010".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208210".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208410".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208610".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£µ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208810".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£¶¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209010".
      *    Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190125310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124410".
      *10  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124510".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155410".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155810".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123810".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131710".
      *20  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133310".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190202610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190202810".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190203010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190203210".
      *30  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190203410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190203610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190215210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190215410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190215610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190215810".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190216010".
      *37  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190216210".
      *
      *  °åÎÅÅÙ¤Î¹â¤¯¤Ê¤¤À¸³èÎÅÍÜ
      *38  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124610".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124710".
      *40  ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156610".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190157010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132310".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190134110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190203810".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190204010".
      *50  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190204210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£²¡¦ÄÌÂ§£¸¡Ë
           03   FILLER                     PIC X(09) VALUE "190204410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190216410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190216610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190216810".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178510".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179110".
      *60  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180710".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181310".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181510".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181710".
      *70  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190181910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190182110".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196010".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196410".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196810".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190196910".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197010".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197410".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197510".
      *    Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197610".
      *80  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197810".
      *81  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190198010".
      *82  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209610".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209810".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210010".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210210".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210410".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210610".
      *90  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190210810".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211010".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211610".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211810".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190212010".
      *97  ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190212210".
      *
      *98  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124810".
      *99  ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124210".
      *
       01  TBL-H30-SEIKATSU-R     REDEFINES  TBL-H30-SEIKATSU-AREA.
           03   TBL-H30-SEISRYCD           PIC X(09)  OCCURS  99.
      *
      *
      *    ÎáÏÂ£²Ç¯ÅÙ²þÄêÀ¸³èÎÅÍÜÈ½ÄêÍÑ
      *  ¡Ê°åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ¤ò¾å°Ì¤Ë¤Þ¤È¤á¤Æ¤¤¤ë¤Î¤Ç¡¢¥Ç¡¼¥¿¤ÎÊÂ¤Ó¤ËÃí°Õ¤¹¤ë¤³¤È¡Ë
      *  ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¤ÏÆÃÊÌ¤ÊÈ½Äê¤¬¤¢¤ë¤³¤È¤«¤é¥Ç¡¼¥¿¤ÎºÇ¸å¤È¤¹¤ë¡Ë
       01  TBL-R02-SEIKATSU-AREA.
      *  °åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208010".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208210".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208410".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208610".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£µ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208810".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£¶¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209010".
      *    Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190125310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124410".
      *10  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124510".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155410".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155810".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123810".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131710".
      *20  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133310".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215810".
      *30  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216010".
      *31  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216210".
      *
      *  °åÎÅÅÙ¤Î¹â¤¯¤Ê¤¤À¸³èÎÅÍÜ
      *32  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124610".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124710".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156610".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190157010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132310".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133710".
      *40  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190134110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216810".
      *    Ã»¼ê£³¡Ê¾®»ù¿©Êª¥¢¥ì¥ë¥®¡¼Éé²Ù¸¡ºº¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190178310".
      *    Ã»¼ê£³¡ÊÁ°Î©Á£¿ËÀ¸¸¡Ë¡¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190178510".
      *    Ã»¼ê£³¡Ê´ØÀá¶À²¼¼êº¬´É³«Êü¼ê½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190178910".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼¸ò´¶¿À·ÐÀáÀÚ½ü½Ñ¡ÊÎ¾Â¦¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179110".
      *    Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦ÊÒÂ¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179310".
      *50  Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¾·Â£µ£ã£íÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179710".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡ÊÈ´µîÀÚ½ü½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179910".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190180110".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹â°Ì·ëå§½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190180310".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190180710".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181110".
      *    Ã»¼ê£³¡ÊÆâ»ë¶ÀÅªÂçÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£íÌ¤Ëþ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181310".
      *    Ã»¼ê£³¡ÊÆâ»ë¶ÀÅªÂçÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£í°Ê¾å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181510".
      *    Ã»¼ê£³¡Ê¼¦³Ë¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ê»ÍÃÊ³¬Ãí¼ÍË¡¡Ë¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181710".
      *    Ã»¼ê£³¡Ê»ÒµÜ·ÛÉô¡ÊÊ¢Éô¡ËÀÚ½ü½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181910".
      *60  Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦Î¾Â¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190196010".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190196810".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190196910".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197010".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197410".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197510".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197610".
      *    Ã»¼ê£³¡ÊÂÎ³°¾×·âÇÈ¡¦Ç¢´É·ëÀÐÇËºÕ½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197810".
      *    Ã»¼ê£³¡Ê¥¬¥ó¥Þ¥Ê¥¤¥Õ¤Ë¤è¤ëÄê°ÌÊü¼ÍÀþ¼£ÎÅ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190198010".
      *    Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡Ê½é²ó¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190221010".
      *70  Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡¦£³·î°ÊÆâ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190221210".
      *71  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209610".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209810".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210010".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210210".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210410".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210610".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190210810".
      *80  ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211010".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211610".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211810".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190212010".
      *86  ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190212210".
      *87  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190231210".
      *88  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190231410".
      *89  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190231610".
      *90  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190231810".
      *91  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190232010".
      *92  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190232210".
      *93  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190232410".
      *94  ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆÃÊÌÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190232610".
      *
      *95  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124810".
      *96  ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124210".
      *
       01  TBL-R02-SEIKATSU-R     REDEFINES  TBL-R02-SEIKATSU-AREA.
           03   TBL-R02-SEISRYCD           PIC X(09)  OCCURS  96.
      *
      *    ÎáÏÂ£´Ç¯ÅÙ²þÄêÀ¸³èÎÅÍÜÈ½ÄêÍÑ
      *  ¡Ê°åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ¤ò¾å°Ì¤Ë¤Þ¤È¤á¤Æ¤¤¤ë¤Î¤Ç¡¢¥Ç¡¼¥¿¤ÎÊÂ¤Ó¤ËÃí°Õ¤¹¤ë¤³¤È¡Ë
      *  ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¤ÏÆÃÊÌ¤ÊÈ½Äê¤¬¤¢¤ë¤³¤È¤«¤é¥Ç¡¼¥¿¤ÎºÇ¸å¤È¤¹¤ë¡Ë
       01  TBL-R04-SEIKATSU-AREA.
      *  °åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208010".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208210".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208410".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208610".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£µ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190249610".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£µ¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208810".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£¶¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209010".
      *    Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190125310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124310".
      *10  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124410".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124510".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155410".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155810".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123810".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190123910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124110".
      *20  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133310".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Á¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Â¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ã¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Ä¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190215810".
      *31  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216010".
      *32  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡´ðËÜÎÁ£Æ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216210".
      *
      *  °åÎÅÅÙ¤Î¹â¤¯¤Ê¤¤À¸³èÎÅÍÜ
      *33  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124610".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124710".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156610".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190157010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190131910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190132310".
      *40  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133710".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190133910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190134110".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£Ç¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216410".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£È¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216610".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£É¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë¡Ê·Ð²áÁ¼ÃÖ¡Ë
           03   FILLER                     PIC X(09) VALUE "190216810".
      *    Ã»¼ê£³¡Ê¾®»ù¿©Êª¥¢¥ì¥ë¥®¡¼Éé²Ù¸¡ºº¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190178310".
      *    Ã»¼ê£³¡ÊÁ°Î©Á£¿ËÀ¸¸¡Ë¡¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190178510".
      *    Ã»¼ê£³¡Ê´ØÀá¶À²¼¼êº¬´É³«Êü¼ê½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190178910".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼¸ò´¶¿À·ÐÀáÀÚ½ü½Ñ¡ÊÎ¾Â¦¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179110".
      *50  Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦ÊÒÂ¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179310".
      *    Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¾·Â£µ£ã£íÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179710".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡ÊÈ´µîÀÚ½ü½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190179910".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190180110".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹â°Ì·ëå§½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190180310".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190180710".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181110".
      *    Ã»¼ê£³¡ÊÆâ»ë¶ÀÅªÂçÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£íÌ¤Ëþ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181310".
      *    Ã»¼ê£³¡ÊÆâ»ë¶ÀÅªÂçÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£í°Ê¾å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181510".
      *    Ã»¼ê£³¡Ê¼¦³Ë¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ê»ÍÃÊ³¬Ãí¼ÍË¡¡Ë¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181710".
      *60  Ã»¼ê£³¡Ê»ÒµÜ·ÛÉô¡ÊÊ¢Éô¡ËÀÚ½ü½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190181910".
      *    Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦Î¾Â¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190196010".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190196810".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190196910".
      *    Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197010".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197410".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197510".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197610".
      *    Ã»¼ê£³¡ÊÂÎ³°¾×·âÇÈ¡¦Ç¢´É·ëÀÐÇËºÕ½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190197810".
      *    Ã»¼ê£³¡Ê¥¬¥ó¥Þ¥Ê¥¤¥Õ¤Ë¤è¤ëÄê°ÌÊü¼ÍÀþ¼£ÎÅ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190198010".
      *    Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡Ê½é²ó¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190221010".
      *71  Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡¦£³·î°ÊÆâ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190221210".
      *    2022-04-01
      *72  Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£±¡¢£²°Ê³°¡¦°ÂÁ´ÀºÅÙ´ÉÍý²¼¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190265710".
      *    Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£±¡¢£²°Ê³°¡¦¤½¤ÎÂ¾¡¦À¸³è¡Ë
           03   FILLER                     PIC X(09) VALUE "190265910".
      *    Ã»¼ê£³¡Ê£Í£Ó£Ì£Ô¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190266110".
      *    Ã»¼ê£³¡ÊÆâÊ¬ÈçÉé²Ù»î¸³¡¦²¼¿âÂÎÁ°ÍÕÉé²Ù»î¸³¡Ê£Ç£È¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190266310".
      *    Ã»¼ê£³¡Ê·ÐÈéÅªÊü¼ÍÀþ¼£ÎÅÍÑ¶âÂ°¥Þ¡¼¥«¡¼Î±ÃÖ½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190266510".
      *    Ã»¼ê£³¡Ê»Í»è¡¦¶í´´ÆðÉô¼ðáçÅ¦½Ð½Ñ¡Ê¼ê¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190266710".
      *    Ã»¼ê£³¡Ê¹üÀÞ´Ñ·ìÅª¼ê½Ñ¡Ê¼ê½®¾õ¹ü¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190266910".
      *    Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡ÊÁ°ÏÓ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190267110".
      *80  Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡Êº¿¹ü¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190267310".
      *    Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡Ê¼ê¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190267510".
      *    Ã»¼ê£³¡Ê¥¬¥ó¥°¥ê¥ª¥óÅ¦½Ð½Ñ¡Ê¼ê¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190267710".
      *    Ã»¼ê£³¡ÊÎÞ´É¥Á¥å¡¼¥ÖÁÞÆþ½Ñ¡ÊÎÞÆ»Æâ»ë¶À¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190267910".
      *    Ã»¼ê£³¡Ê´ãâÛÆâÈ¿¾É¼ê½Ñ¡ÊÈéÉæÀÚ³«Ë¡¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190268110".
      *    Ã»¼ê£³¡Ê´ãâÛ²¼¿â¾É¼ê½Ñ¡Ê´ãâÛµó¶ÚÁ°Å¾Ë¡¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190268310".
      *    Ã»¼ê£³¡Ê´ãâÛ²¼¿â¾É¼ê½Ñ¡Ê¤½¤ÎÂ¾¤Î¤â¤Î¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190268510".
      *    Ã»¼ê£³¡ÊÍã¾õÊÒ¼ê½Ñ¡ÊÊÛ¤Î°Ü¿¢¤òÍ×¤¹¤ë¤â¤Î¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190268710".
      *    Ã»¼ê£³¡Ê¼Ð»ë¼ê½Ñ¡Ê¸åÅ¾Ë¡¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190268910".
      *    Ã»¼ê£³¡Ê¼Ð»ë¼ê½Ñ¡ÊÁ°Å¾Ë¡µÚ¤Ó¸åÅ¾Ë¡¤ÎÊ»»Ü¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190269110".
      *90  Ã»¼ê£³¡Ê¼£ÎÅÅª³ÑËìÀÚ½ü½Ñ¡¦¥¨¥­¥·¥Þ¥ì¡¼¥¶¡¼¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190269310".
      *    Ã»¼ê£³¡ÊÎÐÆâ¾ã¼ê½Ñ¡¦¿å¾½ÂÎºÆ·ú½ÑÊ»ÍÑ´ãÆâ¥É¥ì¡¼¥óÁÞÆþ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190269510".
      *    Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥º¤òÁÞÆþ¤·¤Ê¤¤¡¦ÊÒÂ¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190269710".
      *    Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥º¤òÁÞÆþ¤·¤Ê¤¤¡¦Î¾Â¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190269910".
      *    Ã»¼ê£³¡Ê¸ÝËì·ÁÀ®¼ê½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190270110".
      *    Ã»¼ê£³¡ÊÉ¡¹ü¹üÀÞÀ°Éü¸ÇÄê½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190270310".
      *    Ã»¼ê£³¡Ê¹¢Æ¬¡¦À¼ÂÓ¥Ý¥ê¡¼¥×ÀÚ½ü¡ÊÄ¾Ã£¹¢Æ¬¶À¡¢¥Õ¥¡¥¤¥Ð¡¼¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190270510".
      *    Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¾·Â£µ£ã£í°Ê¾å¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190270710".
      *    Ã»¼ê£³¡ÊÂçÉúºßÀÅÌ®È´µî½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190270910".
      *    Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî·ì´ÉÆâ¾Æ¼Þ½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190271110".
      *100 Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî·ì´ÉÆâºÉÀò½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190271310".
      *    Ã»¼ê£³¡ÊæêÌç¥Ý¥ê¡¼¥×ÀÚ½ü½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190271510".
      *    Ã»¼ê£³¡ÊæêÌçÀí·½¥³¥ó¥¸¥í¡¼¥àÀÚ½ü½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190271710".
      *    Ã»¼ê£³¡ÊÇ¢¼º¶Ø¼ê½Ñ¡Ê¥Ü¥Ä¥ê¥Ì¥¹ÆÇÁÇ¤Ë¤è¤ë¤â¤Î¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190271910".
      *    Ã»¼ê£³¡Ê¸²Èù¶À²¼Àºº÷ÀÅÌ®áî¼ê½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190272110".
      *    Ã»¼ê£³¡Ê»ÒµÜ¶À²¼Í­·ÔÇ´Ëì²¼¶Ú¼ðÀÚ½Ð¡¢¥Ý¥ê¡¼¥×¡¦ÅÅ²ò±Õ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190272310".
      *    Ã»¼ê£³¡Ê»ÒµÜ¶À²¼Í­·ÔÇ´Ëì²¼¶Ú¼ðÀÚ½Ð¡¢¥Ý¥ê¡¼¥×¡¦¤½¤ÎÂ¾¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190272510".
      *    Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡ÊÅÅ²ò¼ÁÍÏ±ÕÍøÍÑ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190272710".
      *    Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡Ê¤½¤ÎÂ¾¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190272910".
      *    Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼Íñ´É·ÁÀ®½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190273110".
      *110 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209610".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190209810".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210010".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210210".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210410".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190210610".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190210810".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211010".
      *120 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211210".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211410".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211610".
      *    ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190211810".
      *    ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190212010".
      *125 ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë¡ÊÆÃÄêÃÏ°è¡Ë
           03   FILLER                     PIC X(09) VALUE "190212210".
      *    ÃÏ°èÊñ³ç¥±¥¢¡ÊÃí£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190249810".
           03   FILLER                     PIC X(09) VALUE "190250210".
           03   FILLER                     PIC X(09) VALUE "190250610".
           03   FILLER                     PIC X(09) VALUE "190252210".
      *130
           03   FILLER                     PIC X(09) VALUE "190253010".
           03   FILLER                     PIC X(09) VALUE "190253410".
           03   FILLER                     PIC X(09) VALUE "190253810".
           03   FILLER                     PIC X(09) VALUE "190255410".
      *    ÃÏ°èÊñ³ç¥±¥¢¡ÊÃí£¹¡Ë
           03   FILLER                     PIC X(09) VALUE "190256210".
           03   FILLER                     PIC X(09) VALUE "190257010".
           03   FILLER                     PIC X(09) VALUE "190250810".
           03   FILLER                     PIC X(09) VALUE "190254010".
      *    ÃÏ°èÊñ³ç¥±¥¢¡ÊÃí£±£°¡Ë
           03   FILLER                     PIC X(09) VALUE "190257810".
           03   FILLER                     PIC X(09) VALUE "190258010".
      *140
           03   FILLER                     PIC X(09) VALUE "190258210".
           03   FILLER                     PIC X(09) VALUE "190258610".
           03   FILLER                     PIC X(09) VALUE "190253210".
           03   FILLER                     PIC X(09) VALUE "190253610".
           03   FILLER                     PIC X(09) VALUE "190254210".
           03   FILLER                     PIC X(09) VALUE "190255610".
      *    ÃÏ°èÊñ³ç¥±¥¢¡ÊÃí£±£±¡Ë
           03   FILLER                     PIC X(09) VALUE "190259010".
           03   FILLER                     PIC X(09) VALUE "190259410".
           03   FILLER                     PIC X(09) VALUE "190259810".
           03   FILLER                     PIC X(09) VALUE "190260010".
      *150
           03   FILLER                     PIC X(09) VALUE "190251010".
           03   FILLER                     PIC X(09) VALUE "190252410".
           03   FILLER                     PIC X(09) VALUE "190254410".
           03   FILLER                     PIC X(09) VALUE "190255810".
      *    ÃÏ°èÊñ³ç¥±¥¢¡ÊÃí£±£²¡Ë
           03   FILLER                     PIC X(09) VALUE "190260210".
           03   FILLER                     PIC X(09) VALUE "190260410".
           03   FILLER                     PIC X(09) VALUE "190260610".
           03   FILLER                     PIC X(09) VALUE "190260810".
           03   FILLER                     PIC X(09) VALUE "190250010".
           03   FILLER                     PIC X(09) VALUE "190250410".
      *160
           03   FILLER                     PIC X(09) VALUE "190251210".
           03   FILLER                     PIC X(09) VALUE "190252610".
      *    ÃÏ°èÊñ³ç¥±¥¢¡Ê¹çÀ®¥³¡¼¥É¡Ë
           03   FILLER                     PIC X(09) VALUE "190251410".
           03   FILLER                     PIC X(09) VALUE "190251610".
           03   FILLER                     PIC X(09) VALUE "190251810".
           03   FILLER                     PIC X(09) VALUE "190252010".
           03   FILLER                     PIC X(09) VALUE "190252810".
           03   FILLER                     PIC X(09) VALUE "190254610".
           03   FILLER                     PIC X(09) VALUE "190254810".
           03   FILLER                     PIC X(09) VALUE "190255010".
      *170
           03   FILLER                     PIC X(09) VALUE "190255210".
           03   FILLER                     PIC X(09) VALUE "190256010".
           03   FILLER                     PIC X(09) VALUE "190256410".
           03   FILLER                     PIC X(09) VALUE "190256610".
           03   FILLER                     PIC X(09) VALUE "190256810".
           03   FILLER                     PIC X(09) VALUE "190257210".
           03   FILLER                     PIC X(09) VALUE "190257410".
           03   FILLER                     PIC X(09) VALUE "190257610".
           03   FILLER                     PIC X(09) VALUE "190258410".
           03   FILLER                     PIC X(09) VALUE "190258810".
      *180
           03   FILLER                     PIC X(09) VALUE "190259210".
           03   FILLER                     PIC X(09) VALUE "190259610".
      *182 ÆÃÄêµ¡Ç½ÉÂ±¡¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190265210".
      *183 Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124810".
      *184 ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124210".
      *
       01  TBL-R04-SEIKATSU-R     REDEFINES  TBL-R04-SEIKATSU-AREA.
           03   TBL-R04-SEISRYCD           PIC X(09)  OCCURS  184.
      *
      *
      *    ÎáÏÂ£¶Ç¯£¶·î²þÄêÀ¸³èÎÅÍÜÈ½ÄêÍÑ
      *  ¡Ê°åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ¤ò¾å°Ì¤Ë¤Þ¤È¤á¤Æ¤¤¤ë¤Î¤Ç¡¢¥Ç¡¼¥¿¤ÎÊÂ¤Ó¤ËÃí°Õ¤¹¤ë¤³¤È¡Ë
      *  ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¤ÏÆÃÊÌ¤ÊÈ½Äê¤¬¤¢¤ë¤³¤È¤«¤é¥Ç¡¼¥¿¤ÎºÇ¸å¤È¤¹¤ë¡Ë
       01  TBL-R06-SEIKATSU-AREA.
      *  °åÎÅÅÙ¤Î¹â¤¤À¸³èÎÅÍÜ
      *01  ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208010".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208210".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208410".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£´¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190208610".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ£µ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190249610".
      *    ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÆþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190838810".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124310".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124410".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124510".
      *10  ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Á¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155410".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Â¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190155810".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ã¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156210".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£±¤«¤é£²£´¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190817710".
           03   FILLER                     PIC X(09) VALUE "190817910".
           03   FILLER                     PIC X(09) VALUE "190818110".
           03   FILLER                     PIC X(09) VALUE "190818310".
           03   FILLER                     PIC X(09) VALUE "190818510".
           03   FILLER                     PIC X(09) VALUE "190818710".
           03   FILLER                     PIC X(09) VALUE "190818910".
           03   FILLER                     PIC X(09) VALUE "190819110".
      *20
           03   FILLER                     PIC X(09) VALUE "190819310".
           03   FILLER                     PIC X(09) VALUE "190819510".
           03   FILLER                     PIC X(09) VALUE "190819710".
           03   FILLER                     PIC X(09) VALUE "190819910".
           03   FILLER                     PIC X(09) VALUE "190820110".
           03   FILLER                     PIC X(09) VALUE "190820310".
           03   FILLER                     PIC X(09) VALUE "190820510".
           03   FILLER                     PIC X(09) VALUE "190820710".
           03   FILLER                     PIC X(09) VALUE "190820910".
           03   FILLER                     PIC X(09) VALUE "190821110".
      *30
           03   FILLER                     PIC X(09) VALUE "190821310".
           03   FILLER                     PIC X(09) VALUE "190821510".
           03   FILLER                     PIC X(09) VALUE "190821710".
           03   FILLER                     PIC X(09) VALUE "190821910".
           03   FILLER                     PIC X(09) VALUE "190822110".
           03   FILLER                     PIC X(09) VALUE "190822310".
      *37  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£²£¸¤«¤é£³£°¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190823110".
           03   FILLER                     PIC X(09) VALUE "190823310".
           03   FILLER                     PIC X(09) VALUE "190823510".
      *40  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£±¤«¤é£²£´¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190823710".
           03   FILLER                     PIC X(09) VALUE "190823910".
           03   FILLER                     PIC X(09) VALUE "190824110".
           03   FILLER                     PIC X(09) VALUE "190824310".
           03   FILLER                     PIC X(09) VALUE "190824510".
           03   FILLER                     PIC X(09) VALUE "190824710".
           03   FILLER                     PIC X(09) VALUE "190824910".
           03   FILLER                     PIC X(09) VALUE "190825110".
           03   FILLER                     PIC X(09) VALUE "190825310".
           03   FILLER                     PIC X(09) VALUE "190825510".
      *50
           03   FILLER                     PIC X(09) VALUE "190825710".
           03   FILLER                     PIC X(09) VALUE "190825910".
           03   FILLER                     PIC X(09) VALUE "190826110".
           03   FILLER                     PIC X(09) VALUE "190826310".
           03   FILLER                     PIC X(09) VALUE "190826510".
           03   FILLER                     PIC X(09) VALUE "190826710".
           03   FILLER                     PIC X(09) VALUE "190826910".
           03   FILLER                     PIC X(09) VALUE "190827110".
           03   FILLER                     PIC X(09) VALUE "190827310".
           03   FILLER                     PIC X(09) VALUE "190827510".
      *60
           03   FILLER                     PIC X(09) VALUE "190827710".
           03   FILLER                     PIC X(09) VALUE "190827910".
           03   FILLER                     PIC X(09) VALUE "190828110".
           03   FILLER                     PIC X(09) VALUE "190828310".
      *64  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£²£¸¤«¤é£³£°¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190829110".
           03   FILLER                     PIC X(09) VALUE "190829310".
           03   FILLER                     PIC X(09) VALUE "190829510".
      *  °åÎÅÅÙ¤Î¹â¤¯¤Ê¤¤À¸³èÎÅÍÜ
      *67  Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124610".
      *    Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124710".
      *    ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Ä¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190156610".
      *70  ÎÅÍÜÉÂ¾²°Ê³°¡¦Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡£Å¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190157010".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£²£µ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190822510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£²£¶¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190822710".
      *73  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£±¡ÊÆþ±¡ÎÁ£²£·¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190822910".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£²£µ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190828510".
      *    ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£²£¶¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190828710".
      *76  ÎÅÍÜÉÂÅïÆþ±¡ÎÁ£²¡ÊÆþ±¡ÎÁ£²£·¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190828910".
      *77  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190265710".
           03   FILLER                     PIC X(09) VALUE "190265910".
           03   FILLER                     PIC X(09) VALUE "190266110".
      *80  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190266310".
           03   FILLER                     PIC X(09) VALUE "190178310".
           03   FILLER                     PIC X(09) VALUE "190178510".
           03   FILLER                     PIC X(09) VALUE "190266510".
           03   FILLER                     PIC X(09) VALUE "190266710".
           03   FILLER                     PIC X(09) VALUE "190266910".
           03   FILLER                     PIC X(09) VALUE "190267110".
           03   FILLER                     PIC X(09) VALUE "190267310".
           03   FILLER                     PIC X(09) VALUE "190267510".
           03   FILLER                     PIC X(09) VALUE "190267710".
      *90  Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190178910".
           03   FILLER                     PIC X(09) VALUE "190179110".
           03   FILLER                     PIC X(09) VALUE "190873310".
           03   FILLER                     PIC X(09) VALUE "190873510".
           03   FILLER                     PIC X(09) VALUE "190873710".
           03   FILLER                     PIC X(09) VALUE "190873910".
           03   FILLER                     PIC X(09) VALUE "190874110".
           03   FILLER                     PIC X(09) VALUE "190874310".
           03   FILLER                     PIC X(09) VALUE "190874510".
           03   FILLER                     PIC X(09) VALUE "190874710".
      *100 Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190874910".
           03   FILLER                     PIC X(09) VALUE "190875110".
           03   FILLER                     PIC X(09) VALUE "190875310".
           03   FILLER                     PIC X(09) VALUE "190875510".
           03   FILLER                     PIC X(09) VALUE "190875710".
           03   FILLER                     PIC X(09) VALUE "190875910".
           03   FILLER                     PIC X(09) VALUE "190876110".
           03   FILLER                     PIC X(09) VALUE "190876310".
           03   FILLER                     PIC X(09) VALUE "190876510".
           03   FILLER                     PIC X(09) VALUE "190876710".
      *110 Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190179310".
           03   FILLER                     PIC X(09) VALUE "190196010".
           03   FILLER                     PIC X(09) VALUE "190269710".
           03   FILLER                     PIC X(09) VALUE "190269910".
           03   FILLER                     PIC X(09) VALUE "190270110".
           03   FILLER                     PIC X(09) VALUE "190270310".
           03   FILLER                     PIC X(09) VALUE "190270510".
           03   FILLER                     PIC X(09) VALUE "190179710".
           03   FILLER                     PIC X(09) VALUE "190270710".
           03   FILLER                     PIC X(09) VALUE "190221010".
      *120 Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190221210".
           03   FILLER                     PIC X(09) VALUE "190179910".
           03   FILLER                     PIC X(09) VALUE "190180110".
           03   FILLER                     PIC X(09) VALUE "190180310".
           03   FILLER                     PIC X(09) VALUE "190270910".
           03   FILLER                     PIC X(09) VALUE "190271110".
           03   FILLER                     PIC X(09) VALUE "190271310".
           03   FILLER                     PIC X(09) VALUE "190196810".
           03   FILLER                     PIC X(09) VALUE "190196910".
           03   FILLER                     PIC X(09) VALUE "190197010".
      *130 Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190180710".
           03   FILLER                     PIC X(09) VALUE "190197410".
           03   FILLER                     PIC X(09) VALUE "190197510".
           03   FILLER                     PIC X(09) VALUE "190197610".
           03   FILLER                     PIC X(09) VALUE "190181110".
           03   FILLER                     PIC X(09) VALUE "190181310".
           03   FILLER                     PIC X(09) VALUE "190181510".
           03   FILLER                     PIC X(09) VALUE "190181710".
           03   FILLER                     PIC X(09) VALUE "190271510".
           03   FILLER                     PIC X(09) VALUE "190271710".
      *140 Ã»¼ê£³
           03   FILLER                     PIC X(09) VALUE "190197810".
           03   FILLER                     PIC X(09) VALUE "190271910".
           03   FILLER                     PIC X(09) VALUE "190272110".
           03   FILLER                     PIC X(09) VALUE "190181910".
           03   FILLER                     PIC X(09) VALUE "190272310".
           03   FILLER                     PIC X(09) VALUE "190272510".
           03   FILLER                     PIC X(09) VALUE "190272710".
           03   FILLER                     PIC X(09) VALUE "190272910".
           03   FILLER                     PIC X(09) VALUE "190273110".
           03   FILLER                     PIC X(09) VALUE "190198010".
      *150 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190858910".
           03   FILLER                     PIC X(09) VALUE "190859110".
           03   FILLER                     PIC X(09) VALUE "190859310".
           03   FILLER                     PIC X(09) VALUE "190859510".
           03   FILLER                     PIC X(09) VALUE "190859710".
           03   FILLER                     PIC X(09) VALUE "190859910".
           03   FILLER                     PIC X(09) VALUE "190860110".
           03   FILLER                     PIC X(09) VALUE "190860310".
           03   FILLER                     PIC X(09) VALUE "190860510".
           03   FILLER                     PIC X(09) VALUE "190860710".
      *160 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190860910".
           03   FILLER                     PIC X(09) VALUE "190861110".
           03   FILLER                     PIC X(09) VALUE "190861310".
           03   FILLER                     PIC X(09) VALUE "190861510".
           03   FILLER                     PIC X(09) VALUE "190861710".
           03   FILLER                     PIC X(09) VALUE "190861910".
           03   FILLER                     PIC X(09) VALUE "190862110".
           03   FILLER                     PIC X(09) VALUE "190862310".
           03   FILLER                     PIC X(09) VALUE "190862510".
           03   FILLER                     PIC X(09) VALUE "190862710".
      *170 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190862910".
           03   FILLER                     PIC X(09) VALUE "190863110".
           03   FILLER                     PIC X(09) VALUE "190863310".
           03   FILLER                     PIC X(09) VALUE "190863510".
           03   FILLER                     PIC X(09) VALUE "190863710".
           03   FILLER                     PIC X(09) VALUE "190863910".
           03   FILLER                     PIC X(09) VALUE "190864110".
           03   FILLER                     PIC X(09) VALUE "190864310".
           03   FILLER                     PIC X(09) VALUE "190864510".
           03   FILLER                     PIC X(09) VALUE "190864710".
      *180 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190864910".
           03   FILLER                     PIC X(09) VALUE "190865110".
           03   FILLER                     PIC X(09) VALUE "190865310".
           03   FILLER                     PIC X(09) VALUE "190865510".
           03   FILLER                     PIC X(09) VALUE "190865710".
           03   FILLER                     PIC X(09) VALUE "190865910".
           03   FILLER                     PIC X(09) VALUE "190866110".
           03   FILLER                     PIC X(09) VALUE "190866310".
           03   FILLER                     PIC X(09) VALUE "190866510".
           03   FILLER                     PIC X(09) VALUE "190866710".
      *190 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190866910".
           03   FILLER                     PIC X(09) VALUE "190867110".
           03   FILLER                     PIC X(09) VALUE "190867310".
           03   FILLER                     PIC X(09) VALUE "190867510".
           03   FILLER                     PIC X(09) VALUE "190867710".
           03   FILLER                     PIC X(09) VALUE "190867910".
           03   FILLER                     PIC X(09) VALUE "190868110".
           03   FILLER                     PIC X(09) VALUE "190868310".
           03   FILLER                     PIC X(09) VALUE "190839010".
           03   FILLER                     PIC X(09) VALUE "190839210".
      *200 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190839410".
           03   FILLER                     PIC X(09) VALUE "190839610".
           03   FILLER                     PIC X(09) VALUE "190839810".
           03   FILLER                     PIC X(09) VALUE "190840010".
           03   FILLER                     PIC X(09) VALUE "190840210".
           03   FILLER                     PIC X(09) VALUE "190840410".
           03   FILLER                     PIC X(09) VALUE "190840610".
           03   FILLER                     PIC X(09) VALUE "190840810".
           03   FILLER                     PIC X(09) VALUE "190841010".
           03   FILLER                     PIC X(09) VALUE "190841210".
      *210 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190841410".
           03   FILLER                     PIC X(09) VALUE "190841610".
           03   FILLER                     PIC X(09) VALUE "190841810".
           03   FILLER                     PIC X(09) VALUE "190842010".
           03   FILLER                     PIC X(09) VALUE "190842210".
           03   FILLER                     PIC X(09) VALUE "190842410".
           03   FILLER                     PIC X(09) VALUE "190842610".
           03   FILLER                     PIC X(09) VALUE "190842810".
           03   FILLER                     PIC X(09) VALUE "190843010".
           03   FILLER                     PIC X(09) VALUE "190843210".
      *220 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190843410".
           03   FILLER                     PIC X(09) VALUE "190843610".
           03   FILLER                     PIC X(09) VALUE "190843810".
           03   FILLER                     PIC X(09) VALUE "190844010".
           03   FILLER                     PIC X(09) VALUE "190844210".
           03   FILLER                     PIC X(09) VALUE "190844410".
           03   FILLER                     PIC X(09) VALUE "190844610".
           03   FILLER                     PIC X(09) VALUE "190844810".
           03   FILLER                     PIC X(09) VALUE "190845010".
           03   FILLER                     PIC X(09) VALUE "190845210".
      *230 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190845410".
           03   FILLER                     PIC X(09) VALUE "190845610".
           03   FILLER                     PIC X(09) VALUE "190845810".
           03   FILLER                     PIC X(09) VALUE "190846010".
           03   FILLER                     PIC X(09) VALUE "190846210".
           03   FILLER                     PIC X(09) VALUE "190846410".
           03   FILLER                     PIC X(09) VALUE "190846610".
           03   FILLER                     PIC X(09) VALUE "190846810".
           03   FILLER                     PIC X(09) VALUE "190847010".
           03   FILLER                     PIC X(09) VALUE "190847210".
      *240 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190847410".
           03   FILLER                     PIC X(09) VALUE "190847610".
           03   FILLER                     PIC X(09) VALUE "190847810".
           03   FILLER                     PIC X(09) VALUE "190848010".
           03   FILLER                     PIC X(09) VALUE "190848210".
           03   FILLER                     PIC X(09) VALUE "190848410".
           03   FILLER                     PIC X(09) VALUE "190848610".
           03   FILLER                     PIC X(09) VALUE "190848810".
           03   FILLER                     PIC X(09) VALUE "190849010".
           03   FILLER                     PIC X(09) VALUE "190849210".
      *250 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190849410".
           03   FILLER                     PIC X(09) VALUE "190849610".
           03   FILLER                     PIC X(09) VALUE "190849810".
           03   FILLER                     PIC X(09) VALUE "190850010".
           03   FILLER                     PIC X(09) VALUE "190850210".
           03   FILLER                     PIC X(09) VALUE "190850410".
           03   FILLER                     PIC X(09) VALUE "190850610".
           03   FILLER                     PIC X(09) VALUE "190850810".
           03   FILLER                     PIC X(09) VALUE "190851010".
           03   FILLER                     PIC X(09) VALUE "190851210".
      *260 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190851410".
           03   FILLER                     PIC X(09) VALUE "190851610".
           03   FILLER                     PIC X(09) VALUE "190851810".
           03   FILLER                     PIC X(09) VALUE "190852010".
           03   FILLER                     PIC X(09) VALUE "190852210".
           03   FILLER                     PIC X(09) VALUE "190852410".
           03   FILLER                     PIC X(09) VALUE "190852610".
           03   FILLER                     PIC X(09) VALUE "190852810".
           03   FILLER                     PIC X(09) VALUE "190853010".
           03   FILLER                     PIC X(09) VALUE "190853210".
      *270 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190853410".
           03   FILLER                     PIC X(09) VALUE "190853610".
           03   FILLER                     PIC X(09) VALUE "190853810".
           03   FILLER                     PIC X(09) VALUE "190854010".
           03   FILLER                     PIC X(09) VALUE "190854210".
           03   FILLER                     PIC X(09) VALUE "190854410".
           03   FILLER                     PIC X(09) VALUE "190854610".
           03   FILLER                     PIC X(09) VALUE "190854810".
           03   FILLER                     PIC X(09) VALUE "190855010".
           03   FILLER                     PIC X(09) VALUE "190855210".
      *280 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190855410".
           03   FILLER                     PIC X(09) VALUE "190855610".
           03   FILLER                     PIC X(09) VALUE "190855810".
           03   FILLER                     PIC X(09) VALUE "190856010".
           03   FILLER                     PIC X(09) VALUE "190856210".
           03   FILLER                     PIC X(09) VALUE "190856410".
           03   FILLER                     PIC X(09) VALUE "190856610".
           03   FILLER                     PIC X(09) VALUE "190856810".
           03   FILLER                     PIC X(09) VALUE "190857010".
           03   FILLER                     PIC X(09) VALUE "190857210".
      *290 ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ¡¢ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190857410".
           03   FILLER                     PIC X(09) VALUE "190857610".
           03   FILLER                     PIC X(09) VALUE "190857810".
           03   FILLER                     PIC X(09) VALUE "190858010".
      *294 ÆÃÄêµ¡Ç½ÉÂ±¡¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅïÆþ±¡ÎÁ¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190265210".
      *295 Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124810".
      *296 ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
           03   FILLER                     PIC X(09) VALUE "190124210".
      *
       01  TBL-R06-SEIKATSU-R     REDEFINES  TBL-R06-SEIKATSU-AREA.
           03   TBL-R06-SEISRYCD           PIC X(09)  OCCURS  296.
      *
      *    °ì»þÎÎ°è
       01  WRK-AREA.
      *
           03  WRK-YMD.
               05  WRK-YYMM                PIC X(06).
               05  WRK-DD                  PIC 9(02).
           03  WRK-RJN-TBL.
               05  WRK-RJN                 PIC 9(01)   OCCURS   31.
      *    µßµÞÈÂÁ÷¿ÇÎÅÎÁ¤ò»»Äê¤·¡¢¤«¤Ä¡¢Æþ±¡ÎÁÌ¤»»Äê¤ÎÆü
           03  WRK-KYUKYU-DAY              PIC 9(02).
           03  WRK-KYUKYU-YMD              PIC X(08).
           03  WRK-KYUKYU-NYUINCD          PIC X(09).
      *
      *    ÊÝ¸±ÁÈ¹ç¤»ÂàÈò
           03  WRK-NYUIN-TABLE.
               05  WRK-NYUIN-TBL           OCCURS  31.
                   07  WRK-HKNCOMBI-DAY    PIC 9(03).
      *    »»ÄêÍ×·ï³°¶èÊ¬ÂàÈò
           03  WRK-SANTEIYOUKENKBN-TABLE.
               05  WRK-SANTEIYOUKENKBN     PIC X(01)  OCCURS  31.
      *
      *****************************************************************
      *    ¥Õ¥¡¥¤¥ë¥ì¥¤¥¢¥¦¥È
      *****************************************************************
      *
      *    ¥·¥¹¥Æ¥à´ÉÍý¥Þ¥¹¥¿
           COPY    "CPSYSKANRI.INC".
      *
           COPY    "CPSK5000.INC".
      *
      *    Æþ±¡¿ÇÎÅ²ñ·×¥Þ¥¹¥¿¡Ý
       01  NYUINACCT-REC.
           COPY    "CPNYUINACCT.INC".
      *
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼
       01  NYUINACT-REC.
           COPY    "CPNYUINACT.INC".
      *
      *    ´µ¼Ô¥Þ¥¹¥¿¡Ý
       01  PTINF-REC.
           COPY    "CPPTINF.INC".
      *
      *    ´µ¼Ô¸øÈñ¾ðÊó¥Þ¥¹¥¿¡Ý
       01  PTKOHINF-REC.
           COPY    "CPPTKOHINF.INC".
      *
      *    ´µ¼ÔÊÝ¸±¾ðÊó¥Þ¥¹¥¿¡Ý
       01  PTHKNINF-REC.
           COPY    "CPPTHKNINF.INC".
      *
      *    ÊÝ¸±ÁÈ¤ß¹ç¤ï¤»
       01  HKNCOMBI-REC.
           COPY    "CPHKNCOMBI.INC".
      *
      *    Ç¯¶â
       01  TNKRRK-REC.
           COPY    "CPTNKRRK.INC".
      *
      *    ´µ¼ÔÆþ±¡ÍúÎò
       01  PTNYUINRRK-REC.
           COPY    "CPPTNYUINRRK.INC".
      *
      *    £Ä£Â¸¡º÷
           COPY    "MCPDATA.INC".
      *
           COPY    "MCPAREA".
      *
      *****************************************************************
      *    ¥µ¥Ö¥×¥íÍÑ¡¡ÎÎ°è
      *****************************************************************
      *
      *   ÆüÉÕÊÑ´¹¥µ¥Ö
           COPY    "CPORCSDAY.INC".
           COPY    "CPORCSLNK.INC".
      *
      *    ÊÝ¸±»»ÄêÍÑÇ¯Îð¡¦³ä¹ç·×»»¥µ¥Ö
           COPY    "CPORCSAGECHK.INC".
      *
      *    ´µ¼Ô½êÆÀ¾ðÊóÊÔ½¸¥µ¥Ö
           COPY    "CPORCSSYOTOKU.INC".
      *
      *    Æþ±¡ÎÁÌ¤»»ÄêÆü¼èÆÀ¥µ¥Ö
           COPY    "CPORCSNYUINDAY.INC".
      *
      *    °åÎÅ¶èÊ¬¼èÆÀ¥µ¥Ö
           COPY    "CPORCSS008.INC".
      *
      *    ÆÃÄêÆþ±¡ÎÁ¥³¡¼¥É¼èÆÀ¥µ¥Ö
           COPY  "CPORCSTOKNYUIN.INC".
      *
      *    ¿©»öÉéÃ´¿ø¤¨ÃÖ¤­ÂÐ¾Ý¼èÆÀ¥Ñ¥é¥á¥¿
           COPY    "CPORCSSKJKEEP.INC".
      *
      *****************************************************************
      *    Ï¢Íí¡¡ÎÎ°è
      *****************************************************************
        LINKAGE                     SECTION.
      *
      *    Æþ±¡²ñ·×ºîÀ®ÍÑ¥Ñ¥é¥á¥¿
           COPY    "CPORCSNYULIFE2.INC".
      *
      *    ¥¹¥ÑÎÎ°è
           COPY    "COMMON-SPA".
      *
       PROCEDURE                   DIVISION    USING
           ORCSNYULIFE2-AREA
           SPA-AREA
           .
      *
      *****************************************************************
      *    ¼ç¡¡¡¡½èÍý
      *****************************************************************
       000-PROC-SEC                    SECTION.
      *
           INITIALIZE                  FLG-AREA
           INITIALIZE                  IDX-AREA
           INITIALIZE                  WRK-AREA
           INITIALIZE                  LNK-NYULIFE2-HENKYAKU-AREA
           MOVE    ZERO                TO  LNK-NYULIFE2-RC
      *
      *    ¥Ñ¥é¥á¡¼¥¿¥Á¥§¥Ã¥¯
           PERFORM 100-PRM-CHK-SEC
           IF    ( LNK-NYULIFE2-RC       NOT =   ZERO )
               GO  TO  000-PROC-EXT
           END-IF
      *
      *    ¼ç½èÍý
           IF      LNK-NYULIFE2-RC      =    ZERO
               PERFORM 200-MAIN-SEC
           END-IF
      *
      **     PERFORM    VARYING IDX   FROM   1   BY  1
      **                UNTIL IDX   >   31
      **       DISPLAY "IDX = " IDX
      **       DISPLAY "LNK-NYULIFE2-KBN = " LNK-NYULIFE2-KBN(IDX)
      **       DISPLAY "LNK-NYULIFE2-FTNKBN2 = " LNK-NYULIFE2-FTNKBN2(IDX)
      **       PERFORM   VARYING   IDX-T   FROM  1  BY  1
      **         UNTIL   IDX-T   >   3
      **         DISPLAY "IDX-T = " IDX-T
      **         DISPLAY "LNK-NYULIFE2-SKJ-SRYCD =" LNK-NYULIFE2-SKJ-SRYCD
      **                                                      (IDX IDX-T)
      **         DISPLAY "LNK-NYULIFE2-SKJ-MONEY =" LNK-NYULIFE2-SKJ-MONEY
      **                                                      (IDX IDX-T)
      **       END-PERFORM
      **     END-PERFORM
           .
       000-PROC-EXT.
      *
           EXIT    PROGRAM
           .
      *
      *****************************************************************
      *    ¥Ñ¥é¥á¡¼¥¿¥Á¥§¥Ã¥¯
      *****************************************************************
       100-PRM-CHK-SEC                     SECTION.
      *
      *    »»ÄêÇ¯·î¥Á¥§¥Ã¥¯
           IF     (LNK-NYULIFE2-SANTEIYM    =   SPACE)   OR
                  (LNK-NYULIFE2-SANTEIYM    <=  "201603")
               MOVE    1               TO  LNK-NYULIFE2-RC
               GO  TO  100-PRM-CHK-EXT
           END-IF
      *
      *    ´µ¼Ô¥Þ¥¹¥¿¡¼¸¡º÷
           INITIALIZE                       PTINF-REC
           MOVE    LNK-NYULIFE2-HOSPNUM  TO  PTINF-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID     TO  PTINF-PTID
           PERFORM 900-PTINF-READ-SEC
           IF      FLG-PTINF            NOT =   ZERO
               MOVE    2                TO  LNK-NYULIFE2-RC
               GO  TO  100-PRM-CHK-EXT
           ELSE
      *        ÊÝ¸±Ç¯Îð¤Î¥Á¥§¥Ã¥¯¡ÊÆþ±¡²ñ·×¥Þ¥¹¥¿¡¼¸¡º÷¡Ë
               INITIALIZE                   ORCSAGECHKAREA
               MOVE    LNK-NYULIFE2-HOSPNUM  TO  AGECHK-HOSPNUM
               MOVE    LNK-NYULIFE2-PTID     TO  AGECHK-PTID
               MOVE    LNK-NYULIFE2-SANTEIYM TO  AGECHK-SRYYMD(1:6)
               MOVE    "01"                  TO  AGECHK-SRYYMD(7:2)
               MOVE    PTINF-BIRTHDAY        TO  AGECHK-BIRTHDAY
               CALL   "ORCSAGECHK"    USING      ORCSAGECHKAREA
                                                 SPA-AREA
               IF      AGECHK-NENREI         <=  63
                   MOVE    4                TO  LNK-NYULIFE2-RC
                   GO  TO  100-PRM-CHK-EXT
               END-IF
           END-IF
      *
      *    Æþ±¡Ãæ¤Î¥Á¥§¥Ã¥¯¡ÊÆþ±¡²ñ·×¥Þ¥¹¥¿¡¼¸¡º÷¡Ë
           INITIALIZE                      NYUINACCT-REC
           MOVE    LNK-NYULIFE2-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID     TO  NACCT-PTID
           MOVE    LNK-NYULIFE2-SANTEIYM TO  NACCT-SRYYM
           MOVE    "5"                  TO  NACCT-ZAISKBKBN
           MOVE    "tbl_nyuinacct"      TO  MCP-TABLE
           MOVE    "key17"              TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT        NOT =   ZERO
               MOVE    3                TO  LNK-NYULIFE2-RC
           ELSE
               MOVE    "tbl_nyuinacct"  TO  MCP-TABLE
               MOVE    "key17"          TO  MCP-PATHNAME
               PERFORM 910-NYUINACCT-READ-SEC
               IF   FLG-NYUINACCT       =   ZERO
      *             ÆñÉÂ¸øÈñÈ½ÄêÍÑ¤ËÊÝ¸±ÁÈ¹ç¤»ÈÖ¹æ¤òÂàÈò
                    PERFORM    VARYING   IDX1   FROM   1   BY   1
                               UNTIL     IDX1   >      31
                        MOVE   NACCT-DAY (IDX1) TO 
                                            WRK-HKNCOMBI-DAY(IDX1)
                    END-PERFORM
               ELSE
                    MOVE    3           TO  LNK-NYULIFE2-RC
               END-IF
           END-IF
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
           .
       100-PRM-CHK-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¼ç¼èÆÀ
      *****************************************************************
       200-MAIN-SEC            SECTION.
      *
      *    °åÎÅ¶èÊ¬¼èÆÀ¥µ¥Ö¤Î¸Æ½Ð¤·¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Î°åÎÅ¶èÊ¬È½ÄêÍÑ¡Ë
           INITIALIZE                      SS008-AREA
           MOVE    LNK-NYULIFE2-HOSPNUM     TO  SPA-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID        TO  SPA-PTID
           MOVE    LNK-NYULIFE2-SANTEIYM    TO  SS008-SRYYM
           CALL   "ORCSS008"       USING   SS008-AREA
                                           SPA-AREA
      *     PERFORM   VARYING  IDX   FROM  1  BY  1
      *       UNTIL   IDX    >   31
      *          DISPLAY "SS008-MEDKBNDAY = " SS008-MEDKBNDAY(IDX)
      *     END-PERFORM
         
      *
      *    µßµÞÈÂÁ÷¿ÇÎÅÎÁ¤ò»»Äê¤·¡¢¤«¤Ä¡¢Æþ±¡ÎÁÌ¤»»Äê¤ÎÆü¤òÆÃÄê¤·¡¢
      *    ³ºÅöÆü¤Î¿©»ö¤¬À¸³èÎÅÍÜ¤Ë³ºÅö¤¹¤ë¤«È½Äê¡Ê¥µ¥Ö¥×¥í¤è¤ê¼èÆÀ¡Ë
           MOVE    ZERO                    TO  WRK-KYUKYU-DAY
           MOVE    SPACE                   TO  WRK-KYUKYU-YMD
           INITIALIZE                          ORCSNYUINDAY-AREA
           MOVE    LNK-NYULIFE2-HOSPNUM     TO  LNK-NYUINDAY-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID        TO  LNK-NYUINDAY-PTID
           MOVE    LNK-NYULIFE2-SANTEIYM    TO  LNK-NYUINDAY-SANTEIYM
           CALL    "ORCSNYUINDAY"      USING   ORCSNYUINDAY-AREA
                                               SPA-AREA
           IF      LNK-NYUINDAY-RC         =   ZERO
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                      UNTIL   IDX1   >   31
                         IF   (LNK-NYUINDAY-KBN(IDX1)   =   "1")   AND
                              (LNK-NYUINDAY-KYUKYU-KBN(IDX1)   =   "1")
                             MOVE    IDX1  TO  WRK-KYUKYU-DAY
                             MOVE    LNK-NYULIFE2-SANTEIYM
                                           TO  WRK-KYUKYU-YMD(1:6)
                             MOVE    WRK-KYUKYU-DAY
                                           TO  WRK-KYUKYU-YMD(7:2)
                         END-IF
                   END-PERFORM
           END-IF
           IF   WRK-KYUKYU-DAY             NOT =   ZERO
      *      ´µ¼ÔÆþ±¡ÍúÎò¤«¤é»»ÄêÆþ±¡ÎÁ¤Î¼èÆÀ
             INITIALIZE                          PTNYUINRRK-REC
             MOVE   LNK-NYULIFE2-HOSPNUM   TO  PTNYUINRRK-HOSPNUM
             MOVE   LNK-NYULIFE2-PTID      TO  PTNYUINRRK-PTID
             MOVE   LNK-NYULIFE2-SANTEIYM  TO  PTNYUINRRK-TENNYUYMD(1:6)
             MOVE   "99"                   TO  PTNYUINRRK-TENNYUYMD(7:2)
             MOVE   LNK-NYULIFE2-SANTEIYM  TO  PTNYUINRRK-TENSTUYMD(1:6)
             MOVE   "01"                   TO  PTNYUINRRK-TENSTUYMD(7:2)
             MOVE   "tbl_ptnyuinrrk"       TO  MCP-TABLE
             MOVE   "key44"                TO  MCP-PATHNAME
             PERFORM 910-PTNYUINRRK-SELECT-SEC
             IF      FLG-PTNYUINRRK        =   ZERO
               MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
               MOVE    "key44"             TO  MCP-PATHNAME
               PERFORM 910-PTNYUINRRK-READ-SEC
               PERFORM  UNTIL  
                  ( FLG-PTNYUINRRK         =   1  )
      *
                   IF  (PTNYUINRRK-TENNYUYMD  <=  WRK-KYUKYU-YMD) AND
                       (WRK-KYUKYU-YMD        <=  PTNYUINRRK-TENSTUYMD)
      *               ÆÃÄêÆþ±¡ÎÁ¥³¡¼¥É¤ò¥µ¥Ö¥×¥í¤è¤ê¼èÆÀ
                      INITIALIZE             ORCSTOKNYUIN-AREA
                      MOVE  PTNYUINRRK-TOKUTEI-KBN
                                           TO  LNK-TOKNYUIN-KBN
                      MOVE  PTNYUINRRK-TOKUTEI-NYUIN
                                           TO  LNK-TOKNYUIN-NYUIN
                      MOVE  PTNYUINRRK-BTUNUM
                                           TO  LNK-TOKNYUIN-BTUNUM
                      MOVE  PTNYUINRRK-BRMNUM
                                           TO  LNK-TOKNYUIN-BRMNUM
                      MOVE  PTNYUINRRK-TOKU-SANTEIYOUKENKBN
                                       TO  LNK-TOKNYUIN-SANTEIYOUKENKBN
      *                DISPLAY "PTNYUINRRK-TOKU-SANTEIYOUKENKBN = "
      *                         PTNYUINRRK-TOKU-SANTEIYOUKENKBN
                      MOVE  WRK-KYUKYU-YMD
                                           TO  LNK-TOKNYUIN-SANTEIYMD
                      CALL  "ORCSTOKNYUIN"   USING    ORCSTOKNYUIN-AREA
                                                      SPA-AREA
                      IF    LNK-TOKNYUIN-RC   =    ZERO
                         IF    LNK-TOKNYUIN-GAI-SRYCD =  SPACE
                              MOVE   LNK-TOKNYUIN-SRYCD
                                           TO  WRK-KYUKYU-NYUINCD
                         ELSE
                              MOVE   LNK-TOKNYUIN-GAI-SRYCD
                                           TO  WRK-KYUKYU-NYUINCD
                         END-IF
                   END-IF
      *
                   END-IF
                   MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
                   MOVE    "key44"             TO  MCP-PATHNAME
                   PERFORM 910-PTNYUINRRK-READ-SEC
      *
               END-PERFORM
             END-IF
      *
             MOVE    "tbl_ptnyuinrrk"      TO  MCP-TABLE
             MOVE    "key44"               TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
           END-IF
      *
      *    ´µ¼ÔÆþ±¡ÍúÎò¤«¤éÆÃÄêÆþ±¡ÎÁ¤Î»»ÄêÍ×·ï¶èÊ¬¼èÆÀ
           MOVE   SPACE                  TO  WRK-SANTEIYOUKENKBN-TABLE
           INITIALIZE                        PTNYUINRRK-REC
           MOVE   LNK-NYULIFE2-HOSPNUM   TO  PTNYUINRRK-HOSPNUM
           MOVE   LNK-NYULIFE2-PTID      TO  PTNYUINRRK-PTID
           MOVE   LNK-NYULIFE2-SANTEIYM  TO  PTNYUINRRK-TENNYUYMD(1:6)
           MOVE   "99"                   TO  PTNYUINRRK-TENNYUYMD(7:2)
           MOVE   LNK-NYULIFE2-SANTEIYM  TO  PTNYUINRRK-TENSTUYMD(1:6)
           MOVE   "01"                   TO  PTNYUINRRK-TENSTUYMD(7:2)
           MOVE   "tbl_ptnyuinrrk"       TO  MCP-TABLE
           MOVE   "key44"                TO  MCP-PATHNAME
           PERFORM 910-PTNYUINRRK-SELECT-SEC
           IF      FLG-PTNYUINRRK        =   ZERO
             MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
             MOVE    "key44"             TO  MCP-PATHNAME
             PERFORM 910-PTNYUINRRK-READ-SEC
             PERFORM  UNTIL   ( FLG-PTNYUINRRK         =   1  )
      *
                IF (PTNYUINRRK-TENNYUYMD(1:6)  =  LNK-NYULIFE2-SANTEIYM)
                AND
                   (PTNYUINRRK-TENSTUYMD(1:6)  =  LNK-NYULIFE2-SANTEIYM)
                    MOVE   PTNYUINRRK-TENNYUYMD(7:2)   TO  IDX-ST
                    MOVE   PTNYUINRRK-TENSTUYMD(7:2)   TO  IDX-ED
                END-IF
                IF (PTNYUINRRK-TENNYUYMD(1:6)  <  LNK-NYULIFE2-SANTEIYM)
                AND
                   (PTNYUINRRK-TENSTUYMD(1:6)  =  LNK-NYULIFE2-SANTEIYM)
                    MOVE   1                           TO  IDX-ST
                    MOVE   PTNYUINRRK-TENSTUYMD(7:2)   TO  IDX-ED
                END-IF
                IF (PTNYUINRRK-TENNYUYMD(1:6)  =  LNK-NYULIFE2-SANTEIYM)
                AND
                   (PTNYUINRRK-TENSTUYMD(1:6)  >  LNK-NYULIFE2-SANTEIYM)
                    MOVE   PTNYUINRRK-TENNYUYMD(7:2)   TO  IDX-ST
                    MOVE   31                          TO  IDX-ED
                END-IF
                IF (PTNYUINRRK-TENNYUYMD(1:6)  <  LNK-NYULIFE2-SANTEIYM)
                AND
                   (PTNYUINRRK-TENSTUYMD(1:6)  >  LNK-NYULIFE2-SANTEIYM)
                    MOVE   1                           TO  IDX-ST
                    MOVE   31                          TO  IDX-ED
                END-IF
      *
      **          DISPLAY "IDX-ST = " IDX-ST
      **          DISPLAY "IDX-ED = " IDX-ED
      **          DISPLAY "PTNYUINRRK-TOKU-SANTEIYOUKENKBN = "
      **                   PTNYUINRRK-TOKU-SANTEIYOUKENKBN
                PERFORM    VARYING   IDX1  FROM   IDX-ST  BY  1
                  UNTIL   (IDX1    >  IDX-ED)
      **                DISPLAY "SET IDX1 = " IDX1
                      IF    PTNYUINRRK-TOKU-SANTEIYOUKENKBN  =  "1"
                         MOVE  "1"    TO  WRK-SANTEIYOUKENKBN(IDX1)
                      ELSE
                         MOVE  SPACE  TO  WRK-SANTEIYOUKENKBN(IDX1)
                      END-IF
                END-PERFORM
      *
                MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
                MOVE    "key44"             TO  MCP-PATHNAME
                PERFORM 910-PTNYUINRRK-READ-SEC
             END-PERFORM
           END-IF
      *
           MOVE     "tbl_ptnyuinrrk"      TO  MCP-TABLE
           MOVE     "key44"               TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *    ¿©»öÉéÃ´¿ø¤¨ÃÖ¤­ÂÐ¾Ý¼èÆÀ¥µ¥Ö
           INITIALIZE                      ORCSSKJKEEP-AREA
           MOVE    LNK-NYULIFE2-HOSPNUM    TO  LNK-SKJKEEP-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID       TO  LNK-SKJKEEP-PTID
           MOVE    LNK-NYULIFE2-SANTEIYM   TO  LNK-SKJKEEP-SANTEIYM
           CALL    "ORCSSKJKEEP"    USING      ORCSSKJKEEP-AREA
                                               SPA-AREA

      *    Æþ±¡»þÀ¸³èÎÅÍÜÈñ¤Î³ºÅöÆü¤È·Ú¸º¶èÊ¬£²¡ÊÆþ±¡ÎÁÈ½Äê¡Ë¤ò¼èÆÀ
           MOVE    ZERO                    TO  FLG-OK
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-NYULIFE2-HOSPNUM    TO  NACCT-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID       TO  NACCT-PTID
           MOVE    LNK-NYULIFE2-SANTEIYM   TO  NACCT-SRYYM
           MOVE    "1"                     TO  NACCT-ZAISKBKBN
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               MOVE    "key17"             TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   UNTIL   (FLG-NYUINACCT    =   1)
                   IF    NACCT-SRYCDTOTAL     =    99999916
                       CONTINUE
                   ELSE
      *             ¡ÊÊ¿À®£²£¸Ç¯£´·î¤«¤éÊ¿À®£³£°Ç¯£³·î¤Þ¤Ç¡Ë
                     IF  (LNK-NYULIFE2-SANTEIYM >=  "201604")  AND
                         (LNK-NYULIFE2-SANTEIYM <=  "201803")
      *                À¸³èÎÅÍÜ¤Ë³ºÅö¤¹¤ëÆþ±¡ÎÁ¤òÈ½Äê¤·¡¢
      *                ÊÖµÑÃÍ¤ÎÂÐ¾Ý¶èÊ¬¤òÀßÄê¤¹¤ë
                       PERFORM    210-NYUINACT-GET-SEC
                       MOVE       ZERO        TO   FLG-SEI
                                                   IDX-SEI2
                       PERFORM    VARYING   IDX-SEI  FROM 1  BY  1
                         UNTIL   (IDX-SEI   >  103)    OR
                                 (FLG-SEI   =    1)
                             IF  NSRY-SRYCD(1) = TBL-H28-SEISRYCD
                                                        (IDX-SEI)
                                 MOVE   1        TO   FLG-SEI
                                 MOVE   IDX-SEI  TO   IDX-SEI2
                             END-IF
                       END-PERFORM
                       IF   FLG-SEI    =    1
                          PERFORM    VARYING   IDX1   FROM   1   BY   1
                                  UNTIL     IDX1   >   31
                            IF     NACCT-DAY(IDX1)  NOT =  ZERO
                               MOVE   "1"    TO   LNK-NYULIFE2-KBN(IDX1)
                               MOVE    1     TO   FLG-OK
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆþ±¡ÎÁÈ½ÃÇ¡Ë
                               IF  (IDX-SEI2   >=   1 )   AND
                                   (IDX-SEI2   <=   40)
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        ÆñÉÂ¸øÈñ¤ÎÈ½ÄêÄÉ²Ã¡Ê°Ê²¼Æþ±¡ÎÁ¤Î¾ì¹ç¤Î¤ß¡Ë
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ
                               IF  (IDX-SEI2   >=   94)   AND
                                   (IDX-SEI2   <=  101)
      *                          ÆñÉÂ¸øÈñ¤ò»ÈÍÑ¤µ¤ì¤Æ¤¤¤ë¤«È½Äê
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  WRK-HKNCOMBI-DAY(IDX1) NOT =  ZERO
                                     INITIALIZE            HKNCOMBI-REC
                                     MOVE   LNK-NYULIFE2-HOSPNUM
                                                   TO  COMB-HOSPNUM
                                     MOVE   LNK-NYULIFE2-PTID 
                                                   TO  COMB-PTID
                                     MOVE   WRK-HKNCOMBI-DAY(IDX1)
                                                   TO  COMB-HKNCOMBINUM
                                     MOVE   "tbl_hkncombi"
                                                   TO  MCP-TABLE
                                     MOVE    "key" TO  MCP-PATHNAME
                                     PERFORM 910-HKNCOMBI-SELECT-SEC
                                     IF   FLG-HKNCOMBI      =   ZERO
                                       MOVE  "tbl_hkncombi"
                                                   TO  MCP-TABLE
                                       MOVE  "key"  TO  MCP-PATHNAME
                                       PERFORM   910-HKNCOMBI-READ-SEC
                                       IF  FLG-HKNCOMBI         =  ZERO
                                         IF  (COMB-KOHHKNNUM(1) = "054")
                                          OR (COMB-KOHHKNNUM(2) = "054")
                                          OR (COMB-KOHHKNNUM(3) = "054")
                                          OR (COMB-KOHHKNNUM(4) = "054")
                                             MOVE  1    TO   FLG-NANBYO
                                         END-IF
                                       END-IF
                                     END-IF
      *                              ÊÝ¸±ÁÈ¹ç¤»¥¯¥í¡¼¥º
                                     MOVE    "tbl_hkncombi"
                                                        TO  MCP-TABLE
                                     MOVE    "key"      TO  MCP-PATHNAME
                                     PERFORM   900-CLOSE-SEC
                                 END-IF
      *
                                 IF   FLG-NANBYO  =   1
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Î
      *                                                    £Á£Ä£ÌÆþÎÏÈ½ÃÇ¡Ë
                               IF (IDX-SEI2   =  102  OR 103)    AND
                                  (SS008-MEDKBNDAY(IDX1)  =  "2" OR
                                                             "3" )
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        »»ÄêÍ×·ï³°¤ÇÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤ò»»Äê»þ
      *                        ¤Ï°åÎÅ¶èÊ¬¤ÈÆñÉÂ¸øÈñ¤Î¥À¥Ö¥ë¥Á¥§¥Ã¥¯
      **                         DISPLAY "IDX-SEI2 = " IDX-SEI2
      **                         DISPLAY "IDX1 = " IDX1
      **                         DISPLAY "WRK-SANTEIYOUKENKBN = "
      **                                 WRK-SANTEIYOUKENKBN(IDX1)
                               IF (IDX-SEI2       =  47 OR 50 OR
                                                     53 OR 56 OR 59) AND
                                 ((SS008-MEDKBNDAY(IDX1) = "2" OR
                                                           "3"))  AND
                                  (WRK-SANTEIYOUKENKBN(IDX1) = "1")
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
                            END-IF
                          END-PERFORM
                       END-IF
                     END-IF
      *
      *             ¡ÊÊ¿À®£³£°Ç¯£´·î¤«¤éÎáÏÂ£²Ç¯£³·î¤Þ¤Ç¡Ë
                     IF  (LNK-NYULIFE2-SANTEIYM >=  "201804")  AND
                         (LNK-NYULIFE2-SANTEIYM <=  "202003")
      *                À¸³èÎÅÍÜ¤Ë³ºÅö¤¹¤ëÆþ±¡ÎÁ¤òÈ½Äê¤·¡¢
      *                ÊÖµÑÃÍ¤ÎÂÐ¾Ý¶èÊ¬¤òÀßÄê¤¹¤ë
                       PERFORM    210-NYUINACT-GET-SEC
                       MOVE       ZERO        TO   FLG-SEI
                                                   IDX-SEI2
                       PERFORM    VARYING   IDX-SEI  FROM 1  BY  1
                         UNTIL   (IDX-SEI   >  99)    OR
                                 (FLG-SEI   =    1)
                             IF  NSRY-SRYCD(1) = TBL-H30-SEISRYCD
                                                        (IDX-SEI)
                                 MOVE   1        TO   FLG-SEI
                                 MOVE   IDX-SEI  TO   IDX-SEI2
                             END-IF
                       END-PERFORM
                       IF   FLG-SEI    =    1
                          PERFORM    VARYING   IDX1   FROM   1   BY   1
                                  UNTIL     IDX1   >   31
                            IF     NACCT-DAY(IDX1)  NOT =  ZERO
                               MOVE   "1"    TO   LNK-NYULIFE2-KBN(IDX1)
                               MOVE    1     TO   FLG-OK
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆþ±¡ÎÁÈ½ÃÇ¡Ë
                               IF  (IDX-SEI2   >=   1 )   AND
                                   (IDX-SEI2   <=   37)
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        ÆñÉÂ¸øÈñ¤ÎÈ½ÄêÄÉ²Ã¡Ê°Ê²¼Æþ±¡ÎÁ¤Î¾ì¹ç¤Î¤ß¡Ë
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ
                               IF  (IDX-SEI2   >=   82)   AND
                                   (IDX-SEI2   <=   97)
      *                          ÆñÉÂ¸øÈñ¤ò»ÈÍÑ¤µ¤ì¤Æ¤¤¤ë¤«È½Äê
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  WRK-HKNCOMBI-DAY(IDX1) NOT =  ZERO
                                     INITIALIZE            HKNCOMBI-REC
                                     MOVE   LNK-NYULIFE2-HOSPNUM
                                                   TO  COMB-HOSPNUM
                                     MOVE   LNK-NYULIFE2-PTID 
                                                   TO  COMB-PTID
                                     MOVE   WRK-HKNCOMBI-DAY(IDX1)
                                                   TO  COMB-HKNCOMBINUM
                                     MOVE   "tbl_hkncombi"
                                                   TO  MCP-TABLE
                                     MOVE    "key" TO  MCP-PATHNAME
                                     PERFORM 910-HKNCOMBI-SELECT-SEC
                                     IF   FLG-HKNCOMBI      =   ZERO
                                       MOVE  "tbl_hkncombi"
                                                   TO  MCP-TABLE
                                       MOVE  "key"  TO  MCP-PATHNAME
                                       PERFORM   910-HKNCOMBI-READ-SEC
                                       IF  FLG-HKNCOMBI         =  ZERO
                                         IF  (COMB-KOHHKNNUM(1) = "054")
                                          OR (COMB-KOHHKNNUM(2) = "054")
                                          OR (COMB-KOHHKNNUM(3) = "054")
                                          OR (COMB-KOHHKNNUM(4) = "054")
                                             MOVE  1    TO   FLG-NANBYO
                                         END-IF
                                       END-IF
                                     END-IF
      *                              ÊÝ¸±ÁÈ¹ç¤»¥¯¥í¡¼¥º
                                     MOVE    "tbl_hkncombi"
                                                        TO  MCP-TABLE
                                     MOVE    "key"      TO  MCP-PATHNAME
                                     PERFORM   900-CLOSE-SEC
                                 END-IF
      *
                                 IF   FLG-NANBYO  =   1
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Î
      *                                                    £Á£Ä£ÌÆþÎÏÈ½ÃÇ¡Ë
                               IF (IDX-SEI2   =  98  OR  99)    AND
                                  (SS008-MEDKBNDAY(IDX1)  =  "2" OR
                                                             "3" )
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        »»ÄêÍ×·ï³°¤ÇÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤ò»»Äê»þ
      *                        ¤Ï°åÎÅ¶èÊ¬¤ÈÆñÉÂ¸øÈñ¤Î¥À¥Ö¥ë¥Á¥§¥Ã¥¯
      **                         DISPLAY "IDX-SEI2 = " IDX-SEI2
      **                         DISPLAY "IDX1 = " IDX1
      **                         DISPLAY "WRK-SANTEIYOUKENKBN = "
      **                                 WRK-SANTEIYOUKENKBN(IDX1)
                               IF (IDX-SEI2       =  44 OR 47 OR
                                                     50 OR 51 OR
                                                     54) AND
                                 ((SS008-MEDKBNDAY(IDX1) = "2" OR
                                                           "3"))  AND
                                  (WRK-SANTEIYOUKENKBN(IDX1) = "1")
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        µÞÀ­Áý°­¤Ë¤è¤êÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤Î»»Äê»þ
      *                        ¤Ï¿©»öÉéÃ´¿ø¤¨ÃÖ¤­¡Ê¥·¥¹¥Æ¥àÍ½ÌóÆþÎÏ¡Ë
                               IF (IDX-SEI2       =  44 OR 47 OR
                                                     50 OR 51 OR
                                                     54)
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF (LNK-SKJKEEP-KBN(IDX1)  =   "1") AND
                                    (LNK-SKJKEEP-NANBYOKBN(IDX1) = "2")
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
                            END-IF
                          END-PERFORM
                       END-IF
                     END-IF
      *
      *             ¡ÊÎáÏÂ£²Ç¯£´·î¤«¤éÎáÏÂ£´Ç¯£³·î¤Þ¤Ç¡Ë
                     IF  (LNK-NYULIFE2-SANTEIYM >=  "202004")  AND
                         (LNK-NYULIFE2-SANTEIYM <=  "202203")
      *                À¸³èÎÅÍÜ¤Ë³ºÅö¤¹¤ëÆþ±¡ÎÁ¤òÈ½Äê¤·¡¢
      *                ÊÖµÑÃÍ¤ÎÂÐ¾Ý¶èÊ¬¤òÀßÄê¤¹¤ë
                       PERFORM    210-NYUINACT-GET-SEC
                       MOVE       ZERO        TO   FLG-SEI
                                                   IDX-SEI2
                       PERFORM    VARYING   IDX-SEI  FROM 1  BY  1
                         UNTIL   (IDX-SEI   >  96)    OR
                                 (FLG-SEI   =    1)
                             IF  NSRY-SRYCD(1) = TBL-R02-SEISRYCD
                                                        (IDX-SEI)
                                 MOVE   1        TO   FLG-SEI
                                 MOVE   IDX-SEI  TO   IDX-SEI2
                             END-IF
                       END-PERFORM
                       IF   FLG-SEI    =    1
                          PERFORM    VARYING   IDX1   FROM   1   BY   1
                                  UNTIL     IDX1   >   31
                            IF     NACCT-DAY(IDX1)  NOT =  ZERO
                               MOVE   "1"    TO   LNK-NYULIFE2-KBN(IDX1)
                               MOVE    1     TO   FLG-OK
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆþ±¡ÎÁÈ½ÃÇ¡Ë
                               IF  (IDX-SEI2   >=   1 )   AND
                                   (IDX-SEI2   <=   31)
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        ÆñÉÂ¸øÈñ¤ÎÈ½ÄêÄÉ²Ã¡Ê°Ê²¼Æþ±¡ÎÁ¤Î¾ì¹ç¤Î¤ß¡Ë
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ
                               IF  (IDX-SEI2   >=   71)   AND
                                   (IDX-SEI2   <=   94)
      *                          ÆñÉÂ¸øÈñ¤ò»ÈÍÑ¤µ¤ì¤Æ¤¤¤ë¤«È½Äê
      **                           DISPLAY "FLG-NANBYO = " FLG-NANBYO
      **                           MOVE   ZERO       TO   FLG-NANBYO
      **                           IF  WRK-HKNCOMBI-DAY(IDX1) NOT =  ZERO
      **                               INITIALIZE            HKNCOMBI-REC
      **                               MOVE   LNK-NYULIFE2-HOSPNUM
      **                                             TO  COMB-HOSPNUM
      **                               MOVE   LNK-NYULIFE2-PTID 
      **                                             TO  COMB-PTID
      **                               MOVE   WRK-HKNCOMBI-DAY(IDX1)
      **                                             TO  COMB-HKNCOMBINUM
      **                               MOVE   "tbl_hkncombi"
      **                                             TO  MCP-TABLE
      **                               MOVE    "key" TO  MCP-PATHNAME
      **                               PERFORM 910-HKNCOMBI-SELECT-SEC
      **                               IF   FLG-HKNCOMBI      =   ZERO
      **                                 MOVE  "tbl_hkncombi"
      **                                             TO  MCP-TABLE
      **                                 MOVE  "key"  TO  MCP-PATHNAME
      **                                 PERFORM   910-HKNCOMBI-READ-SEC
      **                                 IF  FLG-HKNCOMBI         =  ZERO
      **                                   IF  (COMB-KOHHKNNUM(1) = "054")
      **                                    OR (COMB-KOHHKNNUM(2) = "054")
      **                                    OR (COMB-KOHHKNNUM(3) = "054")
      **                                    OR (COMB-KOHHKNNUM(4) = "054")
      **                                       MOVE  1    TO   FLG-NANBYO
      **                                   END-IF
      **                                 END-IF
      **                               END-IF
      ***                              ÊÝ¸±ÁÈ¹ç¤»¥¯¥í¡¼¥º
      **                               MOVE    "tbl_hkncombi"
      **                                                  TO  MCP-TABLE
      **                               MOVE    "key"      TO  MCP-PATHNAME
      **                               PERFORM   900-CLOSE-SEC
      **                           END-IF
      *
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF   FLG-NANBYO  =   1
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Î
      *                                                    £Á£Ä£ÌÆþÎÏÈ½ÃÇ¡Ë
                               IF (IDX-SEI2   =  95  OR  96)    AND
                                  (SS008-MEDKBNDAY(IDX1)  =  "2" OR
                                                             "3" )
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        »»ÄêÍ×·ï³°¤ÇÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤ò»»Äê»þ
      *                        ¤Ï°åÎÅ¶èÊ¬¤ÈÆñÉÂ¸øÈñ¤Î¥À¥Ö¥ë¥Á¥§¥Ã¥¯
      **                         DISPLAY "IDX-SEI2 = " IDX-SEI2
      **                         DISPLAY "IDX1 = " IDX1
      **                         DISPLAY "WRK-SANTEIYOUKENKBN = "
      **                                 WRK-SANTEIYOUKENKBN(IDX1)
                               IF (IDX-SEI2       =  38 OR 41 OR 44) AND
                                 ((SS008-MEDKBNDAY(IDX1) = "2" OR
                                                           "3"))  AND
                                  (WRK-SANTEIYOUKENKBN(IDX1) = "1")
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        µÞÀ­Áý°­¤Ë¤è¤êÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤Î»»Äê»þ
      *                        ¤Ï¿©»öÉéÃ´¿ø¤¨ÃÖ¤­¡Ê¥·¥¹¥Æ¥àÍ½ÌóÆþÎÏ¡Ë
                               IF (IDX-SEI2       =  38 OR 41 OR 44)
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF (LNK-SKJKEEP-KBN(IDX1)  =   "1") AND
                                    (LNK-SKJKEEP-NANBYOKBN(IDX1) = "2")
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
                            END-IF
                          END-PERFORM
                       END-IF
                     END-IF
      *
      *             ¡ÊÎáÏÂ£´Ç¯£´·î¤«¤éÎáÏÂ£¶Ç¯£µ·î¤Þ¤Ç¡Ë
                     IF  (LNK-NYULIFE2-SANTEIYM >=  "202204")  AND
                         (LNK-NYULIFE2-SANTEIYM <=  "202405")
      *                À¸³èÎÅÍÜ¤Ë³ºÅö¤¹¤ëÆþ±¡ÎÁ¤òÈ½Äê¤·¡¢
      *                ÊÖµÑÃÍ¤ÎÂÐ¾Ý¶èÊ¬¤òÀßÄê¤¹¤ë
                       PERFORM    210-NYUINACT-GET-SEC
                       MOVE       ZERO        TO   FLG-SEI
                                                   IDX-SEI2
                       PERFORM    VARYING   IDX-SEI  FROM 1  BY  1
                         UNTIL   (IDX-SEI   >  184)    OR
                                 (FLG-SEI   =    1)
                             IF  NSRY-SRYCD(1) = TBL-R04-SEISRYCD
                                                        (IDX-SEI)
                                 MOVE   1        TO   FLG-SEI
                                 MOVE   IDX-SEI  TO   IDX-SEI2
                             END-IF
                       END-PERFORM
                       IF   FLG-SEI    =    1
                          PERFORM    VARYING   IDX1   FROM   1   BY   1
                                  UNTIL     IDX1   >   31
                            IF     NACCT-DAY(IDX1)  NOT =  ZERO
                               MOVE   "1"    TO   LNK-NYULIFE2-KBN(IDX1)
                               MOVE    1     TO   FLG-OK
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆþ±¡ÎÁÈ½ÃÇ¡Ë
                               IF  (IDX-SEI2   >=   1 )   AND
                                   (IDX-SEI2   <=   32)
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        ÆñÉÂ¸øÈñ¤ÎÈ½ÄêÄÉ²Ã¡Ê°Ê²¼Æþ±¡ÎÁ¤Î¾ì¹ç¤Î¤ß¡Ë
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ
                               IF  (IDX-SEI2   >=   110)   AND
                                   (IDX-SEI2   <=   181)
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF   FLG-NANBYO  =   1
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Î
      *                                                    £Á£Ä£ÌÆþÎÏÈ½ÃÇ¡Ë
                               IF (IDX-SEI2   =  183  OR  184)    AND
                                  (SS008-MEDKBNDAY(IDX1)  =  "2" OR
                                                             "3" )
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        »»ÄêÍ×·ï³°¤ÇÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤ò»»Äê»þ
      *                        ¤Ï°åÎÅ¶èÊ¬¤ÈÆñÉÂ¸øÈñ¤Î¥À¥Ö¥ë¥Á¥§¥Ã¥¯
      **                         DISPLAY "IDX-SEI2 = " IDX-SEI2
      **                         DISPLAY "IDX1 = " IDX1
      **                         DISPLAY "WRK-SANTEIYOUKENKBN = "
      **                                 WRK-SANTEIYOUKENKBN(IDX1)
                               IF (IDX-SEI2       =  39 OR 42 OR 45) AND
                                 ((SS008-MEDKBNDAY(IDX1) = "2" OR
                                                           "3"))  AND
                                  (WRK-SANTEIYOUKENKBN(IDX1) = "1")
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        µÞÀ­Áý°­¤Ë¤è¤êÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£É¤Î»»Äê»þ
      *                        ¤Ï¿©»öÉéÃ´¿ø¤¨ÃÖ¤­¡Ê¥·¥¹¥Æ¥àÍ½ÌóÆþÎÏ¡Ë
                               IF (IDX-SEI2       =  39 OR 42 OR 45)
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF (LNK-SKJKEEP-KBN(IDX1)  =   "1") AND
                                    (LNK-SKJKEEP-NANBYOKBN(IDX1) = "2")
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
                            END-IF
                          END-PERFORM
                       END-IF
                     END-IF
      *
      *             ¡ÊÎáÏÂ£¶Ç¯£¶·î¤«¤é¡Ë
                     IF  LNK-NYULIFE2-SANTEIYM >=  "202406"
      *                À¸³èÎÅÍÜ¤Ë³ºÅö¤¹¤ëÆþ±¡ÎÁ¤òÈ½Äê¤·¡¢
      *                ÊÖµÑÃÍ¤ÎÂÐ¾Ý¶èÊ¬¤òÀßÄê¤¹¤ë
                       PERFORM    210-NYUINACT-GET-SEC
                       MOVE       ZERO        TO   FLG-SEI
                                                   IDX-SEI2
                       PERFORM    VARYING   IDX-SEI  FROM 1  BY  1
                         UNTIL   (IDX-SEI   >  296)    OR
                                 (FLG-SEI   =    1)
                             IF  NSRY-SRYCD(1) = TBL-R06-SEISRYCD
                                                        (IDX-SEI)
                                 MOVE   1        TO   FLG-SEI
                                 MOVE   IDX-SEI  TO   IDX-SEI2
                             END-IF
                       END-PERFORM
                       IF   FLG-SEI    =    1
                          PERFORM    VARYING   IDX1   FROM   1   BY   1
                                  UNTIL     IDX1   >   31
                            IF     NACCT-DAY(IDX1)  NOT =  ZERO
                               MOVE   "1"    TO   LNK-NYULIFE2-KBN(IDX1)
                               MOVE    1     TO   FLG-OK
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆþ±¡ÎÁÈ½ÃÇ¡Ë
                               IF  (IDX-SEI2   >=   1 )   AND
                                   (IDX-SEI2   <=   66)
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        ÆñÉÂ¸øÈñ¤ÎÈ½ÄêÄÉ²Ã¡Ê°Ê²¼Æþ±¡ÎÁ¤Î¾ì¹ç¤Î¤ß¡Ë
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢ÉÂÅïÆþ±¡ÎÁ
      *                        ¡¦ÃÏ°èÊñ³ç¥±¥¢Æþ±¡°åÎÅ´ÉÍýÎÁ
                               IF  (IDX-SEI2   >=   150)   AND
                                   (IDX-SEI2   <=   293)
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF   FLG-NANBYO  =   1
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        ÉÂ¾õ¤ÎÄøÅÙ¡¢¼£ÎÅ¤ÎÆâÍÆ¤ò¤·¤ó¼à¤·¤ÆÉ¸½à
      *                        ÉéÃ´³Û¤ò·Ú¸º¤¹¤ë´µ¼Ô¤ÎÈ½Äê¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ»»Äê»þ¤Î
      *                                                    £Á£Ä£ÌÆþÎÏÈ½ÃÇ¡Ë
                               IF (IDX-SEI2   =  295  OR  296)    AND
                                  (SS008-MEDKBNDAY(IDX1)  =  "2" OR
                                                             "3" )
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
      *                        »»ÄêÍ×·ï³°¤ÇÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£²£·¤ò»»Äê»þ
      *                        ¤Ï°åÎÅ¶èÊ¬¤ÈÆñÉÂ¸øÈñ¤Î¥À¥Ö¥ë¥Á¥§¥Ã¥¯
      **                         DISPLAY "IDX-SEI2 = " IDX-SEI2
      **                         DISPLAY "IDX1 = " IDX1
      **                         DISPLAY "WRK-SANTEIYOUKENKBN = "
      **                                 WRK-SANTEIYOUKENKBN(IDX1)
                               IF (IDX-SEI2       =  73 OR 76) AND
                                 ((SS008-MEDKBNDAY(IDX1) = "2" OR
                                                           "3"))  AND
                                  (WRK-SANTEIYOUKENKBN(IDX1) = "1")
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF  LNK-SKJKEEP-KBN(IDX1)  =   "1"
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
      *                        µÞÀ­Áý°­¤Ë¤è¤êÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¤Î£²£·¤Î»»Äê»þ
      *                        ¤Ï¿©»öÉéÃ´¿ø¤¨ÃÖ¤­¡Ê¥·¥¹¥Æ¥àÍ½ÌóÆþÎÏ¡Ë
                               IF (IDX-SEI2       =  73 OR 76)
                                 MOVE   ZERO       TO   FLG-NANBYO
                                 IF (LNK-SKJKEEP-KBN(IDX1)  =   "1") AND
                                    (LNK-SKJKEEP-NANBYOKBN(IDX1) = "2")
                                     MOVE  1    TO   FLG-NANBYO
                                 END-IF
                                 IF  FLG-NANBYO          =   1 
                                   MOVE   "1"   TO   
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                                 END-IF
                               END-IF
                            END-IF
                          END-PERFORM
                       END-IF
                     END-IF
      *
                   END-IF
      *
                   MOVE    "tbl_nyuinacct"      TO  MCP-TABLE
                   MOVE    "key17"              TO  MCP-PATHNAME
                   PERFORM 910-NYUINACCT-READ-SEC
               END-PERFORM
           END-IF
      *
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *    Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡ÊÃ»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£³¡Ë¤ÎÆþ±¡ÎÁÌ¤»»ÄêÆü
      *    ¤Ë¤Ä¤¤¤ÆÀ¸³èÎÅÍÜ¤Î³ºÅöÆü¤È·Ú¸º¶èÊ¬£²¤Î¾ðÊó¤ò¼èÆÀ¡Ê¥µ¥Ö¥×¥í¤è¤ê¼èÆÀ¡Ë
           INITIALIZE                          ORCSNYUINDAY-AREA
           MOVE    LNK-NYULIFE2-HOSPNUM     TO  LNK-NYUINDAY-HOSPNUM
           MOVE    LNK-NYULIFE2-PTID        TO  LNK-NYUINDAY-PTID
           MOVE    LNK-NYULIFE2-SANTEIYM    TO  LNK-NYUINDAY-SANTEIYM
           CALL    "ORCSNYUINDAY"      USING   ORCSNYUINDAY-AREA
                                               SPA-AREA
           IF      LNK-NYUINDAY-RC         =   ZERO
               IF    LNK-NYUINDAY-TANKI2-TBL   NOT =    SPACE
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                      UNTIL   IDX1   >   31
                         IF    LNK-NYUINDAY-TANKI2-KBN(IDX1)   =   "2"
                               MOVE   "1"   TO   LNK-NYULIFE2-KBN(IDX1)
                               MOVE   "1"   TO
                                             LNK-NYULIFE2-FTNKBN2(IDX1)
                               IF   LNK-NYUINDAY-TANKI3-KBN(IDX1) = "2"
                                    MOVE   SPACE  TO
                                              LNK-NYULIFE2-FTNKBN2(IDX1)
                               END-IF
                               MOVE    1    TO   FLG-OK
                         END-IF
                   END-PERFORM
               END-IF
           END-IF
      *
      *¡Ý¡Ý¡Ý¡Ý°åÎÅµ¡´Ø¿©»ö¾ðÊó¼èÆÀ¤³¤³¤«¤é¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý
      *°åÎÅµ¡´Ø¿©»ö¾ðÊó¤Î¼èÆÀ¡Ê¥·¥¹¥Æ¥à´ÉÍý¥Æ¡¼¥Ö¥ë¤è¤ê¡Ë
           MOVE    ZERO                TO  FLG-SYSKANRI
           INITIALIZE                      SYSKANRI-REC
           MOVE    LNK-NYULIFE2-HOSPNUM TO  SYS-HOSPNUM
           MOVE    "5000"              TO  SYS-KANRICD
           MOVE    "*"                 TO  SYS-KBNCD
           MOVE    LNK-NYULIFE2-SANTEIYM
                                       TO  SYS-STYUKYMD(1:6)
           MOVE    "01"                TO  SYS-STYUKYMD(7:2)
           MOVE    SYS-STYUKYMD        TO  SYS-EDYUKYMD
           MOVE    SYSKANRI-REC        TO  MCPDATA-REC
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key10"             TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"  TO  MCP-TABLE
               MOVE    "key10"         TO  MCP-PATHNAME
               PERFORM  910-SYSKANRI-READ-SEC
      *        ¿©»ö¾ðÊó¤ÎÂàÈò
               IF     SYS-5000-SHOKUJIRYOYOCD  NOT =  SPACE
                   PERFORM    VARYING   IDX1  FROM  1  BY  1
                          UNTIL     IDX1   >    31
                       IF    LNK-NYULIFE2-KBN(IDX1)   =   "1"
      *                   Æþ±¡»þ¿©»öÎÅÍÜÈñ
                           IF   SYS-5000-SHOKUJIRYOYOCD  = "197000110"
                                MOVE   "1"     TO  
                                          LNK-NYULIFE2-SKJKBN(IDX1)
                           ELSE
                                MOVE   "2"     TO  
                                          LNK-NYULIFE2-SKJKBN(IDX1)
                           END-IF
                       END-IF
                   END-PERFORM
               END-IF
           END-IF
      *    ¥·¥¹¥Æ¥à´ÉÍý¥¯¥í¡¼¥º
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key10"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *·îÆâ¤Î°åÎÅµ¡´Ø¿©»ö¾ðÊó¤Î¼èÆÀ¡Ê¥·¥¹¥Æ¥à´ÉÍý¥Æ¡¼¥Ö¥ë¤è¤ê¡Ë
           MOVE    ZERO                TO  FLG-SYSKANRI
           INITIALIZE                      SYSKANRI-REC
           MOVE    LNK-NYULIFE2-HOSPNUM TO  SYS-HOSPNUM
           MOVE    "5000"              TO  SYS-KANRICD
           MOVE    "*"                 TO  SYS-KBNCD
           MOVE    LNK-NYULIFE2-SANTEIYM
                                       TO  SYS-STYUKYMD(1:6)
           MOVE    "__"                TO  SYS-STYUKYMD(7:2)
           MOVE    SYSKANRI-REC        TO  MCPDATA-REC
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key11"             TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           DISPLAY "MCP-RC =" MCP-RC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"  TO  MCP-TABLE
               MOVE    "key11"         TO  MCP-PATHNAME
               PERFORM  910-SYSKANRI-READ-SEC
               PERFORM  UNTIL   FLG-SYSKANRI   =   1
                  MOVE  SYS-5000-STYUKYMD(7:2)   TO  IDV
      *           ¿©»ö¾ðÊó¤ÎÂàÈò
                  IF     SYS-5000-SHOKUJIRYOYOCD  NOT =  SPACE
                      PERFORM    VARYING   IDX1  FROM  IDV  BY  1
                             UNTIL     IDX1   >    31
                          IF    LNK-NYULIFE2-KBN(IDX1)   =   "1"
      *                      Æþ±¡»þ¿©»öÎÅÍÜÈñ
                              IF   SYS-5000-SHOKUJIRYOYOCD = "197000110"
                                   MOVE   "1"     TO  
                                             LNK-NYULIFE2-SKJKBN(IDX1)
                              ELSE
                                   MOVE   "2"     TO  
                                             LNK-NYULIFE2-SKJKBN(IDX1)
                              END-IF
                          END-IF
                      END-PERFORM
                  END-IF
                  MOVE    "tbl_syskanri"  TO  MCP-TABLE
                  MOVE    "key11"         TO  MCP-PATHNAME
                  PERFORM  910-SYSKANRI-READ-SEC
               END-PERFORM
           END-IF
      *    ¥·¥¹¥Æ¥à´ÉÍý¥¯¥í¡¼¥º
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key11"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *¡Ý¡Ý¡Ý¡Ý°åÎÅµ¡´Ø¿©»ö¾ðÊó¼èÆÀ¼èÆÀ¤³¤³¤Þ¤Ç¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý¡Ý
      *
      *
           IF    FLG-OK   =    1
      *
      *        Ï·¿ÍÅ¬ÍÑ¤Î¥Á¥§¥Ã¥¯
               IF      LNK-NYULIFE2-SANTEIYM <=  "200803"
      *          ¡ÊÊ¿À®£²£°Ç¯£³·î°ÊÁ°¤ÏÏ·¿ÍÊÝ·ò¤ÎÈ½Äê¥Á¥§¥Ã¥¯¡Ë
                   MOVE    ZERO                 TO  FLG-RJN 
                   INITIALIZE                       PTKOHINF-REC
                   MOVE    LNK-NYULIFE2-HOSPNUM  TO  PTKOH-HOSPNUM
                   MOVE    LNK-NYULIFE2-PTID     TO  PTKOH-PTID
                   MOVE    "027"                TO  PTKOH-KOHNUM
                   MOVE    "tbl_ptkohinf"       TO  MCP-TABLE
                   MOVE    "key4"               TO  MCP-PATHNAME
                   PERFORM 910-PTKOHINF-SELECT-SEC
                   IF      FLG-PTKOHINF         =   ZERO
                       MOVE    "tbl_ptkohinf"       TO  MCP-TABLE
                       MOVE    "key4"               TO  MCP-PATHNAME
                       PERFORM   910-PTKOHINF-READ-SEC
                       PERFORM   UNTIL   (FLG-PTKOHINF   =   1)
                           IF    PTKOH-SAKJOKBN     =    SPACE
                                 MOVE   1           TO   FLG-RJN
                           END-IF
                           MOVE    "tbl_ptkohinf"   TO  MCP-TABLE
                           MOVE    "key4"           TO  MCP-PATHNAME
                           PERFORM 910-PTKOHINF-READ-SEC
                       END-PERFORM
                   END-IF
      *            ´µ¼Ô¸øÈñ¾ðÊó¥¯¥í¡¼¥º
                   MOVE    "tbl_ptkohinf"       TO  MCP-TABLE
                   MOVE    "key4"               TO  MCP-PATHNAME
                   PERFORM   900-CLOSE-SEC
               ELSE
      *          ¡ÊÊ¿À®£²£°Ç¯£´·î°Ê¹ß¤Ï¥µ¥Ö¥ë¡¼¥Á¥ó¤Ë¤è¤ê¥Á¥§¥Ã¥¯¡Ë
                   PERFORM  VARYING    IDX-RJN    FROM   1   BY  1
                     UNTIL  IDX-RJN    >   31
                       INITIALIZE                   ORCSAGECHKAREA
                       MOVE    LNK-NYULIFE2-HOSPNUM  TO  AGECHK-HOSPNUM
                       MOVE    LNK-NYULIFE2-PTID     TO  AGECHK-PTID
                       MOVE    LNK-NYULIFE2-SANTEIYM TO  WRK-YYMM
                       MOVE    IDX-RJN              TO  WRK-DD
                       MOVE    WRK-YMD              TO  AGECHK-SRYYMD
                       CALL   "ORCSAGECHK"          USING
                                                    ORCSAGECHKAREA
                                                    SPA-AREA
                       IF      AGECHK-ROUJIN2    =   1
                           MOVE   1              TO  WRK-RJN(IDX-RJN)
                       END-IF
                   END-PERFORM
               END-IF
      *
      *¡Ý¡Ý¡Ý¡Ý¥µ¥Ö¥ë¡¼¥Á¥ó¤Ç¤Î´µ¼Ô½êÆÀ¾ðÊó¤Î¼èÆÀ¤³¤³¤«¤é¡Ý¡Ý¡Ý¡Ý¡Ý
               INITIALIZE                          ORCSSYOTOKUAREA
               MOVE    LNK-NYULIFE2-HOSPNUM    TO  LNK-SYOTOKU-HOSPNUM
               MOVE    LNK-NYULIFE2-PTID       TO  LNK-SYOTOKU-PTID
               MOVE    LNK-NYULIFE2-SANTEIYM   TO  LNK-SYOTOKU-SRYYM
               MOVE    "1"                     TO  LNK-SYOTOKU-SKJCHKFLG
               CALL   "ORCSSYOTOKU"    USING    ORCSSYOTOKUAREA
                                                SPA-AREA
               IF    LNK-SYOTOKU-RC    =        ZERO
                    PERFORM   VARYING   IDX1   FROM   1  BY  1
                              UNTIL     IDX1   >    31
      *                  DISPLAY "IDX1 = " IDX1
      *                  DISPLAY "AGEKBN,SKJKBN,KKSKBN = "
      *                           LNK-SYOTOKU-AGEKBN(IDX1)
      *                          ","
      *                           LNK-SYOTOKU-SKJKBN(IDX1)
      *                          ","
      *                           LNK-SYOTOKU-KKSKBN(IDX1)
                        EVALUATE   LNK-SYOTOKU-SKJKBN(IDX1)
                            WHEN  "1"
                                MOVE  "3"  TO LNK-NYULIFE2-FTNKBN1(IDX1)
                            WHEN  "2"
                                MOVE  "1"  TO LNK-NYULIFE2-FTNKBN1(IDX1)
                            WHEN  "3"
                                MOVE  "2"  TO LNK-NYULIFE2-FTNKBN1(IDX1)
                            WHEN  "4"
                                MOVE  "4"  TO LNK-NYULIFE2-FTNKBN1(IDX1)
                        END-EVALUATE
                    END-PERFORM
               ELSE
                    DISPLAY "ORCSSYTOKU RC = " LNK-SYOTOKU-RC
               END-IF
      *¡Ý¡Ý¡Ý¡Ý¥µ¥Ö¥ë¡¼¥Á¥ó¤Ç¤Î´µ¼Ô½êÆÀ¾ðÊó¤Î¼èÆÀ¤³¤³¤Þ¤Ç¡Ý¡Ý¡Ý¡Ý¡Ý
      *
      *
      *¡Ý¡Ý¡Ý¡Ý¿©»öÎÅÍÜ¡¢´Ä¶­ÎÅÍÜ¥³¡¼¥É¡¢Ã±²ÁÀßÄê¤³¤³¤«¤é¡Ý¡Ý¡Ý¡Ý¡Ý
            PERFORM   VARYING   IDX-T   FROM   1  BY  1
              UNTIL   IDX-T     >  3
               INITIALIZE                        NYUINACCT-REC
               MOVE    LNK-NYULIFE2-HOSPNUM  TO  NACCT-HOSPNUM
               MOVE    LNK-NYULIFE2-PTID     TO  NACCT-PTID
               MOVE    LNK-NYULIFE2-SANTEIYM TO  NACCT-SRYYM
               MOVE    "tbl_nyuinacct"       TO  MCP-TABLE
               EVALUATE   IDX-T
                   WHEN   1
                       MOVE    "key30"       TO  MCP-PATHNAME
                   WHEN   2
                       MOVE    "key31"       TO  MCP-PATHNAME
                   WHEN   3
                       MOVE    "key32"       TO  MCP-PATHNAME
               END-EVALUATE
               PERFORM 910-NYUINACCT-SELECT-SEC
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               EVALUATE   IDX-T
                   WHEN   1
                       MOVE    "key30"       TO  MCP-PATHNAME
                   WHEN   2
                       MOVE    "key31"       TO  MCP-PATHNAME
                   WHEN   3
                       MOVE    "key32"       TO  MCP-PATHNAME
               END-EVALUATE
               PERFORM   910-NYUINACCT-READ-SEC
      *
      *       Æþ±¡²ñ·×¥¯¥í¡¼¥º
               MOVE    "tbl_nyuinacct"             TO  MCP-TABLE
               EVALUATE   IDX-T
                   WHEN   1
                       MOVE    "key30"       TO  MCP-PATHNAME
                   WHEN   2
                       MOVE    "key31"       TO  MCP-PATHNAME
                   WHEN   3
                       MOVE    "key32"       TO  MCP-PATHNAME
               END-EVALUATE
               PERFORM   900-CLOSE-SEC
      *
               IF   LNK-NYULIFE2-SANTEIYM   <=  "202405"
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                  IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-SKJKBN(IDX1)
                        WHEN  "1"
                            IF    NACCT-DAY(IDX1) NOT =  3
                              MOVE  "197001310"   TO
                                            LNK-NYULIFE2-SKJ-SRYCD
                                                            (IDX1 IDX-T)
                              MOVE   554          TO
                                            LNK-NYULIFE2-SKJ-MONEY
                                                            (IDX1 IDX-T)
                            ELSE
                              MOVE  "197003510"   TO
                                            LNK-NYULIFE2-SKJ-SRYCD
                                                            (IDX1 IDX-T)
                              MOVE   500          TO
                                            LNK-NYULIFE2-SKJ-MONEY
                                                            (IDX1 IDX-T)
                            END-IF
                            MOVE  "197001410"   TO
                                            LNK-NYULIFE2-KAN-SRYCD(IDX1)
                            MOVE   398          TO
                                            LNK-NYULIFE2-KAN-MONEY(IDX1)
                        WHEN  "2"
                            MOVE  "197001710"   TO
                                            LNK-NYULIFE2-SKJ-SRYCD
                                                            (IDX1 IDX-T)
                            MOVE   420          TO
                                            LNK-NYULIFE2-SKJ-MONEY
                                                            (IDX1 IDX-T)
                            MOVE  "197001810"   TO
                                            LNK-NYULIFE2-KAN-SRYCD(IDX1)
                            MOVE   398          TO
                                            LNK-NYULIFE2-KAN-MONEY(IDX1)
                    END-EVALUATE
                  END-IF
                END-PERFORM
               ELSE
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                  IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-SKJKBN(IDX1)
                        WHEN  "1"
                            IF    NACCT-DAY(IDX1) NOT =  3
                              MOVE  "197001310"   TO
                                            LNK-NYULIFE2-SKJ-SRYCD
                                                            (IDX1 IDX-T)
                              MOVE   584          TO
                                            LNK-NYULIFE2-SKJ-MONEY
                                                            (IDX1 IDX-T)
                            ELSE
                              MOVE  "197003510"   TO
                                            LNK-NYULIFE2-SKJ-SRYCD
                                                            (IDX1 IDX-T)
                              MOVE   530          TO
                                            LNK-NYULIFE2-SKJ-MONEY
                                                            (IDX1 IDX-T)
                            END-IF
                            MOVE  "197001410"   TO
                                            LNK-NYULIFE2-KAN-SRYCD(IDX1)
                            MOVE   398          TO
                                            LNK-NYULIFE2-KAN-MONEY(IDX1)
                        WHEN  "2"
                            MOVE  "197001710"   TO
                                            LNK-NYULIFE2-SKJ-SRYCD
                                                            (IDX1 IDX-T)
                            MOVE   450          TO
                                            LNK-NYULIFE2-SKJ-MONEY
                                                            (IDX1 IDX-T)
                            MOVE  "197001810"   TO
                                            LNK-NYULIFE2-KAN-SRYCD(IDX1)
                            MOVE   398          TO
                                            LNK-NYULIFE2-KAN-MONEY(IDX1)
                    END-EVALUATE
                  END-IF
                END-PERFORM
               END-IF
      *¡Ý¡Ý¡Ý¡Ý¿©»öÎÅÍÜ¡¢´Ä¶­ÎÅÍÜ¥³¡¼¥É¡¢Ã±²ÁÀßÄê¤³¤³¤Þ¤Ç¡Ý¡Ý¡Ý¡Ý¡Ý
      *
      *¡Ý¡Ý¡Ý¡Ý¿©»öÉéÃ´¡¢´Ä¶­ÎÅÍÜÉéÃ´¥³¡¼¥É¡¢Ã±²ÁÀßÄê¤³¤³¤«¤é¡Ý¡Ý¡Ý
      *        À¸³èÎÅÍÜ¿©»öÉ¸½àÉéÃ´³ÛÀßÄê¡Ê°ìÈÌ½êÆÀ¼Ô¡Ë¡ÊÎáÏÂ£¶Ç¯£µ·î¤Þ¤Ç¡Ë
               IF   LNK-NYULIFE2-SANTEIYM   <=  "202405"
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                 IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-SKJKBN(IDX1)
                        WHEN  "1"
                            MOVE  "197002010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                            MOVE   460          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                        WHEN  "2"
                            MOVE  "197002110"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                            MOVE   420          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                    END-EVALUATE
                 END-IF
                END-PERFORM
               END-IF
      *        À¸³èÎÅÍÜ¿©»öÉ¸½àÉéÃ´³ÛÀßÄê¡Ê°ìÈÌ½êÆÀ¼Ô¡Ë¡ÊÎáÏÂ£¶Ç¯£¶·î°Ê¹ß¡Ë
               IF   LNK-NYULIFE2-SANTEIYM   >=  "202406"
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                 IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-SKJKBN(IDX1)
                        WHEN  "1"
                            MOVE  "197002010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                            MOVE   490          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                        WHEN  "2"
                            MOVE  "197002110"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                            MOVE   450          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                    END-EVALUATE
                 END-IF
                END-PERFORM
               END-IF
      *
      *        À¸³èÎÅÍÜ¿©»öÉ¸½àÉéÃ´³ÛÀßÄê¡Ê·Ú¸º¤¢¤ê¤Î´µ¼Ô¡Ë¡ÊÊ¿À®£²£¹Ç¯£¹·îËø¡Ë
               IF   LNK-NYULIFE2-SANTEIYM <=  "201709"
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                 IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-FTNKBN2(IDX1)
                        WHEN  SPACE
      *                   ½êÆÀ¤Î¾õ¶·¤Ë¤è¤ë·Ú¸º
                            EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
                                WHEN   "1"
                                WHEN   "2"
      *                           ¡ÊÄã£²¡Ë
                                    MOVE  "197002210"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                WHEN   "3"
      *                           ¡ÊÄã£±¡Ë
                                    IF  (FLG-RJN         =  0)   AND
                                        (WRK-RJN(IDX1)   =  0)                                        
                                       MOVE  "197002310"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   130          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    ELSE
                                       MOVE  "197002410"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   130          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
                                WHEN   "4"
      *                           ¡ÊÄã£±¡ÝÏ·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô¡Ë
                                    MOVE  "197002510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                            END-EVALUATE
                        WHEN  "1"
      *                   ÉÂ¾õ¤ÎÄøÅÙ¤Ë¤è¤ë·Ú¸º
                            EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
                                WHEN   SPACE
      *                           ¡Ê°åÎÅ¶èÊ¬£²¡¢£³¡Ê°ìÈÌ¡Ë¡Ë
                                    MOVE  "197002710"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    IF    LNK-NYULIFE2-SANTEIYM
                                                        >= "201604"
                                       MOVE   360      TO
                                           LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                             ÆñÉÂÅù¿ø¤¨ÃÖ¤­´µ¼Ô¤ÎÃÖ´¹
                                    EVALUATE     LNK-SKJKEEP-KBN(IDX1)
                                        WHEN     "1"
                                           MOVE  "197003610"   TO
                                              LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                           MOVE   260      TO
                                             LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                        WHEN     "2"
                                           MOVE  "197003710"   TO
                                              LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                           MOVE   260      TO
                                             LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-EVALUATE
                                WHEN   "1"
      *                           ¡Ê°åÎÅ¶èÊ¬£²¡¢£³¡ÊÄã£²¡¡£¹£°Æü°Ê²¼¡Ë¡Ë
                                    MOVE  "197002810"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                WHEN   "2"
      *                           ¡Ê°åÎÅ¶èÊ¬£²¡¢£³¡ÊÄã£²¡¡£¹£°ÆüÄ¶¡Ë¡Ë
                                    MOVE  "197002910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   160          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                WHEN   "3"
                                WHEN   "4"
      *                           ¡Ê°åÎÅ¶èÊ¬£²¡¢£³¡ÊÄã£±¡Ë¡Ë
                                    MOVE  "197003010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                            END-EVALUATE
                    END-EVALUATE
                 END-IF
                END-PERFORM
               END-IF
      *
      *        À¸³èÎÅÍÜ¿©»öÉ¸½àÉéÃ´³ÛÀßÄê¡Ê·Ú¸º¤¢¤ê¤Î´µ¼Ô¡Ë
      *       ¡ÊÊ¿À®£²£¹Ç¯£±£°·î¤«¤éÎáÏÂ£¶Ç¯£µ·î¤Þ¤Ç¡Ë
               IF   (LNK-NYULIFE2-SANTEIYM >=  "201710")  AND
                    (LNK-NYULIFE2-SANTEIYM <=  "202405")
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                 IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-FTNKBN2(IDX1)
      *             ¡Ê°åÎÅ¶èÊ¬£±¡Ë
                      WHEN  SPACE
                        EVALUATE    LNK-SYOTOKU-AGEKBN(IDX1)
      *                   £·£°ºÐÌ¤Ëþ
                          WHEN    "2"
                            EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ¥ª
                                WHEN   "1"
                                WHEN   "2"
                                    MOVE  "197003910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ¶­³¦ÁØ´µ¼Ô
                                    IF   LNK-SYOTOKU-KKSKBN(IDX1) = "1"
                                      MOVE  "197004010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
                            END-EVALUATE
      *                   £·£°ºÐ°Ê¾å
                          WHEN    "1"
                            EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ£²
                                WHEN   "1"
                                WHEN   "2"
                                    MOVE  "197002210"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                         Äã½êÆÀ£±
                                WHEN   "3"
                                    IF  (FLG-RJN         =  0)   AND
                                        (WRK-RJN(IDX1)   =  0)                                        
                                       MOVE  "197002310"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   130          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    ELSE
                                       MOVE  "197002410"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
      *                                ÎáÏÂ£²Ç¯¿©»öÉéÃ´¥³¡¼¥ÉÇÑ»ßÂÐ±þ
      *                                197002410 -> 197002310
                                       IF   LNK-NYULIFE2-SANTEIYM >=  
                                                               "202004"
                                         MOVE  "197002310"   TO
                                           LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       END-IF
                                       MOVE   130          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                             ¶­³¦ÁØ´µ¼Ô
                                    IF   LNK-SYOTOKU-KKSKBN(IDX1) = "1"
                                      MOVE  "197004110"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£±¡ÝÏ·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô
                                WHEN   "4"
                                    MOVE  "197002510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                            END-EVALUATE
                        END-EVALUATE
      *             ¡Ê°åÎÅ¶èÊ¬£²¡¢£³¡Ë
                      WHEN  "1"
      *                   °ìÈÌ½êÆÀ¼Ô
                          IF   LNK-NYULIFE2-FTNKBN1(IDX1)  =  SPACE
                              MOVE  "197002710"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                              IF    LNK-NYULIFE2-SANTEIYM
                                                      >= "201604"
                                       MOVE   360      TO
                                           LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-IF
      *                       Ê¿À®£³£°Ç¯²þÀµ
                              IF    LNK-NYULIFE2-SANTEIYM
                                                      >= "201804"
                                  IF   LNK-NYULIFE2-SKJKBN(IDX1)  =  "1"
                                       MOVE  "197005110"   TO
                                             LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   460      TO
                                           LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                  ELSE
                                       MOVE  "197005210"   TO
                                             LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   420      TO
                                           LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                  END-IF
                              END-IF
      *                       ÆñÉÂÅù¿ø¤¨ÃÖ¤­´µ¼Ô¤ÎÃÖ´¹
                              EVALUATE     LNK-SKJKEEP-KBN(IDX1)
                                  WHEN     "1"
                                      MOVE  "197003610"   TO
                                              LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   260      TO
                                             LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                  WHEN     "2"
                                      MOVE  "197003710"   TO
                                              LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   260      TO
                                             LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-EVALUATE
                          END-IF
      *
                          EVALUATE    LNK-SYOTOKU-AGEKBN(IDX1)
      *                     £·£°ºÐÌ¤Ëþ
                            WHEN    "2"
                              EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ¥ª¡¡£¹£°Æü°Ê²¼
                                WHEN   "1"
                                    MOVE  "197004210"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004310"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ¥ª¡¡£¹£°ÆüÄ¶
                                WHEN   "2"
                                    MOVE  "197004410"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   160          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   160          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
                              END-EVALUATE
      *                       ¶­³¦ÁØ´µ¼Ô
                              IF  (LNK-NYULIFE2-FTNKBN1(IDX1) = "1" OR
                                                                "2") AND 
                                  (LNK-SYOTOKU-KKSKBN(IDX1)   = "1")
                                  MOVE  "197004610"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                        (IDX1 IDX-T)
                                  MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-IF
      *
      *                     £·£°ºÐ°Ê¾å
                            WHEN    "1"
                              EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ£²¡¡£¹£°Æü°Ê²¼
                                WHEN   "1"
                                    MOVE  "197002810"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004710"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   210          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£²¡¡£¹£°ÆüÄ¶
                                WHEN   "2"
                                    MOVE  "197002910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   160          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004810"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   160          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£±
                                WHEN   "3"
                                    MOVE  "197003010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                      MOVE  "197004910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                             ¶­³¦ÁØ´µ¼Ô
                                    IF   LNK-SYOTOKU-KKSKBN(IDX1) = "1"
                                      MOVE  "197005010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£±¡ÝÏ·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô
                                WHEN   "4"
                                    MOVE  "197002510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   100          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-EVALUATE
      *
                          END-EVALUATE
                    END-EVALUATE
                 END-IF
                END-PERFORM
               END-IF
      *
      *        À¸³èÎÅÍÜ¿©»öÉ¸½àÉéÃ´³ÛÀßÄê¡Ê·Ú¸º¤¢¤ê¤Î´µ¼Ô¡Ë¡ÊÎáÏÂ£¶Ç¯£¶·î°Ê¹ß¡Ë
               IF   LNK-NYULIFE2-SANTEIYM >=  "202406"
                PERFORM   VARYING   IDX1   FROM   1  BY  1
                 UNTIL   IDX1   >    31
                 IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    EVALUATE  LNK-NYULIFE2-FTNKBN2(IDX1)
      *             ¡Ê°åÎÅ¶èÊ¬£±¡Ë
                      WHEN  SPACE
                        EVALUATE    LNK-SYOTOKU-AGEKBN(IDX1)
      *                   £·£°ºÐÌ¤Ëþ
                          WHEN    "2"
                            EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ¥ª
                                WHEN   "1"
                                WHEN   "2"
                                    MOVE  "197003910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   230          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ¶­³¦ÁØ´µ¼Ô
                                    IF   LNK-SYOTOKU-KKSKBN(IDX1) = "1"
                                      MOVE  "197004010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
                            END-EVALUATE
      *                   £·£°ºÐ°Ê¾å
                          WHEN    "1"
                            EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ£²
                                WHEN   "1"
                                WHEN   "2"
                                    MOVE  "197002210"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   230          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                         Äã½êÆÀ£±
                                WHEN   "3"
                                    IF  (FLG-RJN         =  0)   AND
                                        (WRK-RJN(IDX1)   =  0)                                        
                                       MOVE  "197002310"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   140          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    ELSE
                                       MOVE  "197002310"   TO
                                           LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   140          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                             ¶­³¦ÁØ´µ¼Ô
                                    IF   LNK-SYOTOKU-KKSKBN(IDX1) = "1"
                                      MOVE  "197004110"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£±¡ÝÏ·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô
                                WHEN   "4"
                                    MOVE  "197002510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                            END-EVALUATE
                        END-EVALUATE
      *             ¡Ê°åÎÅ¶èÊ¬£²¡¢£³¡Ë
                      WHEN  "1"
      *                   °ìÈÌ½êÆÀ¼Ô
                          IF   LNK-NYULIFE2-FTNKBN1(IDX1)  =  SPACE
                              IF   LNK-NYULIFE2-SKJKBN(IDX1)  =  "1"
                                   MOVE  "197005110"   TO
                                             LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                   MOVE   490      TO
                                           LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              ELSE
                                   MOVE  "197005210"   TO
                                             LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                   MOVE   450      TO
                                           LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-IF
      *                       ÆñÉÂÅù¿ø¤¨ÃÖ¤­´µ¼Ô¤ÎÃÖ´¹
                              EVALUATE     LNK-SKJKEEP-KBN(IDX1)
                                  WHEN     "1"
                                      MOVE  "197003610"   TO
                                              LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   280      TO
                                             LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                  WHEN     "2"
                                      MOVE  "197003710"   TO
                                              LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   260      TO
                                             LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-EVALUATE
                          END-IF
      *
                          EVALUATE    LNK-SYOTOKU-AGEKBN(IDX1)
      *                     £·£°ºÐÌ¤Ëþ
                            WHEN    "2"
                              EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ¥ª¡¡£¹£°Æü°Ê²¼
                                WHEN   "1"
                                    MOVE  "197004210"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   230          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004310"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   230          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ¥ª¡¡£¹£°ÆüÄ¶
                                WHEN   "2"
                                    MOVE  "197004410"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   180          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   180          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
                              END-EVALUATE
      *                       ¶­³¦ÁØ´µ¼Ô
                              IF  (LNK-NYULIFE2-FTNKBN1(IDX1) = "1" OR
                                                                "2") AND 
                                  (LNK-SYOTOKU-KKSKBN(IDX1)   = "1")
                                  MOVE  "197004610"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                        (IDX1 IDX-T)
                                  MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-IF
      *
      *                     £·£°ºÐ°Ê¾å
                            WHEN    "1"
                              EVALUATE   LNK-NYULIFE2-FTNKBN1(IDX1)
      *                         Äã½êÆÀ£²¡¡£¹£°Æü°Ê²¼
                                WHEN   "1"
                                    MOVE  "197002810"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   230          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004710"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   230          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£²¡¡£¹£°ÆüÄ¶
                                WHEN   "2"
                                    MOVE  "197002910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   180          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                       MOVE  "197004810"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                       MOVE   180          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£±
                                WHEN   "3"
                                    MOVE  "197003010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
      *                             ÆñÉÂ´µ¼Ô¤ÎÃÖ´¹
                                    IF   LNK-SKJKEEP-KBN(IDX1)  =  "1"
                                      MOVE  "197004910"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                             ¶­³¦ÁØ´µ¼Ô
                                    IF   LNK-SYOTOKU-KKSKBN(IDX1) = "1"
                                      MOVE  "197005010"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                      MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                                    END-IF
      *                         Äã½êÆÀ£±¡ÝÏ·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô
                                WHEN   "4"
                                    MOVE  "197002510"   TO
                                         LNK-NYULIFE2-SKJFTN-SRYCD
                                                            (IDX1 IDX-T)
                                    MOVE   110          TO
                                         LNK-NYULIFE2-SKJFTN-MONEY
                                                            (IDX1 IDX-T)
                              END-EVALUATE
      *
                          END-EVALUATE
                    END-EVALUATE
                 END-IF
                END-PERFORM
               END-IF
      *
            END-PERFORM
      *
      *      À¸³èÎÅÍÜ´Ä¶­ÎÅÍÜÉ¸½àÉéÃ´³ÛÀßÄê
             IF   LNK-NYULIFE2-SANTEIYM <=  "201709"
      *        Ê¿À®£²£¹Ç¯£¹·îËø
               PERFORM   VARYING   IDX1   FROM   1  BY  1
               UNTIL   IDX1   >    31
                IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
                    IF  LNK-NYULIFE2-FTNKBN2(IDX1)   =   SPACE
                        MOVE  "197001910"       TO
                                        LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  320       TO
                                        LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
      *             Ï·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô¤Ï´Ä¶­ÎÅÍÜ´µ¼ÔÉéÃ´Ìµ¤·¤ËÃÖ´¹¤¨
                    IF  LNK-NYULIFE2-FTNKBN1(IDX1)   =   "4"
                        MOVE  SPACE  TO  LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  ZERO   TO  LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
      *             Àº¿ÀÉÂ¾²£±Ç¯Ä¶¤Ç°åÎÅ¶èÊ¬£²¡¢£³¤Ï´µ¼ÔÉéÃ´Ìµ¤·¤ËÃÖ´¹¤¨
                    IF (LNK-NYULIFE2-FTNKBN2(IDX1)   =  "1")   AND
                       (LNK-SKJKEEP-KBN(IDX1)        =  "2")
                        MOVE  SPACE  TO  LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  ZERO   TO  LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
                END-IF
               END-PERFORM
             ELSE
      *        Ê¿À®£²£¹Ç¯£±£°·î°Ê¹ß
               PERFORM   VARYING   IDX1   FROM   1  BY  1
               UNTIL   IDX1   >    31
                IF   LNK-NYULIFE2-KBN(IDX1)   =   "1"
      *             °åÎÅ¶èÊ¬£±¡Ê£±Æü£³£·£°±ß¡Ë
                    IF  LNK-NYULIFE2-FTNKBN2(IDX1)   =   SPACE
                        MOVE  "197001910"       TO
                                        LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  370       TO
                                        LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
      *             °åÎÅ¶èÊ¬£²¡¢£³¡Ê£±Æü£²£°£°±ß¡Ë
                    IF  LNK-NYULIFE2-FTNKBN2(IDX1)   =  "1"
                        MOVE  "197003810"       TO
                                        LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  200       TO
                                        LNK-NYULIFE2-KANFTN-MONEY(IDX1)
      *                 Ê¿À®£³£°Ç¯²þÀµ¡¡°åÎÅ¶èÊ¬£²¡¢£³¡Ê£±Æü£³£·£°±ß¡Ë
                        IF   LNK-NYULIFE2-SANTEIYM >=  "201804"
                             MOVE  370       TO
                                        LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                        END-IF
                    END-IF
      *             ¶­³¦ÁØ´µ¼Ô¤Ï´Ä¶­ÎÅÍÜ´µ¼ÔÉéÃ´Ìµ¤·¤ËÃÖ´¹¤¨
                    IF  LNK-SYOTOKU-KKSKBN(IDX1)   =   "1"
                        MOVE  SPACE  TO  LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  ZERO   TO  LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
      *             Ï·ÎðÊ¡»ãÇ¯¶â¼õµë¼Ô¤Ï´Ä¶­ÎÅÍÜ´µ¼ÔÉéÃ´Ìµ¤·¤ËÃÖ´¹¤¨
                    IF  LNK-NYULIFE2-FTNKBN1(IDX1)   =   "4"
                        MOVE  SPACE  TO  LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  ZERO   TO  LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
      *             »ØÄêÆñÉÂ¤Ç°åÎÅ¶èÊ¬£²¡¢£³¤Ï´µ¼ÔÉéÃ´Ìµ¤·¤ËÃÖ´¹¤¨
                    IF (LNK-NYULIFE2-FTNKBN2(IDX1)   =  "1")   AND
                       (LNK-SKJKEEP-KBN(IDX1)        =  "1")
                        MOVE  SPACE  TO  LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
                        MOVE  ZERO   TO  LNK-NYULIFE2-KANFTN-MONEY(IDX1)
                    END-IF
                END-IF
               END-PERFORM
             END-IF
      *
      *¡Ý¡Ý¡Ý¡Ý¿©»öÉéÃ´¡¢´Ä¶­ÎÅÍÜÉéÃ´¥³¡¼¥É¡¢Ã±²ÁÀßÄê¤³¤³¤Þ¤Ç¡Ý¡Ý¡Ý
      *
           END-IF
      *
           IF   FLG-OK   =   ZERO
               MOVE   4      TO   LNK-NYULIFE2-RC
           END-IF
      *
      *     PERFORM   VARYING  IDX1   FROM  1   BY  1
      *               UNTIL  IDX1   >   31
      *          DISPLAY "IDX1 = " IDX1
      *          DISPLAY "LNK-SKJKEEP-KBN(IDX1) = "
      *                   LNK-SKJKEEP-KBN(IDX1)
      *          DISPLAY "LNK-NYULIFE2-KBN(IDX1) = " 
      *                   LNK-NYULIFE2-KBN(IDX1)
      *          DISPLAY "LNK-NYULIFE2-FTNKBN1(IDX1) = " 
      *                   LNK-NYULIFE2-FTNKBN1(IDX1)
      *          DISPLAY "LNK-NYULIFE2-FTNKBN2(IDX1) = " 
      *                   LNK-NYULIFE2-FTNKBN2(IDX1)
      *          DISPLAY  "LNK-NYULIFE2-SKJ-SRYCD(IDX1) = "
      *                    LNK-NYULIFE2-SKJ-SRYCD(IDX1)
      *          DISPLAY "LNK-NYULIFE2-SKJ-MONEY(IDX1) = "
      *                   LNK-NYULIFE2-SKJ-MONEY(IDX1)
      *          DISPLAY  "LNK-NYULIFE2-SKJFTN-SRYCD(IDX1) = "
      *                    LNK-NYULIFE2-SKJFTN-SRYCD(IDX1)
      *          DISPLAY "LNK-NYULIFE2-SKJFTN-MONEY(IDX1) = "
      *                   LNK-NYULIFE2-SKJFTN-MONEY(IDX1)
      *          DISPLAY  "LNK-NYULIFE2-KAN-SRYCD(IDX1) = "
      *                    LNK-NYULIFE2-KAN-SRYCD(IDX1)
      *          DISPLAY "LNK-NYULIFE2-KAN-MONEY(IDX1) = "
      *                   LNK-NYULIFE2-KAN-MONEY(IDX1)
      *          DISPLAY  "LNK-NYULIFE2-KANFTN-SRYCD(IDX1) = "
      *                    LNK-NYULIFE2-KANFTN-SRYCD(IDX1)
      *          DISPLAY "LNK-NYULIFE2-KANFTN-MONEY(IDX1) = "
      *                   LNK-NYULIFE2-KANFTN-MONEY(IDX1)
      *     END-PERFORM
           .
       200-MAIN-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¼èÆÀ
      *****************************************************************
       210-NYUINACT-GET-SEC            SECTION.
      *
           INITIALIZE                      NYUINACT-REC
           MOVE    NACCT-HOSPNUM       TO  NSRY-HOSPNUM
           MOVE    NACCT-NYUGAIKBN     TO  NSRY-NYUGAIKBN
           MOVE    NACCT-PTID          TO  NSRY-PTID
           MOVE    NACCT-SRYYM         TO  NSRY-SRYYM
           MOVE    NACCT-ZAINUM        TO  NSRY-ZAINUM
           MOVE    "tbl_nyuinact"      TO  MCP-TABLE
           MOVE    "key9"              TO  MCP-PATHNAME
           PERFORM 910-NYUINACT-SELECT-SEC
           IF      FLG-NYUINACT        =   ZERO
               MOVE    "tbl_nyuinact"  TO  MCP-TABLE
               MOVE    "key9"          TO  MCP-PATHNAME
               PERFORM   910-NYUINACT-READ-SEC
           END-IF
      *
      *    Æþ±¡¹Ô°Ù¥¯¥í¡¼¥º
           MOVE     "tbl_nyuinact"     TO  MCP-TABLE
           MOVE     "key9"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       210-NYUINACT-GET-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¥·¥¹¥Æ¥à´ÉÍý¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-SYSKANRI-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  SYS-5000-REC
               MOVE    ZERO                TO  FLG-SYSKANRI
           ELSE
               INITIALIZE                      SYS-5000-REC
               MOVE    1                   TO  FLG-SYSKANRI
           END-IF
      *
           .
       910-SYSKANRI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼Ô¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       900-PTINF-READ-SEC         SECTION.
      *
           MOVE    PTINF-REC           TO  MCPDATA-REC
           MOVE    "tbl_ptinf"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_ptinf"         TO  MCP-TABLE
               MOVE    "key"               TO  MCP-PATHNAME
               PERFORM   900-DBFETCH-SEC
               IF      MCP-RC          =   ZERO
                   MOVE    MCPDATA-REC TO  PTINF-REC
                   MOVE    ZERO        TO  FLG-PTINF
               ELSE
                   INITIALIZE              PTINF-REC
                   MOVE    1           TO  FLG-PTINF
               END-IF
           ELSE
               INITIALIZE                  PTINF-REC
               MOVE    1               TO  FLG-PTINF
           END-IF
      *
           MOVE    "tbl_ptinf"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       900-PTINF-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÊÝ¸±ÁÈ¹ç¤»¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-HKNCOMBI-SELECT-SEC        SECTION.
      *
           MOVE    HKNCOMBI-REC        TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-HKNCOMBI
           ELSE
               MOVE    1                  TO  FLG-HKNCOMBI
           END-IF
      *
           .
       910-HKNCOMBI-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÊÝ¸±ÁÈ¹ç¤»¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-HKNCOMBI-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  HKNCOMBI-REC
               MOVE    ZERO                TO  FLG-HKNCOMBI
           ELSE
               INITIALIZE                      HKNCOMBI-REC
               MOVE    1                   TO  FLG-HKNCOMBI
           END-IF
      *
           .
       910-HKNCOMBI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼ÔÊÝ¸±¾ðÊó¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-PTHKNINF-SELECT-SEC        SECTION.
      *
           MOVE    PTHKNINF-REC        TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-PTHKNINF
           ELSE
               MOVE    1                  TO  FLG-PTHKNINF
           END-IF
      *
           .
       910-PTHKNINF-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼ÔÊÝ¸±¾ðÊó¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-PTHKNINF-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC        TO  PTHKNINF-REC
               MOVE    ZERO               TO  FLG-PTHKNINF
           ELSE
               INITIALIZE                     PTHKNINF-REC
               MOVE    1                  TO  FLG-PTHKNINF
           END-IF
      *
           .
       910-PTHKNINF-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼Ô¸øÈñ¾ðÊó¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-PTKOHINF-SELECT-SEC        SECTION.
      *
           MOVE    PTKOHINF-REC        TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-PTKOHINF
           ELSE
               MOVE    1                  TO  FLG-PTKOHINF
           END-IF
      *
           .
       910-PTKOHINF-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼Ô¸øÈñ¾ðÊó¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-PTKOHINF-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC        TO  PTKOHINF-REC
               MOVE    ZERO               TO  FLG-PTKOHINF
           ELSE
               INITIALIZE                     PTKOHINF-REC
               MOVE    1                  TO  FLG-PTKOHINF
           END-IF
      *
           .
       910-PTKOHINF-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡²ñ·×¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-NYUINACCT-SELECT-SEC        SECTION.
      *
           MOVE    NYUINACCT-REC       TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-NYUINACCT
           ELSE
               MOVE    1                  TO  FLG-NYUINACCT
           END-IF
      *
           .
       910-NYUINACCT-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡²ñ·×¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-NYUINACCT-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC        TO  NYUINACCT-REC
               MOVE    ZERO               TO  FLG-NYUINACCT
               IF      WRK-KYUKYU-DAY     NOT =   ZERO
                   IF   WRK-KYUKYU-NYUINCD   = NACCT-SRYCDTOTAL(6:9)
                        MOVE   1          TO  NACCT-DAY(WRK-KYUKYU-DAY)  
                   END-IF
               END-IF
           ELSE
               INITIALIZE                     NYUINACCT-REC
               MOVE    1                  TO  FLG-NYUINACCT
           END-IF
      *
           .
       910-NYUINACCT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-NYUINACT-SELECT-SEC        SECTION.
      *
           MOVE    NYUINACT-REC        TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-NYUINACT
           ELSE
               MOVE    1                  TO  FLG-NYUINACT
           END-IF
      *
           .
       910-NYUINACT-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-NYUINACT-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  NYUINACT-REC
               MOVE    ZERO                TO  FLG-NYUINACT
           ELSE
               INITIALIZE                      NYUINACT-REC
               MOVE    1                   TO  FLG-NYUINACT
           END-IF
      *
           .
       910-NYUINACT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼ÔÆþ±¡ÍúÎò¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-PTNYUINRRK-SELECT-SEC        SECTION.
      *
           MOVE    PTNYUINRRK-REC      TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-PTNYUINRRK
           ELSE
               MOVE    1                  TO  FLG-PTNYUINRRK
           END-IF
      *
           .
       910-PTNYUINRRK-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼ÔÆþ±¡ÍúÎò¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-PTNYUINRRK-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC        TO  PTNYUINRRK-REC
               MOVE    ZERO               TO  FLG-PTNYUINRRK
           ELSE
               INITIALIZE                     PTNYUINRRK-REC
               MOVE    1                  TO  FLG-PTNYUINRRK
           END-IF
      *
           .
       910-PTNYUINRRK-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    £Ä£Â£Ó£Å£Ì£Å£Ã£Ô½èÍý
      *****************************************************************
       900-DBSELECT-SEC                SECTION.
      *
           MOVE    "DBSELECT"          TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
           .
       900-DBSELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    £Ä£Â£Æ£Å£Ô£Ã£È½èÍý
      *****************************************************************
       900-DBFETCH-SEC                SECTION.
      *
           MOVE    "DBFETCH"           TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-DBFETCH-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¥Æ¡¼¥Ö¥ë¥¢¥¯¥»¥¹½èÍý
      *****************************************************************
       900-ORCDBMAIN-SEC               SECTION.
      *
           CALL    "ORCDBMAIN"         USING   MCPAREA
                                               MCPDATA-REC
                                               SPA-AREA
           .
      *
       910-ORCDBMAIN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¥Æ¡¼¥Ö¥ë¥¯¥í¡¼¥º½èÍý
      *****************************************************************
       900-CLOSE-SEC                 SECTION.
      *
           MOVE    "DBCLOSECURSOR"      TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
      *
       900-CLOSE-SEC-EXT.
           EXIT.
