        02  J043.
            03  K02N-POPUP-STATUS.
              04  J043-POPUP-SUMMARY  PIC X(256).
              04  J043-POPUP-BODY PIC X(256).
              04  J043-POPUP-ICON PIC X(256).
              04  J043-POPUP-TIMEOUT  PIC S9(9)   BINARY.
      **    02  J043-FIXED10.
              03  J043-B01.
                04  J043-STATE  PIC S9(9)   BINARY.
              03  J043-B12.
                04  J043-STATE  PIC S9(9)   BINARY.
              03  J043-B06.
                04  J043-STATE  PIC S9(9)   BINARY.
              03  J043-B07.
                04  J043-STATE  PIC S9(9)   BINARY.
              03  J043-MIDASHI1.
                04  J043-TEXTDATA   PIC X(100).
              03  J043-SRYCD.
                04  J043-TEXTDATA   PIC X(9).
              03  J043-MIDASHI2.
                04  J043-TEXTDATA   PIC X(30).
              03  J043-SCROLLEDWINDOW2.
                04  J043-FORMALNAME.
                  05  J043-TEXTDATA   PIC X(400).
              03  J043-INPUTSTRING.
                04  J043-TEXTDATA   PIC X(100).
              03  J043-NAMELABEL.
                04  J043-TEXTDATA   PIC X(30).
              03  J043-MIDASHI3-G.
                04  J043-MIDASHI3-STYLE PIC X(20).
                04  J043-MIDASHI3   PIC X(30).
              03  J043-MIDASHI4-G.
                04  J043-MIDASHI4-STYLE PIC X(20).
                04  J043-MIDASHI4   PIC X(30).
