        02  KT014.
            03  K02N-POPUP-STATUS.
              04  KT014-POPUP-SUMMARY PIC X(256).
              04  KT014-POPUP-BODY    PIC X(256).
              04  KT014-POPUP-ICON    PIC X(256).
              04  KT014-POPUP-TIMEOUT PIC S9(9)   BINARY.
      ***** 02  KT014-FIXED10.
              03  KT014-B01.
                04  KT014-STATE PIC S9(9)   BINARY.
              03  KT014-B12.
                04  KT014-STATE PIC S9(9)   BINARY.
              03  KT014-B06.
                04  KT014-STATE PIC S9(9)   BINARY.
              03  KT014-B07.
                04  KT014-STATE PIC S9(9)   BINARY.
              03  KT014-MIDASHI1.
                04  KT014-TEXTDATA  PIC X(100).
              03  KT014-SRYCD.
                04  KT014-TEXTDATA  PIC X(9).
              03  KT014-SCROLLEDWINDOW2.
                04  KT014-FORMALNAME.
                  05  KT014-TEXTDATA  PIC X(400).
              03  KT014-INPUTSTRING.
                04  KT014-TEXTDATA  PIC X(100).
              03  KT014-MIDASHI2.
                04  KT014-TEXTDATA  PIC X(50).
              03  KT014-NAMELABEL.
                04  KT014-TEXTDATA  PIC X(30).
              03  KT014-MIDASHI3-G.
                04  KT014-MIDASHI3-STYLE PIC X(20).
                04  KT014-MIDASHI3  PIC X(30).
              03  KT014-MIDASHI4-G.
                04  KT014-MIDASHI4-STYLE PIC X(20).
                04  KT014-MIDASHI4  PIC X(30).
