        02  P035.
            03  P035-TITLE  PIC X(256).
            03  P035-POPUP-SUMMARY  PIC X(256).
            03  P035-POPUP-BODY PIC X(256).
            03  P035-POPUP-ICON PIC X(256).
            03  P035-POPUP-TIMEOUT  PIC S9(9)   BINARY.
      ****  02  P035-FIXED1.
              03  P035-B01.
                04  P035-STATE  PIC S9(9)   BINARY.
              03  P035-HKNJANUM.
                04  P035-TEXTDATA   PIC X(8).
              03  P035-BIRTHDAY.
                04  P035-TEXTDATA   PIC X(10).
              03  P035-NENREI.
                04  P035-TEXTDATA   PIC X(10).
              03  P035-B12.
                04  P035-STATE  PIC S9(9)   BINARY.
              03  P035-B02.
                04  P035-STATE  PIC S9(9)   BINARY.
              03  P035-HKNJANAME.
                04  P035-TEXTDATA   PIC X(50).
              03  P035-KIGO.
                04  P035-TEXTDATA   PIC X(100).
              03  P035-NUM.
                04  P035-TEXTDATA   PIC X(100).
              03  P035-EDABAN.
                04  P035-TEXTDATA   PIC X(2).
              03  P035-MIDASHI.
                04  P035-TEXTDATA   PIC X(50).
              03  P035-IMGAREA.
                04  P035-OBJECTDATA PIC X(36).
              03  P035-PTNUM.
                04  P035-TEXTDATA   PIC X(20).
              03  P035-KANANAME.
                04  P035-TEXTDATA   PIC X(100).
              03  P035-NAME.
                04  P035-TEXTDATA   PIC X(100).
              03  P035-B04.
                04  P035-STATE  PIC S9(9)   BINARY.
              03  P035-SEX.
                04  P035-TEXTDATA   PIC X(4).
              03  P035-YUKO-MSG-G.
                04  P035-YUKO-MSG-STYLE  PIC X(20).
                04  P035-YUKO-MSG        PIC X(50).
              03  P035-CHUIMSG1-G.
                04  P035-CHUIMSG1-STYLE  PIC X(20).
                04  P035-CHUIMSG1        PIC X(100).
              03  P035-CHUIMSG2-G.
                04  P035-CHUIMSG2-STYLE  PIC X(20).
                04  P035-CHUIMSG2       PIC X(100).
