      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *----------------------------------------------------------------*
      *    在宅の処方せん切替えコードテーブル
      *                        令和６年６月改正から                    *
      *                         COPY (CMZISOTBL2024.INC)               *
      *----------------------------------------------------------------*
      *****************************************************************
      *  コピー句修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      *****************************************************************
      *
       01  TBL-ZISOSIN24-AREA.
      *在宅がん医総合
      *    （在支診等）（処方せんあり）
           03  FILLER              PIC X(14)   VALUE   "2110 114007610".
      *    （在支診等）（処方せんなし）
           03  FILLER              PIC X(14)   VALUE   "2120 114007710".
      *
      *    （機能強化した在支診等）（病床あり）（処方せんあり）
           03  FILLER              PIC X(14)   VALUE   "2210 114019510".
      *    （機能強化した在支診等）（病床あり）（処方せんなし）
           03  FILLER              PIC X(14)   VALUE   "2220 114019610".
      *
      *    （機能強化した在支診等）（病床なし）（処方せんあり）
           03  FILLER              PIC X(14)   VALUE   "2310 114019710".
      *    （機能強化した在支診等）（病床なし）（処方せんなし）
           03  FILLER              PIC X(14)   VALUE   "2320 114019810".
      *
      *在医総管
      *    （機能強化在支診等・床有・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "01 1 114030710".
      *    （機能強化在支診等・床有・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "01 2 114030810".
      *    （機能強化在支診等・床有・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "01 3 114706710".
      *    （機能強化在支診等・床有・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "01 4 114706810".
      *    （機能強化在支診等・病床有・難病等月２回以上・１０人~）
           03  FILLER              PIC X(14)   VALUE   "01 5 114706910".
      *
      *    （機能強化在支診等・床有・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "01 1 114031010".
      *    （機能強化在支診等・床有・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "01 2 114031110".
      *    （機能強化在支診等・床有・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "01 3 114707210".
      *    （機能強化在支診等・床有・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "01 4 114707310".
      *    （機能強化在支診等・床有・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "01 5 114707410".
      *
      *    （機能強化在支診等・床有・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "01 1 114031310".
      *    （機能強化在支診等・床有・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "01 2 114031410".
      *    （機能強化在支診等・床有・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "01 3 114708210".
      *    （機能強化在支診等・床有・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "01 4 114708310".
      *    （機能強化在支診等・床有・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "01 5 114708410".
      *****
      *    （機能強化在支診等・床無・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "02 1 114031610".
      *    （機能強化在支診等・床無・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "02 2 114031710".
      *    （機能強化在支診等・床無・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "02 3 114709010".
      *    （機能強化在支診等・床無・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "02 4 114709110".
      *    （機能強化在支診等・床無・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "02 5 114709210".
      *
      *    （機能強化在支診等・床無・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "02 1 114031910".
      *    （機能強化在支診等・床無・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "02 2 114032010".
      *    （機能強化在支診等・床無・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "02 3 114709510".
      *    （機能強化在支診等・床無・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "02 4 114709610".
      *    （機能強化在支診等・床無・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "02 5 114709710".
      *
      *    （機能強化在支診等・床無・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "02 1 114032210".
      *    （機能強化在支診等・床無・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "02 2 114032310".
      *    （機能強化在支診等・床無・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "02 3 114710510".
      *    （機能強化在支診等・床無・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "02 4 114710610".
      *    （機能強化在支診等・床無・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "02 5 114710710".
      *****
      *    （在支診等・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "03 1 114032510".
      *    （在支診等・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "03 2 114032610".
      *    （在支診等・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "03 3 114711310".
      *    （在支診等・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "03 4 114711410".
      *    （在支診等・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "03 5 114711510".
      *
      *    （在支診等・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "03 1 114032810".
      *    （在支診等・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "03 2 114032910".
      *    （在支診等・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "03 3 114711810".
      *    （在支診等・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "03 4 114711910".
      *    （在支診等・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "03 5 114712010".
      *
      *    （在支診等・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "03 1 114033110".
      *    （在支診等・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "03 2 114033210".
      *    （在支診等・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "03 3 114712810".
      *    （在支診等・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "03 4 114712910".
      *    （在支診等・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "03 5 114713010".
      *****
      *    （在支診等以外・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "04 1 114033410".
      *    （在支診等以外・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "04 2 114033510".
      *    （在支診等以外・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "04 3 114713610".
      *    （在支診等以外・難病等月２回~２０~４９人））
           03  FILLER              PIC X(14)   VALUE   "04 4 114713710".
      *    （在支診等以外・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "04 5 114713810".
      *
      *    （在支診等以外・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "04 1 114033710".
      *    （在支診等以外・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "04 2 114033810".
      *    （在支診等以外・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "04 3 114714110".
      *    （在支診等以外・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "04 4 114714210".
      *    （在支診等以外・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "04 5 114714310".
      *
      *    （在支診等以外・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "04 1 114034010".
      *    （在支診等以外・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "04 2 114034110".
      *    （在支診等以外・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "04 3 114715110".
      *    （在支診等以外・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "04 4 114715210".
      *    （在支診等以外・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "04 5 114715310".
      *
      *施医総管
      *    （機能強化在支診等・床有・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "11 1 114035510".
      *    （機能強化在支診等・床有・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "11 2 114035610".
      *    （機能強化在支診等・床有・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "11 3 114723910".
      *    （機能強化在支診等・床有・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "11 4 114724010".
      *    （機能強化在支診等・床有・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "11 5 114724110".
      *
      *    （機能強化在支診等・床有・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "11 1 114035810".
      *    （機能強化在支診等・床有・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "11 2 114035910".
      *    （機能強化在支診等・床有・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "11 3 114724410".
      *    （機能強化在支診等・床有・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "11 4 114724510".
      *    （機能強化在支診等・床有・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "11 5 114724610".
      *
      *    （機能強化在支診等・床有・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "11 1 114036110".
      *    （機能強化在支診等・床有・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "11 2 114036210".
      *    （機能強化在支診等・床有・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "11 3 114725410".
      *    （機能強化在支診等・床有・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "11 4 114725510".
      *    （機能強化在支診等・床有・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "11 5 114725610".
      *****
      *    （機能強化在支診等・床無・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "12 1 114036410".
      *    （機能強化在支診等・床無・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "12 2 114036510".
      *    （機能強化在支診等・床無・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "12 3 114726210".
      *    （機能強化在支診等・床無・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "12 4 114726310".
      *    （機能強化在支診等・床無・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "12 5 114726410".
      *
      *    （機能強化在支診等・床無・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "12 1 114036710".
      *    （機能強化在支診等・床無・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "12 2 114036810".
      *    （機能強化在支診等・床無・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "12 3 114726710".
      *   （機能強化在支診等・床無・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "12 4 114726810".
      *    （機能強化在支診等・床無・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "12 5 114726910".
      *
      *    （機能強化在支診等・床無・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "12 1 114037010".
      *    （機能強化在支診等・床無・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "12 2 114037110".
      *    （機能強化在支診等・床無・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "12 3 114727710".
      *    （機能強化在支診等・床無・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "12 4 114727810".
      *    （機能強化在支診等・床無・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "12 5 114727910".
      *****
      *    （在支診等・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "13 1 114037310".
      *    （在支診等・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "13 2 114037410".
      *    （在支診等・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "13 3 114728510".
      *    （在支診等・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "13 4 114728610".
      *    （在支診等・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "13 5 114728710".
      *
      *施医総管
      *    （在支診等・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "13 1 114037610".
      *    （在支診等・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "13 2 114037710".
      *    （在支診等・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "13 3 114729010".
      *    （在支診等・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "13 4 114729110".
      *    （在支診等・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "13 5 114729210".
      *
      *    施医総管（在支診等・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "13 1 114037910".
      *    （在支診等・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "13 2 114038010".
      *    （在支診等・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "13 3 114730010".
      *    （在支診等・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "13 4 114730110".
      *    （在支診等・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "13 5 114730210".
      *****
      *    施医総管（在支診等以外・難病等月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "14 1 114038210".
      *    （在支診等以外・難病等月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "14 2 114038310".
      *    （在支診等以外・難病等月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "14 3 114730810".
      *    （在支診等以外・難病等月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "14 4 114730910".
      *    （在支診等以外・難病等月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "14 5 114731010".
      *
      *    施医総管（在支診等以外・月２回~１人）
           03  FILLER              PIC X(14)   VALUE   "14 1 114038510".
      *    （在支診等以外・月２回~２~９人）
           03  FILLER              PIC X(14)   VALUE   "14 2 114038610".
      *    （在支診等以外・月２回~１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "14 3 114731310".
      *    （在支診等以外・月２回~２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "14 4 114731410".
      *    （在支診等以外・月２回~５０人~）
           03  FILLER              PIC X(14)   VALUE   "14 5 114731510".
      *
      *    施医総管（在支診等以外・月１回・１人）
           03  FILLER              PIC X(14)   VALUE   "14 1 114038810".
      *    （在支診等以外・月１回・２~９人）
           03  FILLER              PIC X(14)   VALUE   "14 2 114038910".
      *    （在支診等以外・月１回・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "14 3 114732310".
      *    （在支診等以外・月１回・２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "14 4 114732410".
      *    （在支診等以外・月１回・５０人~）
           03  FILLER              PIC X(14)   VALUE   "14 5 114732510".
      *
      *2022/04 から通信機
      *在医総管
      *   （機能強化在支診等・床有・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "06 1 114055310".
      *   （機能強化在支診等・床有・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "06 2 114055410".
      *    （機能強化在支診等・床有・月２回~通信機・１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "06 3 114707710".
      *    （機能強化在支診等・床有・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "06 4 114707810".
      *    （機能強化在支診等・床有・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "06 5 114707910".
      *
      *  在医総管（機能強化在支診等・床有・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "06 1 114055610".
      *   （機能強化在支診等・床有・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "06 2 114055710".
      *   （機能強化在支診等・床有・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "06 3 114708710".
      *   （機能強化在支診等・床有・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "06 4 114708810".
      *   （機能強化在支診等・床有・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "06 5 114708910".
      ****
      *在医総管（機能強化在支診等・床無・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "07 1 114055910".
      *    （機能強化在支診等・床無・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "07 2 114056010".
      *    （機能強化在支診等・床無・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "07 3 114710010".
      *    （機能強化在支診等・床無・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "07 4 114710110".
      *    （機能強化在支診等・床無・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "07 5 114710210".
      *
      * 在医総管（機能強化在支診等・床無・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "07 1 114056210".
      *    （機能強化在支診等・床無・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "07 2 114056310".
      *    （機能強化在支診等・床無・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "07 3 114711010".
      *    （機能強化在支診等・床無・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "07 4 114711110".
      *    （機能強化在支診等・床無・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "07 5 114711210".
      *****
      *在医総管（在支診等・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "08 1 114056510".
      *   （在支診等・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "08 2 114056610".
      *   （在支診等・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "08 3 114712310".
      *   （在支診等・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "08 4 114712410".
      *   （在支診等・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "08 5 114712510".
      *
      *  在医総管（在支診等・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "08 1 114056810".
      *    （在支診等・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "08 2 114056910".
      *    （在支診等・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "08 3 114713310".
      *    （在支診等・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "08 4 114713410".
      *    （在支診等・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "08 5 114713510".
      *
      * 在医総管（在支診等以外・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "09 1 114057110".
      *    （在支診等以外・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "09 2 114057210".
      *    （在支診等以外・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "09 3 114714610".
      *    （在支診等以外・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "09 4 114714710".
      *    （在支診等以外・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "09 5 114714810".
      *
      * 在医総管（在支診等以外・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "09 1 114057410".
      *    （在支診等以外・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "09 2 114057510".
      *    （在支診等以外・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "09 3 114715610".
      *    （在支診等以外・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "09 4 114715710".
      *    （在支診等以外・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "09 5 114715810".
      *
      *施医総管
      *   施医総管（機能強化在支診等・床有・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "16 1 114058010".
      *   （機能強化在支診等・床有・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "16 2 114058110".
      *   （機能強化在支診等・床有・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "16 3 114724910".
      *   （機能強化在支診等・床有・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "16 4 114725010".
      *   （機能強化在支診等・床有・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "16 5 114725110".
      *
      *施医総管（機能強化在支診等・床有・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "16 1 114058310".
      *   （機能強化在支診等・床有・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "16 2 114058410".
      *   （機能強化在支診等・床有・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "16 3 114725910".
      *   （機能強化在支診等・床有・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "16 4 114726010".
      *   （機能強化在支診等・床有・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "16 5 114726110".
      *
      *施医総管（機能強化在支診等・床無・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "17 1 114058610".
      *   （機能強化在支診等・床無・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "17 2 114058710".
      *   （機能強化在支診等・床無・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "17 3 114727210".
      *   （機能強化在支診等・床無・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "17 4 114727310".
      *   （機能強化在支診等・床無・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "17 5 114727410".
      *
      *施医総管（機能強化在支診等・床無・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "17 1 114058910".
      *   （機能強化在支診等・床無・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "17 2 114059010".
      *   （機能強化在支診等・床無・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "17 3 114728210".
      *   （機能強化在支診等・床無・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "17 4 114728310".
      *   （機能強化在支診等・床無・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "17 5 114728410".
      *
      * 施医総管（在支診等・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "18 1 114059210".
      *   （在支診等・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "18 2 114059310".
      *   （在支診等・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "18 3 114729510".
      *   （在支診等・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "18 4 114729610".
      *   （在支診等・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "18 5 114729710".
      *
      *施医総管（在支診等・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "18 1 114059510".
      *   （在支診等・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "18 2 114059610".
      *   （在支診等・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "18 3 114730510".
      *   （在支診等・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "18 4 114730610".
      *   （在支診等・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "18 5 114730710".
      *
      *施医総管（在支診等以外・月２回~通信機１人）
           03  FILLER              PIC X(14)   VALUE   "19 1 114059810".
      *   （在支診等以外・月２回~通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "19 2 114059910".
      *   （在支診等以外・月２回~通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "19 3 114731810".
      *   （在支診等以外・月２回~通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "19 4 114731910".
      *   （在支診等以外・月２回~通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "19 5 114732010".
      *
      * 施医総管（在支診等以外・月１回・通信機１人）
           03  FILLER              PIC X(14)   VALUE   "19 1 114060110".
      *   （在支診等以外・月１回・通信機２~９人）
           03  FILLER              PIC X(14)   VALUE   "19 2 114060210".
      *   （在支診等以外・月１回・通信機１０~１９人）
           03  FILLER              PIC X(14)   VALUE   "19 3 114732810".
      *   （在支診等以外・月１回・通信機２０~４９人）
           03  FILLER              PIC X(14)   VALUE   "19 4 114732910".
      *   （在支診等以外・月１回・通信機５０人~）
           03  FILLER              PIC X(14)   VALUE   "19 5 114733010".
      *
      *
      *（減）
      *在医総管（機能強化在支診等・床有・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "01 3G114717810".
      *    （機能強化在支診等・床有・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "01 4G114717910".
      *    （機能強化在支診等・床有・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "01 5G114718010".
      *
      *在医総管
      *    （機能強化在支診等・床有・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "01 3G114718110".
      *    （機能強化在支診等・床有・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "01 4G114718210".
      *    （機能強化在支診等・床有・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "01 5G114718310".
      *
      *在医総管
      *    （機能強化在支診等・床有・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "01 3G114718710".
      *    （機能強化在支診等・床有・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "01 4G114718810".
      *    （機能強化在支診等・床有・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "01 5G114718910".
      *****
      *在医総管
      *    （機能強化在支診等・床無・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "02 3G114719310".
      *    （機能強化在支診等・床無・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "02 4G114719410".
      *    （機能強化在支診等・床無・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "02 5G114719510".
      *
      *在医総管
      *    （機能強化在支診等・床無・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "02 3G114719610".
      *    （機能強化在支診等・床無・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "02 4G114719710".
      *    （機能強化在支診等・床無・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "02 5G114709810".
      *
      *在医総管
      *    （機能強化在支診等・床無・月１回１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "02 3G114720210".
      *    （機能強化在支診等・床無・月１回２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "02 4G114720310".
      *    （機能強化在支診等・床無・月１回５０人~減）
           03  FILLER              PIC X(14)   VALUE   "02 5G114720410".
      *
      *在医総管
      *    （在支診等・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "03 3G114720810".
      *    （在支診等・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "03 4G114720910".
      *    （在支診等・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "03 5G114721010".
      *在医総管
      *    （在支診等・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "03 3G114721110".
      *    （在支診等・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "03 4G114721210".
      *    （在支診等・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "03 5G114721310".
      *
      *在医総管
      *    （在支診等・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "03 3G114721710".
      *    （在支診等・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "03 4G114721810".
      *    （在支診等・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "03 5G114721910".
      *
      *在医総管
      *    （在支診等以外・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "04 3G114722310".
      *    （在支診等以外・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "04 4G114722410".
      *    （在支診等以外・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "04 5G114722510".
      *
      *在医総管
      *    （在支診等以外・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "04 3G114722610".
      *    （在支診等以外・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "04 4G114722710".
      *    （在支診等以外・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "04 5G114722810".
      *
      *在医総管
      *    （在支診等以外・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "04 3G114723210".
      *    （在支診等以外・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "04 4G114723310".
      *    （在支診等以外・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "04 5G114723410".
      *
      *在医総管
      *    （機能強化在支診等・床有・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "06 3G114718410".
      *    （機能強化在支診等・床有・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "06 4G114718510".
      *    （機能強化在支診等・床有・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "06 5G114718610".
      *
      *在医総管
      *   （機能強化在支診等・床有・月１回通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "06 3G114719010".
      *   （機能強化在支診等・床有・月１回通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "06 4G114719110".
      *   （機能強化在支診等・床有・月１回通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "06 5G114719210".
      ****
      *在医総管
      *    （機能強化在支診等・床無・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "07 3G114719910".
      *    （機能強化在支診等・床無・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "07 4G114720010".
      *    （機能強化在支診等・床無・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "07 5G114720110".
      *
      *在医総管
      *    （機能強化在支診等・床無・月１回通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "07 3G114720510".
      *    （機能強化在支診等・床無・月１回通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "07 4G114720610".
      *    （機能強化在支診等・床無・月１回通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "07 5G114720710".
      *****
      *在医総管
      *   （在支診等・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "08 3G114721410".
      *   （在支診等・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "08 4G114721510".
      *   （在支診等・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "08 5G114721610".
      *
      *在医総管
      *    （在支診等・月１回・通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "08 3G114722010".
      *    （在支診等・月１回・通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "08 4G114722110".
      *    （在支診等・月１回・通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "08 5G114722210".
      *
      *在医総管
      *    （在支診等以外・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "09 3G114722910".
      *    （在支診等以外・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "09 4G114723010".
      *    （在支診等以外・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "09 5G114723110".
      *
      *在医総管
      *    （在支診等以外・月１回・通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "09 3G114723510".
      *    （在支診等以外・月１回・通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "09 4G114723610".
      *    （在支診等以外・月１回・通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "09 5G114723710".
      ****
      *施医総管
      *    （機能強化在支診等・床有・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "11 3G114734410".
      *    （機能強化在支診等・床有・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "11 4G114734510".
      *    （機能強化在支診等・床有・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "11 5G114734610".
      *
      *施医総管
      *    （機能強化在支診等・床有・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "11 3G114734710".
      *    （機能強化在支診等・床有・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "11 4G114734810".
      *    （機能強化在支診等・床有・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "11 5G114734910".
      *
      *施医総管
      *    （機能強化在支診等・床有・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "11 3G114735310".
      *    （機能強化在支診等・床有・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "11 4G114735410".
      *    （機能強化在支診等・床有・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "11 5G114735510".
      *施医総管
      *    （機能強化在支診等・床無・難病等月２回~１０~１９人減
           03  FILLER              PIC X(14)   VALUE   "12 3G114735910".
      *    （機能強化在支診等・床無・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "12 4G114736010".
      *    （機能強化在支診等・床無・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "12 5G114736110".
      *
      *施医総管
      *    （機能強化在支診等・床無・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "12 3G114736210".
      *   （機能強化在支診等・床無・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "12 4G114736310".
      *    （機能強化在支診等・床無・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "12 5G114736410".
      *
      *施医総管
      *    （機能強化在支診等・床無・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "12 3G114736810".
      *    （機能強化在支診等・床無・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "12 4G114736910".
      *    （機能強化在支診等・床無・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "12 5G114737010".
      *****
      *施医総管
      *    （在支診等・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "13 3G114737410".
      *    （在支診等・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "13 4G114737510".
      *    （在支診等・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "13 5G114737610".
      *
      *施医総管
      *    （在支診等・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "13 3G114737710".
      *    （在支診等・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "13 4G114737810".
      *    （在支診等・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "13 5G114737910".
      *
      *施医総管
      *    （在支診等・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "13 3G114738310".
      *    （在支診等・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "13 4G114738410".
      *    （在支診等・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "13 5G114738510".
      *****
      *施医総管
      *    （在支診等以外・難病等月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "14 3G114738910".
      *    （在支診等以外・難病等月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "14 4G114739010".
      *    （在支診等以外・難病等月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "14 5G114739110".
      *
      *施医総管
      *    （在支診等以外・月２回~１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "14 3G114739210".
      *    （在支診等以外・月２回~２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "14 4G114739310".
      *    （在支診等以外・月２回~５０人~減）
           03  FILLER              PIC X(14)   VALUE   "14 5G114739410".
      *
      *施医総管
      *    （在支診等以外・月１回・１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "14 3G114739810".
      *    （在支診等以外・月１回・２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "14 4G114739910".
      *    （在支診等以外・月１回・５０人~減）
           03  FILLER              PIC X(14)   VALUE   "14 5G114740010".
      *
      *施医総管
      *   （機能強化在支診等・床有・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "16 3G114735010".
      *   （機能強化在支診等・床有・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "16 4G114735110".
      *   （機能強化在支診等・床有・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "16 5G114735210".
      *
      *施医総管
      *   （機能強化在支診等・床有・月１回・通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "16 3G114735610".
      *   （機能強化在支診等・床有・月１回・通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "16 4G114735710".
      *   （機能強化在支診等・床有・月１回・通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "16 5G114735810".
      *
      *施医総管
      *   （機能強化在支診等・床無・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "17 3G114736510".
      *   （機能強化在支診等・床無・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "17 4G114736610".
      *   （機能強化在支診等・床無・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "17 5G114736710".
      *
      *施医総管
      *   （機能強化在支診等・床無・月１回・通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "17 3G114737110".
      *   （機能強化在支診等・床無・月１回・通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "17 4G114737210".
      *   （機能強化在支診等・床無・月１回・通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "17 5G114737310".
      *
      *施医総管
      *   （在支診等・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "18 3G114738010".
      *   （在支診等・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "18 4G114738110".
      *   （在支診等・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "18 5G114738210".
      *
      *施医総管
      *   （在支診等・月１回・通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "18 3G114738610".
      *   （在支診等・月１回・通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "18 4G114738710".
      *   （在支診等・月１回・通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "18 5G114738810".
      *
      *施医総管
      *   （在支診等以外・月２回~通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "19 3G114739510".
      *   （在支診等以外・月２回~通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "19 4G114739610".
      *   （在支診等以外・月２回~通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "19 5G114739710".
      *
      *施医総管
      *   （在支診等以外・月１回・通信機１０~１９人減）
           03  FILLER              PIC X(14)   VALUE   "19 3G114740110".
      *   （在支診等以外・月１回・通信機２０~４９人減）
           03  FILLER              PIC X(14)   VALUE   "19 4G114740210".
      *   （在支診等以外・月１回・通信機５０人~減）
           03  FILLER              PIC X(14)   VALUE   "19 5G114740310".
      *
      *****
      *2024/06 追加
      *在医総管
      *    （在支診等以外・難病等月２回~１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 3S114743310".
      *    （在支診等以外・難病等月２回~２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 4S114743410".
      *    （在支診等以外・難病等月２回~５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 5S114743510".
      *
      *在医総管
      *    （在支診等以外・月２回~１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 3S114743610".
      *    （在支診等以外・月２回~２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 4S114743710".
      *    （在支診等以外・月２回~５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 5S114743810".
      *
      *在医総管
      *    （在支診等以外・月１回・１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 3S114744210".
      *    （在支診等以外・月１回・２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 4S114744310".
      *    （在支診等以外・月１回・５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "04 5S114744410".
      *
      *在医総管
      *    （在支診等以外・月２回~通信機１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "09 3S114743910".
      *    （在支診等以外・月２回~通信機２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "09 4S114744010".
      *    （在支診等以外・月２回~通信機５０人~・注８注１４
           03  FILLER              PIC X(14)   VALUE   "09 5S114744110".
      *
      *在医総管
      *    （在支診等以外・月１回・通信機１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "09 3S114744510".
      *    （在支診等以外・月１回・通信機２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "09 4S114744610".
      *    （在支診等以外・月１回・通信機５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "09 5S114744710".
      *****
      *施医総管
      *    （在支診等以外・月２回~１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 3S114745110".
      *    （在支診等以外・月２回~２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 4S114745210".
      *    （在支診等以外・月２回~５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 5S114745310".
      *
      *施医総管
      *    （在支診等以外・難病等月２回~１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 3S114744810".
      *    （在支診等以外・難病等月２回~２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 4S114744910".
      *    （在支診等以外・難病等月２回~５０人~・注８注１４
           03  FILLER              PIC X(14)   VALUE   "14 5S114745010".
      *
      *施医総管
      *    （在支診等以外・月１回・１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 3S114745710".
      *    （在支診等以外・月１回・２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 4S114745810".
      *    （在支診等以外・月１回・５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "14 5S114745910".
      *
      *施医総管
      *   （在支診等以外・月２回~通信機１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "19 3S114745410".
      *   （在支診等以外・月２回~通信機２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "19 4S114745510".
      *   （在支診等以外・月２回~通信機５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "19 5S114745610".
      *
      *施医総管
      *   （在支診等以外・月１回・通信機１０~１９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "19 3S114746010".
      *   （在支診等以外・月１回・通信機２０~４９人・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "19 4S114746110".
      *   （在支診等以外・月１回・通信機５０人~・注８注１４）
           03  FILLER              PIC X(14)   VALUE   "19 5S114746210".
      *
       01  TBL-ZISOSIN24-AREA-R      REDEFINES   TBL-ZISOSIN24-AREA.
     ****  03  TBL-ZISOSIN24-OCC     OCCURS   326
           03  TBL-ZISOSIN24-OCC     OCCURS   356
                                   INDEXED  TBL-ZSIDX24.
      *        同一識別（１桁目　0：在医総管、1：特医総管(施医総管)）
      *                          2:在宅がん医総
      *                  ２桁目  5-9 :通信機  ）
               05  TBL-ZS24-GRP          PIC X(02).
      *        1:処方せんあり、2:処方せんなし
               05  TBL-ZS24-KBN          PIC X(01).
      *        1:同一建物１人、2:同一建物２人から９人、3:１０人~１９人
      *        4:２０人から４９人，5:５０人から
               05  TBL-ZS24-KBN2         PIC X(01).
      *        G:（減）,S:注８注１４
               05  TBL-ZS24-KBN3         PIC X(01).
      *
               05  TBL-ZS24-SRYCD        PIC X(09).
      *
      *
       01  TBL-ZISOKSN24-AREA.
      *在医総管(在支診等)
      *（１人）緩和ケア充実
           03  FILLER              PIC X(14)   VALUE   "0 11 114034570".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "0 21 114034870".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "0 31 114035170".
      * （２人~９人）緩和ケア充実
           03  FILLER              PIC X(14)   VALUE   "0 12 114034670".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "0 22 114034970".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "0 32 114035270".
      * （１０人~１９人）緩和ケア充実
           03  FILLER              PIC X(14)   VALUE   "0 13 114716110".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "0 23 114716610".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "0 33 114717110".
      * 在宅緩和ケア充実診療所・病院加算（在医総管）（２０人~４９人）
           03  FILLER              PIC X(14)   VALUE   "0 14 114716210".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "0 24 114716710".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "0 34 114717210".
      * 在宅緩和ケア充実診療所・病院加算（在医総管）（５０人~）
           03  FILLER              PIC X(14)   VALUE   "0 15 114716310".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "0 25 114716810".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "0 35 114717310".
      *
      *特医総管(在支診等)
      *（１人）緩和ケア充実
           03  FILLER              PIC X(14)   VALUE   "1 11 114039370".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "1 21 114039670".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "1 31 114039970".
      *（２人~９人）緩和ケア充実
           03  FILLER              PIC X(14)   VALUE   "1 12 114039470".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "1 22 114039770".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "1 32 114040070".
      *在宅緩和ケア充実診療所・病院加算（施医総管）（１０人~１９人）
           03  FILLER              PIC X(14)   VALUE   "1 13 114733110".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "1 23 114733610".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "1 33 114734110".
      *在宅緩和ケア充実診療所・病院加算（施医総管）（２０人~４９人）
           03  FILLER              PIC X(14)   VALUE   "1 14 114733210".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "1 24 114733710".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "1 34 114734210".
      *在宅緩和ケア充実診療所・病院加算（施医総管）（５０人~）
           03  FILLER              PIC X(14)   VALUE   "1 15 114733310".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "1 25 114733810".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "1 35 114734310".
      *
      *在宅がん医総合
      *        緩和ケア充実
           03  FILLER              PIC X(14)   VALUE   "2 10 114040270".
      *        実績加算１
           03  FILLER              PIC X(14)   VALUE   "2 20 114040370".
      *        実績加算２
           03  FILLER              PIC X(14)   VALUE   "2 30 114040470".
      *
       01  TBL-ZISOKSN24-AREA-R      REDEFINES   TBL-ZISOKSN24-AREA.
           03  TBL-ZISOKSN24-OCC     OCCURS   33
                                   INDEXED  TBL-ZKSIDX24.
      *        同一識別（１桁目　0：在医総管、1：特医総管）
      *                          2:在宅がん医総
               05  TBL-ZKS24-GRP          PIC X(02).
      *        1:緩和ケア充実、2:実績加算１、3:実績加算２
               05  TBL-ZKS24-KBN          PIC X(01).
      *        1:同一建物１人、2:同一建物２人から９人、3:１０人~１９人
      *        4:２０人から４９人，5:５０人から
               05  TBL-ZKS24-KBN2         PIC X(01).
      *
               05  TBL-ZKS24-YOBI         PIC X(01).
      *
               05  TBL-ZKS24-SRYCD        PIC X(09).
      *
      *
