      ********************************************************************
      * Project code name "ORCA"
      * ∆¸∞Â…∏Ω‡•Ï•ª•◊•»•Ω•’•»° JMA standard receipt software°À
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *   Œ≈Õ‹…¬≈Ô•≥°º•…            (CPRYOYOCD.INC)
      ********************************************************************
      *  •≥•‘°º∂ÁΩ§¿µÕ˙ŒÚ
      * Maj/Min/Rev  Ω§¿µº‘       ∆¸…’      ∆‚Õ∆
      * 05.02.01    ORCAMO        24/04/30  Œ·œ¬£∂«Ø≈Ÿ≤˛¿µ¬–±˛
      *                                     ≤Û…¸¥¸•Í•œ•”•Í•∆°º•∑•Á•Û∆˛±°∞ÂŒ≈¥…Õ˝Œ¡
      *                                     H5 H6 ƒ…≤√
      ********************************************************************
      *   Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡•≥°º•…
      ********************************************************************
       01  CONST-RYOYOCD-AREA.
           03  CONST-RYOYOCD-G.
               05  CONST-RYOYOCD-VAL.
      *-1---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190121310".
                   07                  PIC X(09)   VALUE "190121410".
                   07                  PIC X(09)   VALUE "190121510".
                   07                  PIC X(09)   VALUE "190121610".
                   07                  PIC X(09)   VALUE "190121710".
                   07                  PIC X(09)   VALUE "190131610".
                   07                  PIC X(09)   VALUE "190131810".
                   07                  PIC X(09)   VALUE "190132010".
                   07                  PIC X(09)   VALUE "190132210".
      *-2---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190123710".
                   07                  PIC X(09)   VALUE "190123810".
                   07                  PIC X(09)   VALUE "190123910".
                   07                  PIC X(09)   VALUE "190124010".
                   07                  PIC X(09)   VALUE "190124110".
                   07                  PIC X(09)   VALUE "190131710".
                   07                  PIC X(09)   VALUE "190131910".
                   07                  PIC X(09)   VALUE "190132110".
                   07                  PIC X(09)   VALUE "190132310".
      *-3---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190132410".
                   07                  PIC X(09)   VALUE "190132610".
                   07                  PIC X(09)   VALUE "190132810".
                   07                  PIC X(09)   VALUE "190133010".
                   07                  PIC X(09)   VALUE "190133210".
                   07                  PIC X(09)   VALUE "190133410".
                   07                  PIC X(09)   VALUE "190133610".
                   07                  PIC X(09)   VALUE "190133810".
                   07                  PIC X(09)   VALUE "190134010".
      *-4---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190132510".
                   07                  PIC X(09)   VALUE "190132710".
                   07                  PIC X(09)   VALUE "190132910".
                   07                  PIC X(09)   VALUE "190133110".
                   07                  PIC X(09)   VALUE "190133310".
                   07                  PIC X(09)   VALUE "190133510".
                   07                  PIC X(09)   VALUE "190133710".
                   07                  PIC X(09)   VALUE "190133910".
                   07                  PIC X(09)   VALUE "190134110".
      *-5---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190121810".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-6---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190124210".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-7---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190122010".
                   07                  PIC X(09)   VALUE "190122110".
                   07                  PIC X(09)   VALUE "190122210".
                   07                  PIC X(09)   VALUE "190122310".
                   07                  PIC X(09)   VALUE "190122410".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-8---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190124310".
                   07                  PIC X(09)   VALUE "190124410".
                   07                  PIC X(09)   VALUE "190124510".
                   07                  PIC X(09)   VALUE "190124610".
                   07                  PIC X(09)   VALUE "190124710".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-9---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190122510".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *10---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190124810".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *11---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190700910".
                   07                  PIC X(09)   VALUE "190701110".
                   07                  PIC X(09)   VALUE "190701310".
                   07                  PIC X(09)   VALUE "190701510".
                   07                  PIC X(09)   VALUE "190701710".
                   07                  PIC X(09)   VALUE "190701910".
                   07                  PIC X(09)   VALUE "190702110".
                   07                  PIC X(09)   VALUE "190702310".
                   07                  PIC X(09)   VALUE "190702510".
      *12---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190701010".
                   07                  PIC X(09)   VALUE "190701210".
                   07                  PIC X(09)   VALUE "190701410".
                   07                  PIC X(09)   VALUE "190701610".
                   07                  PIC X(09)   VALUE "190701810".
                   07                  PIC X(09)   VALUE "190702010".
                   07                  PIC X(09)   VALUE "190702210".
                   07                  PIC X(09)   VALUE "190702410".
                   07                  PIC X(09)   VALUE "190702610".
      *13---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190702710".
                   07                  PIC X(09)   VALUE "190702910".
                   07                  PIC X(09)   VALUE "190703110".
                   07                  PIC X(09)   VALUE "190703310".
                   07                  PIC X(09)   VALUE "190703510".
                   07                  PIC X(09)   VALUE "190703710".
                   07                  PIC X(09)   VALUE "190703910".
                   07                  PIC X(09)   VALUE "190704110".
                   07                  PIC X(09)   VALUE "190704310".
      *14---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190702810".
                   07                  PIC X(09)   VALUE "190703010".
                   07                  PIC X(09)   VALUE "190703210".
                   07                  PIC X(09)   VALUE "190703410".
                   07                  PIC X(09)   VALUE "190703610".
                   07                  PIC X(09)   VALUE "190703810".
                   07                  PIC X(09)   VALUE "190704010".
                   07                  PIC X(09)   VALUE "190704210".
                   07                  PIC X(09)   VALUE "190704410".
      *15---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157210".
                   07                  PIC X(09)   VALUE "190157610".
                   07                  PIC X(09)   VALUE "190158010".
                   07                  PIC X(09)   VALUE "190158410".
                   07                  PIC X(09)   VALUE "190158810".
                   07                  PIC X(09)   VALUE "190159210".
                   07                  PIC X(09)   VALUE "190159610".
                   07                  PIC X(09)   VALUE "190160010".
                   07                  PIC X(09)   VALUE "190160410".
      *16---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157410".
                   07                  PIC X(09)   VALUE "190157810".
                   07                  PIC X(09)   VALUE "190158210".
                   07                  PIC X(09)   VALUE "190158610".
                   07                  PIC X(09)   VALUE "190159010".
                   07                  PIC X(09)   VALUE "190159410".
                   07                  PIC X(09)   VALUE "190159810".
                   07                  PIC X(09)   VALUE "190160210".
                   07                  PIC X(09)   VALUE "190160610".
      *17---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157310".
                   07                  PIC X(09)   VALUE "190157710".
                   07                  PIC X(09)   VALUE "190158110".
                   07                  PIC X(09)   VALUE "190158510".
                   07                  PIC X(09)   VALUE "190158910".
                   07                  PIC X(09)   VALUE "190159310".
                   07                  PIC X(09)   VALUE "190159710".
                   07                  PIC X(09)   VALUE "190160110".
                   07                  PIC X(09)   VALUE "190160510".
      *18---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157510".
                   07                  PIC X(09)   VALUE "190157910".
                   07                  PIC X(09)   VALUE "190158310".
                   07                  PIC X(09)   VALUE "190158710".
                   07                  PIC X(09)   VALUE "190159110".
                   07                  PIC X(09)   VALUE "190159510".
                   07                  PIC X(09)   VALUE "190159910".
                   07                  PIC X(09)   VALUE "190160310".
                   07                  PIC X(09)   VALUE "190160710".
      *19---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190711410".
                   07                  PIC X(09)   VALUE "190711610".
                   07                  PIC X(09)   VALUE "190711810".
                   07                  PIC X(09)   VALUE "190712010".
                   07                  PIC X(09)   VALUE "190712210".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *20---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190711510".
                   07                  PIC X(09)   VALUE "190711710".
                   07                  PIC X(09)   VALUE "190711910".
                   07                  PIC X(09)   VALUE "190712110".
                   07                  PIC X(09)   VALUE "190712310".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *21---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155210".
                   07                  PIC X(09)   VALUE "190155610".
                   07                  PIC X(09)   VALUE "190156010".
                   07                  PIC X(09)   VALUE "190156410".
                   07                  PIC X(09)   VALUE "190156810".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *22---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155410".
                   07                  PIC X(09)   VALUE "190155810".
                   07                  PIC X(09)   VALUE "190156210".
                   07                  PIC X(09)   VALUE "190156610".
                   07                  PIC X(09)   VALUE "190157010".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *23---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155310".
                   07                  PIC X(09)   VALUE "190155710".
                   07                  PIC X(09)   VALUE "190156110".
                   07                  PIC X(09)   VALUE "190156510".
                   07                  PIC X(09)   VALUE "190156910".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *24---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155510".
                   07                  PIC X(09)   VALUE "190155910".
                   07                  PIC X(09)   VALUE "190156310".
                   07                  PIC X(09)   VALUE "190156710".
                   07                  PIC X(09)   VALUE "190157110".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *25---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190162210".
                   07                  PIC X(09)   VALUE "190162410".
                   07                  PIC X(09)   VALUE "190162610".
                   07                  PIC X(09)   VALUE "190162810".
                   07                  PIC X(09)   VALUE "190163010".
                   07                  PIC X(09)   VALUE "190163210".
                   07                  PIC X(09)   VALUE "190163410".
                   07                  PIC X(09)   VALUE "190163610".
                   07                  PIC X(09)   VALUE "190163810".
      *26---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190162310".
                   07                  PIC X(09)   VALUE "190162510".
                   07                  PIC X(09)   VALUE "190162710".
                   07                  PIC X(09)   VALUE "190162910".
                   07                  PIC X(09)   VALUE "190163110".
                   07                  PIC X(09)   VALUE "190163310".
                   07                  PIC X(09)   VALUE "190163510".
                   07                  PIC X(09)   VALUE "190163710".
                   07                  PIC X(09)   VALUE "190163910".
      *27---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190166110".
                   07                  PIC X(09)   VALUE "190166310".
                   07                  PIC X(09)   VALUE "190166510".
                   07                  PIC X(09)   VALUE "190166710".
                   07                  PIC X(09)   VALUE "190166910".
                   07                  PIC X(09)   VALUE "190167110".
                   07                  PIC X(09)   VALUE "190167310".
                   07                  PIC X(09)   VALUE "190167510".
                   07                  PIC X(09)   VALUE "190167710".
      *28---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190166210".
                   07                  PIC X(09)   VALUE "190166410".
                   07                  PIC X(09)   VALUE "190166610".
                   07                  PIC X(09)   VALUE "190166810".
                   07                  PIC X(09)   VALUE "190167010".
                   07                  PIC X(09)   VALUE "190167210".
                   07                  PIC X(09)   VALUE "190167410".
                   07                  PIC X(09)   VALUE "190167610".
                   07                  PIC X(09)   VALUE "190167810".
      *29---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190185510".
                   07                  PIC X(09)   VALUE "190185710".
                   07                  PIC X(09)   VALUE "190185910".
                   07                  PIC X(09)   VALUE "190186110".
                   07                  PIC X(09)   VALUE "190186310".
                   07                  PIC X(09)   VALUE "190186510".
                   07                  PIC X(09)   VALUE "190186710".
                   07                  PIC X(09)   VALUE "190186910".
                   07                  PIC X(09)   VALUE "190187110".
      *30---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190185610".
                   07                  PIC X(09)   VALUE "190185810".
                   07                  PIC X(09)   VALUE "190186010".
                   07                  PIC X(09)   VALUE "190186210".
                   07                  PIC X(09)   VALUE "190186410".
                   07                  PIC X(09)   VALUE "190186610".
                   07                  PIC X(09)   VALUE "190186810".
                   07                  PIC X(09)   VALUE "190187010".
                   07                  PIC X(09)   VALUE "190187210".
      *31---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190183710".
                   07                  PIC X(09)   VALUE "190183910".
                   07                  PIC X(09)   VALUE "190184110".
                   07                  PIC X(09)   VALUE "190184310".
                   07                  PIC X(09)   VALUE "190184510".
                   07                  PIC X(09)   VALUE "190184710".
                   07                  PIC X(09)   VALUE "190184910".
                   07                  PIC X(09)   VALUE "190185110".
                   07                  PIC X(09)   VALUE "190185310".
      *32---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190183810".
                   07                  PIC X(09)   VALUE "190184010".
                   07                  PIC X(09)   VALUE "190184210".
                   07                  PIC X(09)   VALUE "190184410".
                   07                  PIC X(09)   VALUE "190184610".
                   07                  PIC X(09)   VALUE "190184810".
                   07                  PIC X(09)   VALUE "190185010".
                   07                  PIC X(09)   VALUE "190185210".
                   07                  PIC X(09)   VALUE "190185410".
      *33---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190215110".
                   07                  PIC X(09)   VALUE "190215310".
                   07                  PIC X(09)   VALUE "190215510".
                   07                  PIC X(09)   VALUE "190215710".
                   07                  PIC X(09)   VALUE "190215910".
                   07                  PIC X(09)   VALUE "190216110".
                   07                  PIC X(09)   VALUE "190216310".
                   07                  PIC X(09)   VALUE "190216510".
                   07                  PIC X(09)   VALUE "190216710".
      *34---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190215210".
                   07                  PIC X(09)   VALUE "190215410".
                   07                  PIC X(09)   VALUE "190215610".
                   07                  PIC X(09)   VALUE "190215810".
                   07                  PIC X(09)   VALUE "190216010".
                   07                  PIC X(09)   VALUE "190216210".
                   07                  PIC X(09)   VALUE "190216410".
                   07                  PIC X(09)   VALUE "190216610".
                   07                  PIC X(09)   VALUE "190216810".
      *35---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190202510".
                   07                  PIC X(09)   VALUE "190202710".
                   07                  PIC X(09)   VALUE "190202910".
                   07                  PIC X(09)   VALUE "190203110".
                   07                  PIC X(09)   VALUE "190203310".
                   07                  PIC X(09)   VALUE "190203510".
                   07                  PIC X(09)   VALUE "190203710".
                   07                  PIC X(09)   VALUE "190203910".
                   07                  PIC X(09)   VALUE "190204110".
      *36---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190202610".
                   07                  PIC X(09)   VALUE "190202810".
                   07                  PIC X(09)   VALUE "190203010".
                   07                  PIC X(09)   VALUE "190203210".
                   07                  PIC X(09)   VALUE "190203410".
                   07                  PIC X(09)   VALUE "190203610".
                   07                  PIC X(09)   VALUE "190203810".
                   07                  PIC X(09)   VALUE "190204010".
                   07                  PIC X(09)   VALUE "190204210".
      *        °˙§œ∆√ Ã∆˛±°¥À‹Œ¡
               05  CONST-RYOYOCD-R REDEFINES   CONST-RYOYOCD-VAL.
      *                £±°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±
      *                £≤°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°À
      *                £≥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤
      *                £¥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À
      *            °˙  £µ°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡
      *            °˙  £∂°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
      *                £∑°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡
      *                £∏°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
      *            °˙  £π°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡
      *            °˙£±£∞°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
      *              £±£±°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ±…¥…∑–≤·¡º√÷°À
      *              £±£≤°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°À° ±…¥…∑–≤·¡º√÷°À
      *              £±£≥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ±…¥…∑–≤·¡º√÷°À
      *              £±£¥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ±…¥…∑–≤·¡º√÷°À
      *              £±£µ°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±
      *              £±£∂°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°À
      *              £±£∑°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ±…¥…∑–≤·¡º√÷°À
      *              £±£∏°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°¶±…¥…∑–≤·¡º√÷°À
      *              £±£π°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡° ±…¥…∑–≤·¡º√÷°À
      *              £≤£∞°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À° ±…¥…∑–≤·¡º√÷°À
      *              £≤£±°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°
      *              £≤£≤°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°° ¿∏≥ËŒ≈Õ‹°À
      *              £≤£≥°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°° ±…¥…∑–≤·¡º√÷°À
      *              £≤£¥°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°° ¿∏≥ËŒ≈Õ‹°¶±…¥…∑–≤·¡º√÷°À
      *              £≤£µ°ß∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±
      *              £≤£∂°ß∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ±…¥…∑–≤·¡º√÷°À
      *              £≤£∑°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ÃÎ∂–ª˛¥÷ƒ∂≤·∏∫ªª°À
      *              £≤£∏°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ÃÎ∂–ª˛¥÷ƒ∂≤·∏∫ªª°À
      *              £≤£π°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ÃÎ∂–ª˛¥÷∆√ Ã∆˛±°¥À‹Œ¡°À
      *              £≥£∞°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ÃÎ∂–ª˛¥÷∆√ Ã∆˛±°¥À‹Œ¡°À
      *              £≥£±°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¥«∏Óø¶∞˜øÙ≈˘∑–≤·¡º√÷°À
      *              £≥£≤°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ¥«∏Óø¶∞˜øÙ≈˘∑–≤·¡º√÷°À
      *              £≥£≥°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ∑–≤·¡º√÷£±°À
      *              £≥£¥°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ∑–≤·¡º√÷£±°À
      *              £≥£µ°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ∑–≤·¡º√÷£≤°À
      *              £≥£∂°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ∑–≤·¡º√÷£≤°À
                   07  CONST-RYOYOCD-KHN-OCC   OCCURS       36.
                       09  CONST-RYOYOCD       PIC X(09)    OCCURS  9.
               05  CONST-RYOYOCD-KHN-MAX       PIC 9(05)    VALUE   36.
               05  CONST-RYOYOCD-CD-MAX        PIC 9(05)    VALUE   9.
      *
      ********************************************************************
      *   Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡•≥°º•…° Œ·œ¬£∂«Ø≤˛¿µ§«ø∑¿ﬂ°À
      ********************************************************************
       01  CONST-R06-RYOYOCD-AREA.
           03  CONST-R06-RYOYOCD-G.
               05  CONST-R06-RYOYOCD-VAL.
      *-1---------------------------------------------------------------
                   07   FILLER       PIC X(09)   VALUE "190817610".
                   07   FILLER       PIC X(09)   VALUE "190817810".
                   07   FILLER       PIC X(09)   VALUE "190818010".
                   07   FILLER       PIC X(09)   VALUE "190818210".
                   07   FILLER       PIC X(09)   VALUE "190818410".
                   07   FILLER       PIC X(09)   VALUE "190818610".
                   07   FILLER       PIC X(09)   VALUE "190818810".
                   07   FILLER       PIC X(09)   VALUE "190819010".
                   07   FILLER       PIC X(09)   VALUE "190819210".
                   07   FILLER       PIC X(09)   VALUE "190819410".
                   07   FILLER       PIC X(09)   VALUE "190819610".
                   07   FILLER       PIC X(09)   VALUE "190819810".
                   07   FILLER       PIC X(09)   VALUE "190820010".
                   07   FILLER       PIC X(09)   VALUE "190820210".
                   07   FILLER       PIC X(09)   VALUE "190820410".
                   07   FILLER       PIC X(09)   VALUE "190820610".
                   07   FILLER       PIC X(09)   VALUE "190820810".
                   07   FILLER       PIC X(09)   VALUE "190821010".
                   07   FILLER       PIC X(09)   VALUE "190821210".
                   07   FILLER       PIC X(09)   VALUE "190821410".
                   07   FILLER       PIC X(09)   VALUE "190821610".
                   07   FILLER       PIC X(09)   VALUE "190821810".
                   07   FILLER       PIC X(09)   VALUE "190822010".
                   07   FILLER       PIC X(09)   VALUE "190822210".
                   07   FILLER       PIC X(09)   VALUE "190822410".
                   07   FILLER       PIC X(09)   VALUE "190822610".
                   07   FILLER       PIC X(09)   VALUE "190822810".
                   07   FILLER       PIC X(09)   VALUE "190823010".
                   07   FILLER       PIC X(09)   VALUE "190823210".
                   07   FILLER       PIC X(09)   VALUE "190823410".
      *
      *-2---------------------------------------------------------------
                   07   FILLER       PIC X(09)   VALUE "190817710".
                   07   FILLER       PIC X(09)   VALUE "190817910".
                   07   FILLER       PIC X(09)   VALUE "190818110".
                   07   FILLER       PIC X(09)   VALUE "190818310".
                   07   FILLER       PIC X(09)   VALUE "190818510".
                   07   FILLER       PIC X(09)   VALUE "190818710".
                   07   FILLER       PIC X(09)   VALUE "190818910".
                   07   FILLER       PIC X(09)   VALUE "190819110".
                   07   FILLER       PIC X(09)   VALUE "190819310".
                   07   FILLER       PIC X(09)   VALUE "190819510".
                   07   FILLER       PIC X(09)   VALUE "190819710".
                   07   FILLER       PIC X(09)   VALUE "190819910".
                   07   FILLER       PIC X(09)   VALUE "190820110".
                   07   FILLER       PIC X(09)   VALUE "190820310".
                   07   FILLER       PIC X(09)   VALUE "190820510".
                   07   FILLER       PIC X(09)   VALUE "190820710".
                   07   FILLER       PIC X(09)   VALUE "190820910".
                   07   FILLER       PIC X(09)   VALUE "190821110".
                   07   FILLER       PIC X(09)   VALUE "190821310".
                   07   FILLER       PIC X(09)   VALUE "190821510".
                   07   FILLER       PIC X(09)   VALUE "190821710".
                   07   FILLER       PIC X(09)   VALUE "190821910".
                   07   FILLER       PIC X(09)   VALUE "190822110".
                   07   FILLER       PIC X(09)   VALUE "190822310".
                   07   FILLER       PIC X(09)   VALUE "190822510".
                   07   FILLER       PIC X(09)   VALUE "190822710".
                   07   FILLER       PIC X(09)   VALUE "190822910".
                   07   FILLER       PIC X(09)   VALUE "190823110".
                   07   FILLER       PIC X(09)   VALUE "190823310".
                   07   FILLER       PIC X(09)   VALUE "190823510".
      *
      *-3---------------------------------------------------------------
                   07   FILLER       PIC X(09)   VALUE "190823610".
                   07   FILLER       PIC X(09)   VALUE "190823810".
                   07   FILLER       PIC X(09)   VALUE "190824010".
                   07   FILLER       PIC X(09)   VALUE "190824210".
                   07   FILLER       PIC X(09)   VALUE "190824410".
                   07   FILLER       PIC X(09)   VALUE "190824610".
                   07   FILLER       PIC X(09)   VALUE "190824810".
                   07   FILLER       PIC X(09)   VALUE "190825010".
                   07   FILLER       PIC X(09)   VALUE "190825210".
                   07   FILLER       PIC X(09)   VALUE "190825410".
                   07   FILLER       PIC X(09)   VALUE "190825610".
                   07   FILLER       PIC X(09)   VALUE "190825810".
                   07   FILLER       PIC X(09)   VALUE "190826010".
                   07   FILLER       PIC X(09)   VALUE "190826210".
                   07   FILLER       PIC X(09)   VALUE "190826410".
                   07   FILLER       PIC X(09)   VALUE "190826610".
                   07   FILLER       PIC X(09)   VALUE "190826810".
                   07   FILLER       PIC X(09)   VALUE "190827010".
                   07   FILLER       PIC X(09)   VALUE "190827210".
                   07   FILLER       PIC X(09)   VALUE "190827410".
                   07   FILLER       PIC X(09)   VALUE "190827610".
                   07   FILLER       PIC X(09)   VALUE "190827810".
                   07   FILLER       PIC X(09)   VALUE "190828010".
                   07   FILLER       PIC X(09)   VALUE "190828210".
                   07   FILLER       PIC X(09)   VALUE "190828410".
                   07   FILLER       PIC X(09)   VALUE "190828610".
                   07   FILLER       PIC X(09)   VALUE "190828810".
                   07   FILLER       PIC X(09)   VALUE "190829010".
                   07   FILLER       PIC X(09)   VALUE "190829210".
                   07   FILLER       PIC X(09)   VALUE "190829410".
      *
      *-4---------------------------------------------------------------
                   07   FILLER       PIC X(09)   VALUE "190823710".
                   07   FILLER       PIC X(09)   VALUE "190823910".
                   07   FILLER       PIC X(09)   VALUE "190824110".
                   07   FILLER       PIC X(09)   VALUE "190824310".
                   07   FILLER       PIC X(09)   VALUE "190824510".
                   07   FILLER       PIC X(09)   VALUE "190824710".
                   07   FILLER       PIC X(09)   VALUE "190824910".
                   07   FILLER       PIC X(09)   VALUE "190825110".
                   07   FILLER       PIC X(09)   VALUE "190825310".
                   07   FILLER       PIC X(09)   VALUE "190825510".
                   07   FILLER       PIC X(09)   VALUE "190825710".
                   07   FILLER       PIC X(09)   VALUE "190825910".
                   07   FILLER       PIC X(09)   VALUE "190826110".
                   07   FILLER       PIC X(09)   VALUE "190826310".
                   07   FILLER       PIC X(09)   VALUE "190826510".
                   07   FILLER       PIC X(09)   VALUE "190826710".
                   07   FILLER       PIC X(09)   VALUE "190826910".
                   07   FILLER       PIC X(09)   VALUE "190827110".
                   07   FILLER       PIC X(09)   VALUE "190827310".
                   07   FILLER       PIC X(09)   VALUE "190827510".
                   07   FILLER       PIC X(09)   VALUE "190827710".
                   07   FILLER       PIC X(09)   VALUE "190827910".
                   07   FILLER       PIC X(09)   VALUE "190828110".
                   07   FILLER       PIC X(09)   VALUE "190828310".
                   07   FILLER       PIC X(09)   VALUE "190828510".
                   07   FILLER       PIC X(09)   VALUE "190828710".
                   07   FILLER       PIC X(09)   VALUE "190828910".
                   07   FILLER       PIC X(09)   VALUE "190829110".
                   07   FILLER       PIC X(09)   VALUE "190829310".
                   07   FILLER       PIC X(09)   VALUE "190829510".
      *
      *-5---------------------------------------------------------------
                   07   FILLER       PIC X(09)   VALUE "190869810".
                   07   FILLER       PIC X(09)   VALUE "190869910".
                   07   FILLER       PIC X(09)   VALUE "190870010".
                   07   FILLER       PIC X(09)   VALUE "190870110".
                   07   FILLER       PIC X(09)   VALUE "190870210".
                   07   FILLER       PIC X(09)   VALUE "190870310".
                   07   FILLER       PIC X(09)   VALUE "190870410".
                   07   FILLER       PIC X(09)   VALUE "190870510".
                   07   FILLER       PIC X(09)   VALUE "190870610".
                   07   FILLER       PIC X(09)   VALUE "190870710".
                   07   FILLER       PIC X(09)   VALUE "190870810".
                   07   FILLER       PIC X(09)   VALUE "190870910".
                   07   FILLER       PIC X(09)   VALUE "190871010".
                   07   FILLER       PIC X(09)   VALUE "190871110".
                   07   FILLER       PIC X(09)   VALUE "190871210".
                   07   FILLER       PIC X(09)   VALUE "190871310".
                   07   FILLER       PIC X(09)   VALUE "190871410".
                   07   FILLER       PIC X(09)   VALUE "190871510".
                   07   FILLER       PIC X(09)   VALUE "190871610".
                   07   FILLER       PIC X(09)   VALUE "190871710".
                   07   FILLER       PIC X(09)   VALUE "190871810".
                   07   FILLER       PIC X(09)   VALUE "190871910".
                   07   FILLER       PIC X(09)   VALUE "190872010".
                   07   FILLER       PIC X(09)   VALUE "190872110".
                   07   FILLER       PIC X(09)   VALUE "190872210".
                   07   FILLER       PIC X(09)   VALUE "190872310".
                   07   FILLER       PIC X(09)   VALUE "190872410".
                   07   FILLER       PIC X(09)   VALUE "190872510".
                   07   FILLER       PIC X(09)   VALUE "190872610".
                   07   FILLER       PIC X(09)   VALUE "190872710".
      *
      *-6---------------------------------------------------------------
                  07   FILLER       PIC X(09)   VALUE "190814610".
                  07   FILLER       PIC X(09)   VALUE "190814710".
                  07   FILLER       PIC X(09)   VALUE "190814810".
                  07   FILLER       PIC X(09)   VALUE "190814910".
                  07   FILLER       PIC X(09)   VALUE "190815010".
                  07   FILLER       PIC X(09)   VALUE "190815110".
                  07   FILLER       PIC X(09)   VALUE "190815210".
                  07   FILLER       PIC X(09)   VALUE "190815310".
                  07   FILLER       PIC X(09)   VALUE "190815410".
                  07   FILLER       PIC X(09)   VALUE "190815510".
                  07   FILLER       PIC X(09)   VALUE "190815610".
                  07   FILLER       PIC X(09)   VALUE "190815710".
                  07   FILLER       PIC X(09)   VALUE "190815810".
                  07   FILLER       PIC X(09)   VALUE "190815910".
                  07   FILLER       PIC X(09)   VALUE "190816010".
                  07   FILLER       PIC X(09)   VALUE "190816110".
                  07   FILLER       PIC X(09)   VALUE "190816210".
                  07   FILLER       PIC X(09)   VALUE "190816310".
                  07   FILLER       PIC X(09)   VALUE "190816410".
                  07   FILLER       PIC X(09)   VALUE "190816510".
                  07   FILLER       PIC X(09)   VALUE "190816610".
                  07   FILLER       PIC X(09)   VALUE "190816710".
                  07   FILLER       PIC X(09)   VALUE "190816810".
                  07   FILLER       PIC X(09)   VALUE "190816910".
                  07   FILLER       PIC X(09)   VALUE "190817010".
                  07   FILLER       PIC X(09)   VALUE "190817110".
                  07   FILLER       PIC X(09)   VALUE "190817210".
                  07   FILLER       PIC X(09)   VALUE "190817310".
                  07   FILLER       PIC X(09)   VALUE "190817410".
                  07   FILLER       PIC X(09)   VALUE "190817510".
      *-7---------------------------------------------------------------
                  07   FILLER       PIC X(09)   VALUE "190121810".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
      *-8---------------------------------------------------------------
                  07   FILLER       PIC X(09)   VALUE "190124210".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
                  07   FILLER       PIC X(09)   VALUE "000000000".
      *
               05  CONST-R06-RYOYOCD-R REDEFINES CONST-R06-RYOYOCD-VAL.
      *                £±°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£±
      *                £≤°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£±° ¿∏≥ËŒ≈Õ‹°À
      *                £≥°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤
      *                £¥°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À
      *                £µ°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°Œ¡£±
      *                £∂°ß∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°Œ¡£±
      *            °˙  £∑°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡
      *            °˙  £∏°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
                   07  CONST-R06-RYOYOCD-KHN-OCC   OCCURS    8.
                       09  CONST-R06-RYOYOCD     PIC X(09) OCCURS  30.
               05  CONST-R06-RYOYOCD-KHN-MAX     PIC 9(05) VALUE   8.
               05  CONST-R06-RYOYOCD-CD-MAX      PIC 9(05) VALUE   30.
      *
      *=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
      *    ∞Ï»Ã°¶¿∏≥ËŒ≈Õ‹√÷¥π»ΩƒÍÕ—
      *=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
       01  CONST-TOK-LIFECD-G.
           03  CONST-TOK-LIFECD-VAL.
               05  FILLER              PIC X(03)   VALUE   "213".
               05  FILLER              PIC X(03)   VALUE   "216".
      *
               05  FILLER              PIC X(03)   VALUE   "218".
               05  FILLER              PIC X(03)   VALUE   "219".
      *
               05  FILLER              PIC X(03)   VALUE   "220".
               05  FILLER              PIC X(03)   VALUE   "221".
      *
               05  FILLER              PIC X(03)   VALUE   "227".
               05  FILLER              PIC X(03)   VALUE   "228".
      *
               05  FILLER              PIC X(03)   VALUE   "229".
               05  FILLER              PIC X(03)   VALUE   "230".
      *
               05  FILLER              PIC X(03)   VALUE   "231".
               05  FILLER              PIC X(03)   VALUE   "232".
      *
               05  FILLER              PIC X(03)   VALUE   "302".
               05  FILLER              PIC X(03)   VALUE   "349".
      *
               05  FILLER              PIC X(03)   VALUE   "321".
               05  FILLER              PIC X(03)   VALUE   "350".
      *
               05  FILLER              PIC X(03)   VALUE   "325".
               05  FILLER              PIC X(03)   VALUE   "337".
      *
               05  FILLER              PIC X(03)   VALUE   "326".
               05  FILLER              PIC X(03)   VALUE   "338".
      *
               05  FILLER              PIC X(03)   VALUE   "327".
               05  FILLER              PIC X(03)   VALUE   "339".
      *
               05  FILLER              PIC X(03)   VALUE   "328".
               05  FILLER              PIC X(03)   VALUE   "340".
      *
               05  FILLER              PIC X(03)   VALUE   "329".
               05  FILLER              PIC X(03)   VALUE   "341".
      *
               05  FILLER              PIC X(03)   VALUE   "330".
               05  FILLER              PIC X(03)   VALUE   "342".
      *
               05  FILLER              PIC X(03)   VALUE   "331".
               05  FILLER              PIC X(03)   VALUE   "343".
      *
               05  FILLER              PIC X(03)   VALUE   "332".
               05  FILLER              PIC X(03)   VALUE   "344".
      *
               05  FILLER              PIC X(03)   VALUE   "333".
               05  FILLER              PIC X(03)   VALUE   "345".
      *
               05  FILLER              PIC X(03)   VALUE   "334".
               05  FILLER              PIC X(03)   VALUE   "346".
      *
               05  FILLER              PIC X(03)   VALUE   "335".
               05  FILLER              PIC X(03)   VALUE   "347".
      *
               05  FILLER              PIC X(03)   VALUE   "336".
               05  FILLER              PIC X(03)   VALUE   "348".
      *
               05  FILLER              PIC X(03)   VALUE   "323".
               05  FILLER              PIC X(03)   VALUE   "351".
      *
               05  FILLER              PIC X(03)   VALUE   "352".
               05  FILLER              PIC X(03)   VALUE   "353".
      *
               05  FILLER              PIC X(03)   VALUE   "363".
               05  FILLER              PIC X(03)   VALUE   "364".
      *
               05  FILLER              PIC X(03)   VALUE   "365".
               05  FILLER              PIC X(03)   VALUE   "366".
      *
               05  FILLER              PIC X(03)   VALUE   "367".
               05  FILLER              PIC X(03)   VALUE   "368".
      *
               05  FILLER              PIC X(03)   VALUE   "369".
               05  FILLER              PIC X(03)   VALUE   "370".
      *
               05  FILLER              PIC X(03)   VALUE   "371".
               05  FILLER              PIC X(03)   VALUE   "372".
      *
               05  FILLER              PIC X(03)   VALUE   "373".
               05  FILLER              PIC X(03)   VALUE   "374".
      *
               05  FILLER              PIC X(03)   VALUE   "375".
               05  FILLER              PIC X(03)   VALUE   "376".
      *
               05  FILLER              PIC X(03)   VALUE   "377".
               05  FILLER              PIC X(03)   VALUE   "378".
      *
               05  FILLER              PIC X(03)   VALUE   "379".
               05  FILLER              PIC X(03)   VALUE   "380".
      *
               05  FILLER              PIC X(03)   VALUE   "381".
               05  FILLER              PIC X(03)   VALUE   "382".
      *
               05  FILLER              PIC X(03)   VALUE   "383".
               05  FILLER              PIC X(03)   VALUE   "384".
      *
               05  FILLER              PIC X(03)   VALUE   "385".
               05  FILLER              PIC X(03)   VALUE   "386".
      *
               05  FILLER              PIC X(03)   VALUE   "387".
               05  FILLER              PIC X(03)   VALUE   "388".
      *
               05  FILLER              PIC X(03)   VALUE   "397".
               05  FILLER              PIC X(03)   VALUE   "398".
      *
               05  FILLER              PIC X(03)   VALUE   "399".
               05  FILLER              PIC X(03)   VALUE   "39A".
      *
               05  FILLER              PIC X(03)   VALUE   "39B".
               05  FILLER              PIC X(03)   VALUE   "39C".
      *
               05  FILLER              PIC X(03)   VALUE   "39D".
               05  FILLER              PIC X(03)   VALUE   "39E".
      *
               05  FILLER              PIC X(03)   VALUE   "39F".
               05  FILLER              PIC X(03)   VALUE   "39G".
      *
               05  FILLER              PIC X(03)   VALUE   "39H".
               05  FILLER              PIC X(03)   VALUE   "39I".
      *
               05  FILLER              PIC X(03)   VALUE   "39J".
               05  FILLER              PIC X(03)   VALUE   "39K".
      *
               05  FILLER              PIC X(03)   VALUE   "39L".
               05  FILLER              PIC X(03)   VALUE   "39M".
      *
               05  FILLER              PIC X(03)   VALUE   "39N".
               05  FILLER              PIC X(03)   VALUE   "39O".
      *
               05  FILLER              PIC X(03)   VALUE   "39P".
               05  FILLER              PIC X(03)   VALUE   "39Q".
      *
               05  FILLER              PIC X(03)   VALUE   "39R".
               05  FILLER              PIC X(03)   VALUE   "39S".
      *
               05  FILLER              PIC X(03)   VALUE   "39T".
               05  FILLER              PIC X(03)   VALUE   "39U".
      *
               05  FILLER              PIC X(03)   VALUE   "39V".
               05  FILLER              PIC X(03)   VALUE   "39W".
      *
               05  FILLER              PIC X(03)   VALUE   "39X".
               05  FILLER              PIC X(03)   VALUE   "39Y".
      *
               05  FILLER              PIC X(03)   VALUE   "39Z".
               05  FILLER              PIC X(03)   VALUE   "3A0".
      *
               05  FILLER              PIC X(03)   VALUE   "3A1".
               05  FILLER              PIC X(03)   VALUE   "3A2".
      *
               05  FILLER              PIC X(03)   VALUE   "3A3".
               05  FILLER              PIC X(03)   VALUE   "3A4".
      *
               05  FILLER              PIC X(03)   VALUE   "3A5".
               05  FILLER              PIC X(03)   VALUE   "3A6".
      *
               05  FILLER              PIC X(03)   VALUE   "3A7".
               05  FILLER              PIC X(03)   VALUE   "3A8".
      *
               05  FILLER              PIC X(03)   VALUE   "3A9".
               05  FILLER              PIC X(03)   VALUE   "3AA".
      *
               05  FILLER              PIC X(03)   VALUE   "3AB".
               05  FILLER              PIC X(03)   VALUE   "3AC".
      *
               05  FILLER              PIC X(03)   VALUE   "3AD".
               05  FILLER              PIC X(03)   VALUE   "3AE".
      *
               05  FILLER              PIC X(03)   VALUE   "3AF".
               05  FILLER              PIC X(03)   VALUE   "3AG".
      *
               05  FILLER              PIC X(03)   VALUE   "3AL".
               05  FILLER              PIC X(03)   VALUE   "3AM".
      *
               05  FILLER              PIC X(03)   VALUE   "3AN".
               05  FILLER              PIC X(03)   VALUE   "3AO".
      *
               05  FILLER              PIC X(03)   VALUE   "3AP".
               05  FILLER              PIC X(03)   VALUE   "3AQ".
      *
               05  FILLER              PIC X(03)   VALUE   "3AR".
               05  FILLER              PIC X(03)   VALUE   "3AS".
      *
               05  FILLER              PIC X(03)   VALUE   "3AW".
               05  FILLER              PIC X(03)   VALUE   "3AX".
      *
               05  FILLER              PIC X(03)   VALUE   "3AY".
               05  FILLER              PIC X(03)   VALUE   "3AZ".
      *
               05  FILLER              PIC X(03)   VALUE   "3B0".
               05  FILLER              PIC X(03)   VALUE   "3B1".
      *
               05  FILLER              PIC X(03)   VALUE   "3B2".
               05  FILLER              PIC X(03)   VALUE   "3B3".
      *
               05  FILLER              PIC X(03)   VALUE   "3B4".
               05  FILLER              PIC X(03)   VALUE   "3B5".
      *
               05  FILLER              PIC X(03)   VALUE   "3B6".
               05  FILLER              PIC X(03)   VALUE   "3B7".
      *
               05  FILLER              PIC X(03)   VALUE   "3B8".
               05  FILLER              PIC X(03)   VALUE   "3B9".
      *
               05  FILLER              PIC X(03)   VALUE   "3BA".
               05  FILLER              PIC X(03)   VALUE   "3BB".
      *
               05  FILLER              PIC X(03)   VALUE   "3BC".
               05  FILLER              PIC X(03)   VALUE   "3BD".
      *
               05  FILLER              PIC X(03)   VALUE   "3BE".
               05  FILLER              PIC X(03)   VALUE   "3BF".
      *
               05  FILLER              PIC X(03)   VALUE   "3BG".
               05  FILLER              PIC X(03)   VALUE   "3BH".
      *
               05  FILLER              PIC X(03)   VALUE   "3BI".
               05  FILLER              PIC X(03)   VALUE   "3BJ".
      *
               05  FILLER              PIC X(03)   VALUE   "241".
               05  FILLER              PIC X(03)   VALUE   "242".
      *
               05  FILLER              PIC X(03)   VALUE   "243".
               05  FILLER              PIC X(03)   VALUE   "244".
      *
               05  FILLER              PIC X(03)   VALUE   "245".
               05  FILLER              PIC X(03)   VALUE   "246".
      *
               05  FILLER              PIC X(03)   VALUE   "247".
               05  FILLER              PIC X(03)   VALUE   "248".
      *
               05  FILLER              PIC X(03)   VALUE   "255".
               05  FILLER              PIC X(03)   VALUE   "256".
      *
               05  FILLER              PIC X(03)   VALUE   "257".
               05  FILLER              PIC X(03)   VALUE   "258".
      *
               05  FILLER              PIC X(03)   VALUE   "259".
               05  FILLER              PIC X(03)   VALUE   "260".
      *
               05  FILLER              PIC X(03)   VALUE   "261".
               05  FILLER              PIC X(03)   VALUE   "262".
      *
               05  FILLER              PIC X(03)   VALUE   "263".
               05  FILLER              PIC X(03)   VALUE   "264".
      *
               05  FILLER              PIC X(03)   VALUE   "265".
               05  FILLER              PIC X(03)   VALUE   "266".
      *
               05  FILLER              PIC X(03)   VALUE   "267".
               05  FILLER              PIC X(03)   VALUE   "268".
      *
               05  FILLER              PIC X(03)   VALUE   "3BZ".
               05  FILLER              PIC X(03)   VALUE   "3C0".
      *
               05  FILLER              PIC X(03)   VALUE   "3C1".
               05  FILLER              PIC X(03)   VALUE   "3C2".
      *
               05  FILLER              PIC X(03)   VALUE   "3C3".
               05  FILLER              PIC X(03)   VALUE   "3C4".
      *
               05  FILLER              PIC X(03)   VALUE   "3C5".
               05  FILLER              PIC X(03)   VALUE   "3C6".
      *
               05  FILLER              PIC X(03)   VALUE   "3CF".
               05  FILLER              PIC X(03)   VALUE   "3CG".
      *
               05  FILLER              PIC X(03)   VALUE   "3CH".
               05  FILLER              PIC X(03)   VALUE   "3CI".
      *
               05  FILLER              PIC X(03)   VALUE   "269".
               05  FILLER              PIC X(03)   VALUE   "26A".
      *
               05  FILLER              PIC X(03)   VALUE   "26B".
               05  FILLER              PIC X(03)   VALUE   "26C".
      *
               05  FILLER              PIC X(03)   VALUE   "26D".
               05  FILLER              PIC X(03)   VALUE   "26E".
      *
               05  FILLER              PIC X(03)   VALUE   "26F".
               05  FILLER              PIC X(03)   VALUE   "26G".
      *
               05  FILLER              PIC X(03)   VALUE   "26H".
               05  FILLER              PIC X(03)   VALUE   "26I".
      *
               05  FILLER              PIC X(03)   VALUE   "26J".
               05  FILLER              PIC X(03)   VALUE   "26K".
      *
               05  FILLER              PIC X(03)   VALUE   "26L".
               05  FILLER              PIC X(03)   VALUE   "26M".
      *
               05  FILLER              PIC X(03)   VALUE   "26N".
               05  FILLER              PIC X(03)   VALUE   "26O".
      *
               05  FILLER              PIC X(03)   VALUE   "26T".
               05  FILLER              PIC X(03)   VALUE   "26U".
      *
               05  FILLER              PIC X(03)   VALUE   "3CS".
               05  FILLER              PIC X(03)   VALUE   "3CT".
      *
               05  FILLER              PIC X(03)   VALUE   "3CU".
               05  FILLER              PIC X(03)   VALUE   "3CV".
      *
               05  FILLER              PIC X(03)   VALUE   "3CW".
               05  FILLER              PIC X(03)   VALUE   "3CX".
      *
               05  FILLER              PIC X(03)   VALUE   "3CY".
               05  FILLER              PIC X(03)   VALUE   "3CZ".
      *
               05  FILLER              PIC X(03)   VALUE   "3D0".
               05  FILLER              PIC X(03)   VALUE   "3D1".
      *
               05  FILLER              PIC X(03)   VALUE   "3D2".
               05  FILLER              PIC X(03)   VALUE   "3D3".
      *
               05  FILLER              PIC X(03)   VALUE   "3D4".
               05  FILLER              PIC X(03)   VALUE   "3D5".
      *
               05  FILLER              PIC X(03)   VALUE   "3D6".
               05  FILLER              PIC X(03)   VALUE   "3D7".
      *
               05  FILLER              PIC X(03)   VALUE   "3D8".
               05  FILLER              PIC X(03)   VALUE   "3D9".
      *
               05  FILLER              PIC X(03)   VALUE   "3DA".
               05  FILLER              PIC X(03)   VALUE   "3DB".
      *
               05  FILLER              PIC X(03)   VALUE   "3DC".
               05  FILLER              PIC X(03)   VALUE   "3DD".
      *
               05  FILLER              PIC X(03)   VALUE   "3DE".
               05  FILLER              PIC X(03)   VALUE   "3DF".
      *
               05  FILLER              PIC X(03)   VALUE   "3DG".
               05  FILLER              PIC X(03)   VALUE   "3DH".
      *
               05  FILLER              PIC X(03)   VALUE   "3DI".
               05  FILLER              PIC X(03)   VALUE   "3DJ".
      *
               05  FILLER              PIC X(03)   VALUE   "3DK".
               05  FILLER              PIC X(03)   VALUE   "3DL".
      *
               05  FILLER              PIC X(03)   VALUE   "3DM".
               05  FILLER              PIC X(03)   VALUE   "3DN".
      *
               05  FILLER              PIC X(03)   VALUE   "3DO".
               05  FILLER              PIC X(03)   VALUE   "3DP".
      *
               05  FILLER              PIC X(03)   VALUE   "3DQ".
               05  FILLER              PIC X(03)   VALUE   "3DR".
      *
               05  FILLER              PIC X(03)   VALUE   "3DS".
               05  FILLER              PIC X(03)   VALUE   "3DT".
      *
               05  FILLER              PIC X(03)   VALUE   "3DU".
               05  FILLER              PIC X(03)   VALUE   "3DV".
      *
               05  FILLER              PIC X(03)   VALUE   "3DW".
               05  FILLER              PIC X(03)   VALUE   "3DX".
      *
               05  FILLER              PIC X(03)   VALUE   "3DY".
               05  FILLER              PIC X(03)   VALUE   "3DZ".
      *
               05  FILLER              PIC X(03)   VALUE   "3E0".
               05  FILLER              PIC X(03)   VALUE   "3E1".
      *
               05  FILLER              PIC X(03)   VALUE   "3E2".
               05  FILLER              PIC X(03)   VALUE   "3E3".
      *
               05  FILLER              PIC X(03)   VALUE   "3E4".
               05  FILLER              PIC X(03)   VALUE   "3E5".
      *
               05  FILLER              PIC X(03)   VALUE   "3E6".
               05  FILLER              PIC X(03)   VALUE   "3E7".
      *
               05  FILLER              PIC X(03)   VALUE   "3E8".
               05  FILLER              PIC X(03)   VALUE   "3E9".
      *
               05  FILLER              PIC X(03)   VALUE   "3EA".
               05  FILLER              PIC X(03)   VALUE   "3EB".
      *
               05  FILLER              PIC X(03)   VALUE   "3EC".
               05  FILLER              PIC X(03)   VALUE   "3ED".
      *
               05  FILLER              PIC X(03)   VALUE   "3EE".
               05  FILLER              PIC X(03)   VALUE   "3EF".
      *
               05  FILLER              PIC X(03)   VALUE   "3EG".
               05  FILLER              PIC X(03)   VALUE   "3EH".
      *
               05  FILLER              PIC X(03)   VALUE   "3EI".
               05  FILLER              PIC X(03)   VALUE   "3EJ".
      *
               05  FILLER              PIC X(03)   VALUE   "3EK".
               05  FILLER              PIC X(03)   VALUE   "3EL".
      *
               05  FILLER              PIC X(03)   VALUE   "3EM".
               05  FILLER              PIC X(03)   VALUE   "3EN".
      *
               05  FILLER              PIC X(03)   VALUE   "3EO".
               05  FILLER              PIC X(03)   VALUE   "3EP".
      *
               05  FILLER              PIC X(03)   VALUE   "3EQ".
               05  FILLER              PIC X(03)   VALUE   "3ER".
      *
               05  FILLER              PIC X(03)   VALUE   "3ES".
               05  FILLER              PIC X(03)   VALUE   "3ET".
      *
               05  FILLER              PIC X(03)   VALUE   "3EU".
               05  FILLER              PIC X(03)   VALUE   "3EV".
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡
               05  FILLER              PIC X(03)   VALUE   "26X".
               05  FILLER              PIC X(03)   VALUE   "26Y".
               05  FILLER              PIC X(03)   VALUE   "26Z".
               05  FILLER              PIC X(03)   VALUE   "270".
               05  FILLER              PIC X(03)   VALUE   "271".
               05  FILLER              PIC X(03)   VALUE   "272".
               05  FILLER              PIC X(03)   VALUE   "273".
               05  FILLER              PIC X(03)   VALUE   "274".
               05  FILLER              PIC X(03)   VALUE   "275".
               05  FILLER              PIC X(03)   VALUE   "276".
               05  FILLER              PIC X(03)   VALUE   "277".
               05  FILLER              PIC X(03)   VALUE   "278".
               05  FILLER              PIC X(03)   VALUE   "279".
               05  FILLER              PIC X(03)   VALUE   "27A".
               05  FILLER              PIC X(03)   VALUE   "27B".
               05  FILLER              PIC X(03)   VALUE   "27C".
               05  FILLER              PIC X(03)   VALUE   "27D".
               05  FILLER              PIC X(03)   VALUE   "27E".
               05  FILLER              PIC X(03)   VALUE   "27F".
               05  FILLER              PIC X(03)   VALUE   "27G".
               05  FILLER              PIC X(03)   VALUE   "27H".
               05  FILLER              PIC X(03)   VALUE   "27I".
               05  FILLER              PIC X(03)   VALUE   "27J".
               05  FILLER              PIC X(03)   VALUE   "27K".
               05  FILLER              PIC X(03)   VALUE   "27L".
               05  FILLER              PIC X(03)   VALUE   "27M".
               05  FILLER              PIC X(03)   VALUE   "27N".
               05  FILLER              PIC X(03)   VALUE   "27O".
               05  FILLER              PIC X(03)   VALUE   "27P".
               05  FILLER              PIC X(03)   VALUE   "27Q".
               05  FILLER              PIC X(03)   VALUE   "27R".
               05  FILLER              PIC X(03)   VALUE   "27S".
               05  FILLER              PIC X(03)   VALUE   "27T".
               05  FILLER              PIC X(03)   VALUE   "27U".
               05  FILLER              PIC X(03)   VALUE   "27V".
               05  FILLER              PIC X(03)   VALUE   "27W".
               05  FILLER              PIC X(03)   VALUE   "27X".
               05  FILLER              PIC X(03)   VALUE   "27Y".
               05  FILLER              PIC X(03)   VALUE   "27Z".
               05  FILLER              PIC X(03)   VALUE   "280".
               05  FILLER              PIC X(03)   VALUE   "281".
               05  FILLER              PIC X(03)   VALUE   "282".
               05  FILLER              PIC X(03)   VALUE   "283".
               05  FILLER              PIC X(03)   VALUE   "284".
               05  FILLER              PIC X(03)   VALUE   "285".
               05  FILLER              PIC X(03)   VALUE   "286".
               05  FILLER              PIC X(03)   VALUE   "287".
               05  FILLER              PIC X(03)   VALUE   "288".
               05  FILLER              PIC X(03)   VALUE   "289".
               05  FILLER              PIC X(03)   VALUE   "28A".
               05  FILLER              PIC X(03)   VALUE   "28B".
               05  FILLER              PIC X(03)   VALUE   "28C".
               05  FILLER              PIC X(03)   VALUE   "28D".
               05  FILLER              PIC X(03)   VALUE   "28E".
               05  FILLER              PIC X(03)   VALUE   "28F".
               05  FILLER              PIC X(03)   VALUE   "28G".
               05  FILLER              PIC X(03)   VALUE   "28H".
               05  FILLER              PIC X(03)   VALUE   "28I".
               05  FILLER              PIC X(03)   VALUE   "28J".
               05  FILLER              PIC X(03)   VALUE   "28K".
               05  FILLER              PIC X(03)   VALUE   "28L".
               05  FILLER              PIC X(03)   VALUE   "28M".
               05  FILLER              PIC X(03)   VALUE   "28N".
               05  FILLER              PIC X(03)   VALUE   "28O".
               05  FILLER              PIC X(03)   VALUE   "28P".
               05  FILLER              PIC X(03)   VALUE   "28Q".
               05  FILLER              PIC X(03)   VALUE   "28R".
               05  FILLER              PIC X(03)   VALUE   "28S".
               05  FILLER              PIC X(03)   VALUE   "28T".
               05  FILLER              PIC X(03)   VALUE   "28U".
               05  FILLER              PIC X(03)   VALUE   "28V".
               05  FILLER              PIC X(03)   VALUE   "28W".
      *        √œ∞Ë Ò≥Á∆˛±°∞ÂŒ≈¥…Õ˝Œ¡
               05  FILLER              PIC X(03)   VALUE   "3EW".
               05  FILLER              PIC X(03)   VALUE   "3EX".
               05  FILLER              PIC X(03)   VALUE   "3EY".
               05  FILLER              PIC X(03)   VALUE   "3EZ".
               05  FILLER              PIC X(03)   VALUE   "3F0".
               05  FILLER              PIC X(03)   VALUE   "3F1".
               05  FILLER              PIC X(03)   VALUE   "3F2".
               05  FILLER              PIC X(03)   VALUE   "3F3".
               05  FILLER              PIC X(03)   VALUE   "3F4".
               05  FILLER              PIC X(03)   VALUE   "3F5".
               05  FILLER              PIC X(03)   VALUE   "3F6".
               05  FILLER              PIC X(03)   VALUE   "3F7".
               05  FILLER              PIC X(03)   VALUE   "3F8".
               05  FILLER              PIC X(03)   VALUE   "3F9".
               05  FILLER              PIC X(03)   VALUE   "3FA".
               05  FILLER              PIC X(03)   VALUE   "3FB".
               05  FILLER              PIC X(03)   VALUE   "3FC".
               05  FILLER              PIC X(03)   VALUE   "3FD".
               05  FILLER              PIC X(03)   VALUE   "3FE".
               05  FILLER              PIC X(03)   VALUE   "3FF".
               05  FILLER              PIC X(03)   VALUE   "3FG".
               05  FILLER              PIC X(03)   VALUE   "3FH".
               05  FILLER              PIC X(03)   VALUE   "3FI".
               05  FILLER              PIC X(03)   VALUE   "3FJ".
               05  FILLER              PIC X(03)   VALUE   "3FK".
               05  FILLER              PIC X(03)   VALUE   "3FL".
               05  FILLER              PIC X(03)   VALUE   "3FM".
               05  FILLER              PIC X(03)   VALUE   "3FN".
               05  FILLER              PIC X(03)   VALUE   "3FO".
               05  FILLER              PIC X(03)   VALUE   "3FP".
               05  FILLER              PIC X(03)   VALUE   "3FQ".
               05  FILLER              PIC X(03)   VALUE   "3FR".
               05  FILLER              PIC X(03)   VALUE   "3FS".
               05  FILLER              PIC X(03)   VALUE   "3FT".
               05  FILLER              PIC X(03)   VALUE   "3FU".
               05  FILLER              PIC X(03)   VALUE   "3FV".
               05  FILLER              PIC X(03)   VALUE   "3FW".
               05  FILLER              PIC X(03)   VALUE   "3FX".
               05  FILLER              PIC X(03)   VALUE   "3FY".
               05  FILLER              PIC X(03)   VALUE   "3FZ".
      *        ≤Û…¸¥¸•Í•œ•”•Í•∆°º•∑•Á•Û∆˛±°∞ÂŒ≈¥…Õ˝Œ¡° Œ·œ¬£∂«Ø°À
               05  FILLER              PIC X(03)   VALUE   "3H5".
               05  FILLER              PIC X(03)   VALUE   "3H6".
      *        √ªºÍ£≥° Œ·œ¬£∂«Ø°À
               05  FILLER              PIC X(03)   VALUE   "3G5".
               05  FILLER              PIC X(03)   VALUE   "3G6".
      *
               05  FILLER              PIC X(03)   VALUE   "3G7".
               05  FILLER              PIC X(03)   VALUE   "3G8".
      *
               05  FILLER              PIC X(03)   VALUE   "3G9".
               05  FILLER              PIC X(03)   VALUE   "3GA".
      *
               05  FILLER              PIC X(03)   VALUE   "3GB".
               05  FILLER              PIC X(03)   VALUE   "3GC".
      *
               05  FILLER              PIC X(03)   VALUE   "3GD".
               05  FILLER              PIC X(03)   VALUE   "3GE".
      *
               05  FILLER              PIC X(03)   VALUE   "3GF".
               05  FILLER              PIC X(03)   VALUE   "3GG".
      *
               05  FILLER              PIC X(03)   VALUE   "3GH".
               05  FILLER              PIC X(03)   VALUE   "3GI".
      *
               05  FILLER              PIC X(03)   VALUE   "3GJ".
               05  FILLER              PIC X(03)   VALUE   "3GK".
      *
               05  FILLER              PIC X(03)   VALUE   "3GL".
               05  FILLER              PIC X(03)   VALUE   "3GM".
      *
               05  FILLER              PIC X(03)   VALUE   "3GN".
               05  FILLER              PIC X(03)   VALUE   "3GO".
      *
               05  FILLER              PIC X(03)   VALUE   "3GP".
               05  FILLER              PIC X(03)   VALUE   "3GQ".
      *
               05  FILLER              PIC X(03)   VALUE   "3GR".
               05  FILLER              PIC X(03)   VALUE   "3GS".
      *
               05  FILLER              PIC X(03)   VALUE   "3GT".
               05  FILLER              PIC X(03)   VALUE   "3GU".
      *
               05  FILLER              PIC X(03)   VALUE   "3GV".
               05  FILLER              PIC X(03)   VALUE   "3GW".
      *
               05  FILLER              PIC X(03)   VALUE   "3GX".
               05  FILLER              PIC X(03)   VALUE   "3GY".
      *
               05  FILLER              PIC X(03)   VALUE   "3GZ".
               05  FILLER              PIC X(03)   VALUE   "3H0".
      *
               05  FILLER              PIC X(03)   VALUE   "3H1".
               05  FILLER              PIC X(03)   VALUE   "3H2".
      *
               05  FILLER              PIC X(03)   VALUE   "3H3".
               05  FILLER              PIC X(03)   VALUE   "3H4".
      *
      *        Œ≈Õ‹…¬≈Ô∆˛±°Œ¡£±° Œ·œ¬£∂«Ø°À
               05  FILLER              PIC X(03)   VALUE   "3HA".
               05  FILLER              PIC X(03)   VALUE   "3I4".
      *
               05  FILLER              PIC X(03)   VALUE   "3HB".
               05  FILLER              PIC X(03)   VALUE   "3I5".
      *
               05  FILLER              PIC X(03)   VALUE   "3HC".
               05  FILLER              PIC X(03)   VALUE   "3I6".
      *
               05  FILLER              PIC X(03)   VALUE   "3HD".
               05  FILLER              PIC X(03)   VALUE   "3I7".
      *
               05  FILLER              PIC X(03)   VALUE   "3HE".
               05  FILLER              PIC X(03)   VALUE   "3I8".
      *
               05  FILLER              PIC X(03)   VALUE   "3HF".
               05  FILLER              PIC X(03)   VALUE   "3I9".
      *
               05  FILLER              PIC X(03)   VALUE   "3HG".
               05  FILLER              PIC X(03)   VALUE   "3IA".
      *
               05  FILLER              PIC X(03)   VALUE   "3HH".
               05  FILLER              PIC X(03)   VALUE   "3IB".
      *
               05  FILLER              PIC X(03)   VALUE   "3HI".
               05  FILLER              PIC X(03)   VALUE   "3IC".
      *
               05  FILLER              PIC X(03)   VALUE   "3HJ".
               05  FILLER              PIC X(03)   VALUE   "3ID".
      *
               05  FILLER              PIC X(03)   VALUE   "3HK".
               05  FILLER              PIC X(03)   VALUE   "3IE".
      *
               05  FILLER              PIC X(03)   VALUE   "3HL".
               05  FILLER              PIC X(03)   VALUE   "3IF".
      *
               05  FILLER              PIC X(03)   VALUE   "3HM".
               05  FILLER              PIC X(03)   VALUE   "3IG".
      *
               05  FILLER              PIC X(03)   VALUE   "3HN".
               05  FILLER              PIC X(03)   VALUE   "3IH".
      *
               05  FILLER              PIC X(03)   VALUE   "3HO".
               05  FILLER              PIC X(03)   VALUE   "3II".
      *
               05  FILLER              PIC X(03)   VALUE   "3HP".
               05  FILLER              PIC X(03)   VALUE   "3IJ".
      *
               05  FILLER              PIC X(03)   VALUE   "3HQ".
               05  FILLER              PIC X(03)   VALUE   "3IK".
      *
               05  FILLER              PIC X(03)   VALUE   "3HR".
               05  FILLER              PIC X(03)   VALUE   "3IL".
      *
               05  FILLER              PIC X(03)   VALUE   "3HS".
               05  FILLER              PIC X(03)   VALUE   "3IM".
      *
               05  FILLER              PIC X(03)   VALUE   "3HT".
               05  FILLER              PIC X(03)   VALUE   "3IN".
      *
               05  FILLER              PIC X(03)   VALUE   "3HU".
               05  FILLER              PIC X(03)   VALUE   "3IO".
      *
               05  FILLER              PIC X(03)   VALUE   "3HV".
               05  FILLER              PIC X(03)   VALUE   "3IP".
      *
               05  FILLER              PIC X(03)   VALUE   "3HW".
               05  FILLER              PIC X(03)   VALUE   "3IQ".
      *
               05  FILLER              PIC X(03)   VALUE   "3HX".
               05  FILLER              PIC X(03)   VALUE   "3IR".
      *
               05  FILLER              PIC X(03)   VALUE   "3HY".
               05  FILLER              PIC X(03)   VALUE   "3IS".
      *
               05  FILLER              PIC X(03)   VALUE   "3HZ".
               05  FILLER              PIC X(03)   VALUE   "3IT".
      *
               05  FILLER              PIC X(03)   VALUE   "3I0".
               05  FILLER              PIC X(03)   VALUE   "3IU".
      *
               05  FILLER              PIC X(03)   VALUE   "3I1".
               05  FILLER              PIC X(03)   VALUE   "3IV".
      *
               05  FILLER              PIC X(03)   VALUE   "3I2".
               05  FILLER              PIC X(03)   VALUE   "3IW".
      *
               05  FILLER              PIC X(03)   VALUE   "3I3".
               05  FILLER              PIC X(03)   VALUE   "3IX".
      *
      *        Œ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° Œ·œ¬£∂«Ø°À
               05  FILLER              PIC X(03)   VALUE   "3IY".
               05  FILLER              PIC X(03)   VALUE   "3JS".
      *
               05  FILLER              PIC X(03)   VALUE   "3IZ".
               05  FILLER              PIC X(03)   VALUE   "3JT".
      *
               05  FILLER              PIC X(03)   VALUE   "3J0".
               05  FILLER              PIC X(03)   VALUE   "3JU".
      *
               05  FILLER              PIC X(03)   VALUE   "3J1".
               05  FILLER              PIC X(03)   VALUE   "3JV".
      *
               05  FILLER              PIC X(03)   VALUE   "3J2".
               05  FILLER              PIC X(03)   VALUE   "3JW".
      *
               05  FILLER              PIC X(03)   VALUE   "3J3".
               05  FILLER              PIC X(03)   VALUE   "3JX".
      *
               05  FILLER              PIC X(03)   VALUE   "3J4".
               05  FILLER              PIC X(03)   VALUE   "3JY".
      *
               05  FILLER              PIC X(03)   VALUE   "3J5".
               05  FILLER              PIC X(03)   VALUE   "3JZ".
      *
               05  FILLER              PIC X(03)   VALUE   "3J6".
               05  FILLER              PIC X(03)   VALUE   "3K0".
      *
               05  FILLER              PIC X(03)   VALUE   "3J7".
               05  FILLER              PIC X(03)   VALUE   "3K1".
      *
               05  FILLER              PIC X(03)   VALUE   "3J8".
               05  FILLER              PIC X(03)   VALUE   "3K2".
      *
               05  FILLER              PIC X(03)   VALUE   "3J9".
               05  FILLER              PIC X(03)   VALUE   "3K3".
      *
               05  FILLER              PIC X(03)   VALUE   "3JA".
               05  FILLER              PIC X(03)   VALUE   "3K4".
      *
               05  FILLER              PIC X(03)   VALUE   "3JB".
               05  FILLER              PIC X(03)   VALUE   "3K5".
      *
               05  FILLER              PIC X(03)   VALUE   "3JC".
               05  FILLER              PIC X(03)   VALUE   "3K6".
      *
               05  FILLER              PIC X(03)   VALUE   "3JD".
               05  FILLER              PIC X(03)   VALUE   "3K7".
      *
               05  FILLER              PIC X(03)   VALUE   "3JE".
               05  FILLER              PIC X(03)   VALUE   "3K8".
      *
               05  FILLER              PIC X(03)   VALUE   "3JF".
               05  FILLER              PIC X(03)   VALUE   "3K9".
      *
               05  FILLER              PIC X(03)   VALUE   "3JG".
               05  FILLER              PIC X(03)   VALUE   "3KA".
      *
               05  FILLER              PIC X(03)   VALUE   "3JH".
               05  FILLER              PIC X(03)   VALUE   "3KB".
      *
               05  FILLER              PIC X(03)   VALUE   "3JI".
               05  FILLER              PIC X(03)   VALUE   "3KC".
      *
               05  FILLER              PIC X(03)   VALUE   "3JJ".
               05  FILLER              PIC X(03)   VALUE   "3KD".
      *
               05  FILLER              PIC X(03)   VALUE   "3JK".
               05  FILLER              PIC X(03)   VALUE   "3KE".
      *
               05  FILLER              PIC X(03)   VALUE   "3JL".
               05  FILLER              PIC X(03)   VALUE   "3KF".
      *
               05  FILLER              PIC X(03)   VALUE   "3JM".
               05  FILLER              PIC X(03)   VALUE   "3KG".
      *
               05  FILLER              PIC X(03)   VALUE   "3JN".
               05  FILLER              PIC X(03)   VALUE   "3KH".
      *
               05  FILLER              PIC X(03)   VALUE   "3JO".
               05  FILLER              PIC X(03)   VALUE   "3KI".
      *
               05  FILLER              PIC X(03)   VALUE   "3JP".
               05  FILLER              PIC X(03)   VALUE   "3KJ".
      *
               05  FILLER              PIC X(03)   VALUE   "3JQ".
               05  FILLER              PIC X(03)   VALUE   "3KK".
      *
               05  FILLER              PIC X(03)   VALUE   "3JR".
               05  FILLER              PIC X(03)   VALUE   "3KL".
      *        ∆√ƒÍµ°«Ω…¬±°•Í•œ•”•Í•∆°º•∑•Á•Û…¬≈Ô∆˛±°Œ¡° Œ·œ¬£¥«Ø°À
               05  FILLER              PIC X(03)   VALUE   "26W".
               05  FILLER              PIC X(03)   VALUE   "291".
      *
           03  CONST-TOK-LIFECD-R  REDEFINES   CONST-TOK-LIFECD-VAL.
               05  CONST-TOK-LIFECD-OCC    OCCURS   274.
                   07  CONST-TOK-LIFECD-IPN
                                           PIC X(03).
                   07  CONST-TOK-LIFECD-LIFE
                                           PIC X(03).
           03  CONST-TOK-LIFECD-MAX    PIC 9(05)   VALUE   274.
      *
       01  CONST-EXRYOYO-G.
           03  CONST-EXRYOYO-VAL.
               05  FILLER              PIC X(09)   VALUE "190204110".
               05  FILLER              PIC X(09)   VALUE "190204310".
               05  FILLER              PIC X(09)   VALUE "190204210".
               05  FILLER              PIC X(09)   VALUE "190204410".
           03  CONST-EXRYOYO-R         REDEFINES   CONST-EXRYOYO-VAL.
               05  CONST-EXRYOYO-OCC   OCCURS  2.
                   07  CONST-EXRYOYO-DEFINED       PIC X(09).
                   07  CONST-EXRYOYO-UNDEFINED     PIC X(09).
           03  CONST-EXRYOYO-MAX    PIC 9(05)      VALUE   2.
      *
