      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      ************************************************************
      *         Ã»´üÂÚºß¼ê½ÑÅù´ðËÜÎÁ£³                           *
      ************************************************************
      ************************************************************
      *  ¥³¥Ô¡¼¶ç½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      ************************************************************
       01  TANKI3-AREA.
           03  TANKI3-VAL.
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£±¡Ê·ÈÂÓÍÑÁõÃÖ¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "97".
               05  FILLER          PIC X(09)   VALUE "190177610".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£±¡Ê·ÈÂÓÍÑÁõÃÖ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "98".
               05  FILLER          PIC X(09)   VALUE "190177710".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£²¡ÊÂ¿ÅÀ´¶°µ¥»¥ó¥µ¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "99".
               05  FILLER          PIC X(09)   VALUE "190177810".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£²¡ÊÂ¿ÅÀ´¶°µ¥»¥ó¥µ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9A".
               05  FILLER          PIC X(09)   VALUE "190177910".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£³¡Ê£±µÚ¤Ó£²°Ê³°¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9B".
               05  FILLER          PIC X(09)   VALUE "190178010".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20200331".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£³¡Ê£±µÚ¤Ó£²°Ê³°¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9C".
               05  FILLER          PIC X(09)   VALUE "190178110".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20200331".
      *        Ã»¼ê£³¡Ê¾®»ù¿©Êª¥¢¥ì¥ë¥®¡¼Éé²Ù¸¡ºº¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9D".
               05  FILLER          PIC X(09)   VALUE "190178210".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¾®»ù¿©Êª¥¢¥ì¥ë¥®¡¼Éé²Ù¸¡ºº¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9E".
               05  FILLER          PIC X(09)   VALUE "190178310".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁ°Î©Á£¿ËÀ¸¸¡Ë¡¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9F".
               05  FILLER          PIC X(09)   VALUE "190178410".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁ°Î©Á£¿ËÀ¸¸¡Ë¡¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9G".
               05  FILLER          PIC X(09)   VALUE "190178510".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Êæþ½­¾É¼ê½Ñ¡ÊÈéÉæÍ­ÌÓÉôÀÚ½ü½Ñ¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9H".
               05  FILLER          PIC X(09)   VALUE "190178610".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Êæþ½­¾É¼ê½Ñ¡ÊÈéÉæÍ­ÌÓÉôÀÚ½ü½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9I".
               05  FILLER          PIC X(09)   VALUE "190178710".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê´ØÀá¶À²¼¼êº¬´É³«Êü¼ê½Ñ¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9J".
               05  FILLER          PIC X(09)   VALUE "190178810".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ØÀá¶À²¼¼êº¬´É³«Êü¼ê½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9K".
               05  FILLER          PIC X(09)   VALUE "190178910".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¶»¹Ð¶À²¼¸ò´¶¿À·ÐÀáÀÚ½ü½Ñ¡ÊÎ¾Â¦¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9L".
               05  FILLER          PIC X(09)   VALUE "190179010".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¶»¹Ð¶À²¼¸ò´¶¿À·ÐÀáÀÚ½ü½Ñ¡ÊÎ¾Â¦¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9M".
               05  FILLER          PIC X(09)   VALUE "190179110".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¤Î¤â¤Î¡Ë
      *        20140401-20160331
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦ÊÒÂ¦¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9N".
               05  FILLER          PIC X(09)   VALUE "190179210".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¤Î¤â¤Î¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë 
      *        20140401-20160331
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦ÊÒÂ¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë 
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9O".
               05  FILLER          PIC X(09)   VALUE "190179310".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦Î¾Â¦¡Ë 
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "AY".
               05  FILLER          PIC X(09)   VALUE "190195910".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥ºÁÞÆþ¡¦¤½¤ÎÂ¾¡¦Î¾Â¦¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë 
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "AZ".
               05  FILLER          PIC X(09)   VALUE "190196010".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦¿å¾½ÂÎÇ¹³ÈÄ¥¥ê¥ó¥°¡¦Ë¥Ãå¤Ê¤·¡Ë
      *        20140701-20160331
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "AW".
               05  FILLER          PIC X(09)   VALUE "190182750".
               05  FILLER          PIC X(08)   VALUE "20140701".
               05  FILLER          PIC X(08)   VALUE "20160331".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦¿å¾½ÂÎÇ¹³ÈÄ¥¥ê¥ó¥°¡¦Ë¥Ãå¤Ê¤·¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20140701-20160331
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "AX".
               05  FILLER          PIC X(09)   VALUE "190182850".
               05  FILLER          PIC X(08)   VALUE "20140701".
               05  FILLER          PIC X(08)   VALUE "20160331".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡Ê´ãÆâ¥ì¥ó¥ºÁÞÆþ¤·¤Ê¤¤¾ì¹ç¡Ë¡Ë  
      *        20140401-20160331
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡Ê´ãÆâ¥ì¥ó¥ºÁÞÆþ¤·¤Ê¤¤¡¦ÊÒÂ¦¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9P".
               05  FILLER          PIC X(09)   VALUE "190179410".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡Ê´ãÆâ¥ì¥ó¥ºÁÞÆþ¤·¤Ê¤¤¾ì¹ç¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë  
      *        20140401-20160331
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡Ê´ãÆâ¥ì¥ó¥ºÁÞÆþ¤·¤Ê¤¤¡¦ÊÒÂ¦¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9Q".
               05  FILLER          PIC X(09)   VALUE "190179510".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡Ê´ãÆâ¥ì¥ó¥ºÁÞÆþ¤·¤Ê¤¤¡¦Î¾Â¦¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "B0".
               05  FILLER          PIC X(09)   VALUE "190196110".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡Ê´ãÆâ¥ì¥ó¥ºÁÞÆþ¤·¤Ê¤¤¡¦Î¾Â¦¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "B1".
               05  FILLER          PIC X(09)   VALUE "190196210".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "20180331".
      *        Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¹·Â£µ£ã£íÌ¤Ëþ¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9R".
               05  FILLER          PIC X(09)   VALUE "190179610".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¹·Â£µ£ã£íÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9S".
               05  FILLER          PIC X(09)   VALUE "190179710".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "B2".
               05  FILLER          PIC X(09)   VALUE "190196310".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "20200331".
      *        Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "B3".
               05  FILLER          PIC X(09)   VALUE "190196410".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "20200331".
      *        Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡Ê½é²ó¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "CF".
               05  FILLER          PIC X(09)   VALUE "190220910".
               05  FILLER          PIC X(08)   VALUE "20200401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡Ê½é²ó¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "CG".
               05  FILLER          PIC X(09)   VALUE "190221010".
               05  FILLER          PIC X(08)   VALUE "20200401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡¦£³·î°ÊÆâ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "CH".
               05  FILLER          PIC X(09)   VALUE "190221110".
               05  FILLER          PIC X(08)   VALUE "20200401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê·ÐÈéÅª¥·¥ã¥ó¥È³ÈÄ¥½Ñ¡¦·ìÀò½üµî½Ñ¡¦£³·î°ÊÆâ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "CI".
               05  FILLER          PIC X(09)   VALUE "190221210".
               05  FILLER          PIC X(08)   VALUE "20200401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡ÊÈ´µîÀÚ½ü½Ñ¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9T".
               05  FILLER          PIC X(09)   VALUE "190179810".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡ÊÈ´µîÀÚ½ü½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9U".
               05  FILLER          PIC X(09)   VALUE "190179910".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9V".
               05  FILLER          PIC X(09)   VALUE "190180010".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9W".
               05  FILLER          PIC X(09)   VALUE "190180110".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹â°Ì·ëå§½Ñ¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9X".
               05  FILLER          PIC X(09)   VALUE "190180210".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî¼ê½Ñ¡Ê¹â°Ì·ëå§½Ñ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "9Y".
               05  FILLER          PIC X(09)   VALUE "190180310".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "B4".
               05  FILLER          PIC X(09)   VALUE "190196510".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "B5".
               05  FILLER          PIC X(09)   VALUE "190196810".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "B6".
               05  FILLER          PIC X(09)   VALUE "190196610".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "B7".
               05  FILLER          PIC X(09)   VALUE "190196910".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "B8".
               05  FILLER          PIC X(09)   VALUE "190196710".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "B9".
               05  FILLER          PIC X(09)   VALUE "190197010".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐÌ¤Ëþ¡Ë¡Ë
      *        20140401-20160331
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "9Z".
               05  FILLER          PIC X(09)   VALUE "190180410".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20160331".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20140401-20160331
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "A0".
               05  FILLER          PIC X(09)   VALUE "190180510".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20160331".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "A1".
               05  FILLER          PIC X(09)   VALUE "190180610".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "A2".
               05  FILLER          PIC X(09)   VALUE "190180710".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "BA".
               05  FILLER          PIC X(09)   VALUE "190197110".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "BB".
               05  FILLER          PIC X(09)   VALUE "190197410".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "BC".
               05  FILLER          PIC X(09)   VALUE "190197210".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£³ºÐ°Ê¾å£¶ºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "BD".
               05  FILLER          PIC X(09)   VALUE "190197510".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "BE".
               05  FILLER          PIC X(09)   VALUE "190197310".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£¶ºÐ°Ê¾å£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "BF".
               05  FILLER          PIC X(09)   VALUE "190197610".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐÌ¤Ëþ¡Ë¡Ë
      *        20140401-20160331
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "A3".
               05  FILLER          PIC X(09)   VALUE "190180810".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20160331".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐÌ¤Ëþ¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20140401-20160331
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "A4".
               05  FILLER          PIC X(09)   VALUE "190180910".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20160331".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "A5".
               05  FILLER          PIC X(09)   VALUE "190181010".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼ÁÍ·Â¥Ø¥ë¥Ë¥¢¼ê½Ñ¡Ê£±£µºÐ°Ê¾å¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "A6".
               05  FILLER          PIC X(09)   VALUE "190181110".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆâ»ë¶ÀÅª·ëÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£íÌ¤Ëþ¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "A7".
               05  FILLER          PIC X(09)   VALUE "190181210".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆâ»ë¶ÀÅª·ëÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£íÌ¤Ëþ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "A8".
               05  FILLER          PIC X(09)   VALUE "190181310".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆâ»ë¶ÀÅª·ëÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£í°Ê¾å¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "A9".
               05  FILLER          PIC X(09)   VALUE "190181410".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆâ»ë¶ÀÅª·ëÄ²¥Ý¥ê¡¼¥×¡¦Ç´ËìÀÚ½ü½Ñ£²£ã£í°Ê¾å¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "AA".
               05  FILLER          PIC X(09)   VALUE "190181510".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼¦³Ë¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ê»ÍÃÊ³¬Ãí¼ÍË¡¡Ë¡Ë¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "AB".
               05  FILLER          PIC X(09)   VALUE "190181610".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼¦³Ë¼ê½Ñ¡Ê¹Å²½ÎÅË¡¡Ê»ÍÃÊ³¬Ãí¼ÍË¡¡Ë¡Ë¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "AC".
               05  FILLER          PIC X(09)   VALUE "190181710".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÂÎ³°¾×·âÇÈ¿Õ¡¦Ç¢´É·ëÀÐÇËºÕ½Ñ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "BG".
               05  FILLER          PIC X(09)   VALUE "190197710".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÂÎ³°¾×·âÇÈ¿Õ¡¦Ç¢´É·ëÀÐÇËºÕ½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "BH".
               05  FILLER          PIC X(09)   VALUE "190197810".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜðôÉô¡ÊçµÉô¡ËÀÚ½ü½Ñ¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "AD".
               05  FILLER          PIC X(09)   VALUE "190181810".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜðôÉô¡ÊçµÉô¡ËÀÚ½ü½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "AE".
               05  FILLER          PIC X(09)   VALUE "190181910".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡Ë
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "AF".
               05  FILLER          PIC X(09)   VALUE "190182010".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20200331".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "AG".
               05  FILLER          PIC X(09)   VALUE "190182110".
               05  FILLER          PIC X(08)   VALUE "20140401".
               05  FILLER          PIC X(08)   VALUE "20200331".
      *        Ã»¼ê£³¡Ê¥¬¥ó¥Þ¥Ê¥¤¥Õ¤Ë¤è¤ëÄê°ÌÊü¼ÍÀþ¼£ÎÅ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "BI".
               05  FILLER          PIC X(09)   VALUE "190197910".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¥¬¥ó¥Þ¥Ê¥¤¥Õ¤Ë¤è¤ëÄê°ÌÊü¼ÍÀþ¼£ÎÅ¡Ë¡ÊÀ¸³èÎÅÍÜ¡Ë
      *        20160401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "BJ".
               05  FILLER          PIC X(09)   VALUE "190198010".
               05  FILLER          PIC X(08)   VALUE "20160401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼¡¦£±¡¢£²°Ê³°¡¦°ÂÁ´ÀºÅÙ´ÉÍý²¼¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "CS".
               05  FILLER          PIC X(09)   VALUE "190265610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£±¡¢£²°Ê³°¡¦°ÂÁ´ÀºÅÙ´ÉÍý²¼À¸³è
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "CT".
               05  FILLER          PIC X(09)   VALUE "190265710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼¡¦£±¡¢£²°Ê³°¡¦¤½¤ÎÂ¾¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "CU".
               05  FILLER          PIC X(09)   VALUE "190265810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê½ªÌë¿çÌ²¥Ý¥ê¥°¥é¥Õ¥£¡¼£±¡¢£²°Ê³°¡¦¤½¤ÎÂ¾¡¦À¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "CV".
               05  FILLER          PIC X(09)   VALUE "190265910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê£Í£Ó£Ì£Ô¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "CW".
               05  FILLER          PIC X(09)   VALUE "190266010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê£Í£Ó£Ì£Ô¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "CX".
               05  FILLER          PIC X(09)   VALUE "190266110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆâÊ¬ÈçÉé²Ù»î¸³¡¦²¼¿âÂÎÁ°ÍÕÉé²Ù»î¸³¡Ê£Ç£È¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "CY".
               05  FILLER          PIC X(09)   VALUE "190266210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆâÊ¬ÈçÉé²Ù»î¸³¡¦²¼¿âÂÎÁ°ÍÕÉé²Ù»î¸³¡Ê£Ç£È¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "CZ".
               05  FILLER          PIC X(09)   VALUE "190266310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê·ÐÈéÅªÊü¼ÍÀþ¼£ÎÅÍÑ¶âÂ°¥Þ¡¼¥«¡¼Î±ÃÖ½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "D0".
               05  FILLER          PIC X(09)   VALUE "190266410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê·ÐÈéÅªÊü¼ÍÀþ¼£ÎÅÍÑ¶âÂ°¥Þ¡¼¥«¡¼Î±ÃÖ½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "D1".
               05  FILLER          PIC X(09)   VALUE "190266510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»Í»è¡¦¶í´´ÆðÉô¼ðáçÅ¦½Ð½Ñ¡Ê¼ê¡Ë¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "D2".
               05  FILLER          PIC X(09)   VALUE "190266610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»Í»è¡¦¶í´´ÆðÉô¼ðáçÅ¦½Ð½Ñ¡Ê¼ê¡Ë¡Ë¡ÊÀ¸³è¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "D3".
               05  FILLER          PIC X(09)   VALUE "190266710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÀÞ´Ñ·ìÅª¼ê½Ñ¡Ê¼ê½®¾õ¹ü¡Ë¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "D4".
               05  FILLER          PIC X(09)   VALUE "190266810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÀÞ´Ñ·ìÅª¼ê½Ñ¡Ê¼ê½®¾õ¹ü¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "D5".
               05  FILLER          PIC X(09)   VALUE "190266910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡ÊÁ°ÏÓ¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "D6".
               05  FILLER          PIC X(09)   VALUE "190267010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡ÊÁ°ÏÓ¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "D7".
               05  FILLER          PIC X(09)   VALUE "190267110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡Êº¿¹ü¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "D8".
               05  FILLER          PIC X(09)   VALUE "190267210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡Êº¿¹ü¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "D9".
               05  FILLER          PIC X(09)   VALUE "190267310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡Ê¼ê¡Ë¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DA".
               05  FILLER          PIC X(09)   VALUE "190267410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹üÆâ°ÛÊª¡ÊÁÞÆþÊª¤ò´Þ¤à¡Ë½üµî½Ñ¡Ê¼ê¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DB".
               05  FILLER          PIC X(09)   VALUE "190267510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¥¬¥ó¥°¥ê¥ª¥óÅ¦½Ð½Ñ¡Ê¼ê¡Ë¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DC".
               05  FILLER          PIC X(09)   VALUE "190267610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¥¬¥ó¥°¥ê¥ª¥óÅ¦½Ð½Ñ¡Ê¼ê¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DD".
               05  FILLER          PIC X(09)   VALUE "190267710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÎÞ´É¥Á¥å¡¼¥ÖÁÞÆþ½Ñ¡ÊÎÞÆ»Æâ»ë¶À¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DE".
               05  FILLER          PIC X(09)   VALUE "190267810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÎÞ´É¥Á¥å¡¼¥ÖÁÞÆþ½Ñ¡ÊÎÞÆ»Æâ»ë¶À¡Ë¡Ë¡ÊÀ¸³è¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DF".
               05  FILLER          PIC X(09)   VALUE "190267910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ãâÛÆâÈ¿¾É¼ê½Ñ¡ÊÈéÉæÀÚ³«Ë¡¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DG".
               05  FILLER          PIC X(09)   VALUE "190268010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ãâÛÆâÈ¿¾É¼ê½Ñ¡ÊÈéÉæÀÚ³«Ë¡¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DH".
               05  FILLER          PIC X(09)   VALUE "190268110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ãâÛ²¼¿â¾É¼ê½Ñ¡Ê´ãâÛµó¶ÚÁ°Å¾Ë¡¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DI".
               05  FILLER          PIC X(09)   VALUE "190268210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ãâÛ²¼¿â¾É¼ê½Ñ¡Ê´ãâÛµó¶ÚÁ°Å¾Ë¡¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DJ".
               05  FILLER          PIC X(09)   VALUE "190268310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ãâÛ²¼¿â¾É¼ê½Ñ¡Ê¤½¤ÎÂ¾¤Î¤â¤Î¡Ë¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DK".
               05  FILLER          PIC X(09)   VALUE "190268410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê´ãâÛ²¼¿â¾É¼ê½Ñ¡Ê¤½¤ÎÂ¾¤Î¤â¤Î¡Ë¡Ë¡ÊÀ¸³è¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DL".
               05  FILLER          PIC X(09)   VALUE "190268510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÍã¾õÊÒ¼ê½Ñ¡ÊÊÛ¤Î°Ü¿¢¤òÍ×¤¹¤ë¤â¤Î¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DM".
               05  FILLER          PIC X(09)   VALUE "190268610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÍã¾õÊÒ¼ê½Ñ¡ÊÊÛ¤Î°Ü¿¢¤òÍ×¤¹¤ë¤â¤Î¡Ë¡Ë¡ÊÀ¸³è¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DN".
               05  FILLER          PIC X(09)   VALUE "190268710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼Ð»ë¼ê½Ñ¡Ê¸åÅ¾Ë¡¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DO".
               05  FILLER          PIC X(09)   VALUE "190268810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼Ð»ë¼ê½Ñ¡Ê¸åÅ¾Ë¡¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DP".
               05  FILLER          PIC X(09)   VALUE "190268910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼Ð»ë¼ê½Ñ¡ÊÁ°Å¾Ë¡µÚ¤Ó¸åÅ¾Ë¡¤ÎÊ»»Ü¡Ë¡Ë  
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DQ".
               05  FILLER          PIC X(09)   VALUE "190269010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼Ð»ë¼ê½Ñ¡ÊÁ°Å¾Ë¡µÚ¤Ó¸åÅ¾Ë¡¤ÎÊ»»Ü¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DR".
               05  FILLER          PIC X(09)   VALUE "190269110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼£ÎÅÅª³ÑËìÀÚ½ü½Ñ¡¦¥¨¥­¥·¥Þ¥ì¡¼¥¶¡¼¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DS".
               05  FILLER          PIC X(09)   VALUE "190269210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¼£ÎÅÅª³ÑËìÀÚ½ü½Ñ¡¦¥¨¥­¥·¥Þ¥ì¡¼¥¶¡¼¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DT".
               05  FILLER          PIC X(09)   VALUE "190269310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÎÐÆâ¾ã¼ê½Ñ¡¦¿å¾½ÂÎºÆ·ú½ÑÊ»ÍÑ´ãÆâ¥É¥ì¡¼¥óÁÞÆþ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DU".
               05  FILLER          PIC X(09)   VALUE "190269410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÎÐÆâ¾ã¼ê½Ñ¡¦¿å¾½ÂÎºÆ·ú½ÑÊ»ÍÑ´ãÆâ¥É¥ì¡¼¥óÁÞÆþ¡¦À¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DV".
               05  FILLER          PIC X(09)   VALUE "190269510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥º¤òÁÞÆþ¤·¤Ê¤¤¡¦ÊÒÂ¦¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DW".
               05  FILLER          PIC X(09)   VALUE "190269610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥º¤òÁÞÆþ¤·¤Ê¤¤¡¦ÊÒÂ¦¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DX".
               05  FILLER          PIC X(09)   VALUE "190269710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥º¤òÁÞÆþ¤·¤Ê¤¤¡¦Î¾Â¦¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "DY".
               05  FILLER          PIC X(09)   VALUE "190269810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¿å¾½ÂÎºÆ·ú½Ñ¡¦´ãÆâ¥ì¥ó¥º¤òÁÞÆþ¤·¤Ê¤¤¡¦Î¾Â¦¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "DZ".
               05  FILLER          PIC X(09)   VALUE "190269910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¸ÝËì·ÁÀ®¼ê½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "E0".
               05  FILLER          PIC X(09)   VALUE "190270010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¸ÝËì·ÁÀ®¼ê½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "E1".
               05  FILLER          PIC X(09)   VALUE "190270110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÉ¡¹ü¹üÀÞÀ°Éü¸ÇÄê½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "E2".
               05  FILLER          PIC X(09)   VALUE "190270210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÉ¡¹ü¹üÀÞÀ°Éü¸ÇÄê½Ñ¡Ë¡ÊÀ¸³è¡Ë  
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "E3".
               05  FILLER          PIC X(09)   VALUE "190270310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹¢Æ¬¡¦À¼ÂÓ¥Ý¥ê¡¼¥×ÀÚ½ü½Ñ¡ÊÄ¾Ã£¹¢Æ¬¶À¡¢¥Õ¥¡¥¤¥Ð¡¼¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "E4".
               05  FILLER          PIC X(09)   VALUE "190270410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¹¢Æ¬¡¦À¼ÂÓ¥Ý¥ê¡¼¥×ÀÚ½ü¡ÊÄ¾Ã£¹¢Æ¬¶À¡¢¥Õ¥¡¥¤¥Ð¡¼À¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "E5".
               05  FILLER          PIC X(09)   VALUE "190270510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¾·Â£µ£ã£í°Ê¾å¡Ë  
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "E6".
               05  FILLER          PIC X(09)   VALUE "190270610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÆýÁ£¼ðáçÅ¦½Ð½Ñ¡ÊÄ¾·Â£µ£ã£í°Ê¾å¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "E7".
               05  FILLER          PIC X(09)   VALUE "190270710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÂçÉúºßÀÅÌ®È´µî½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "E8".
               05  FILLER          PIC X(09)   VALUE "190270810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÂçÉúºßÀÅÌ®È´µî½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "E9".
               05  FILLER          PIC X(09)   VALUE "190270910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî·ì´ÉÆâ¾Æ¼Þ½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EA".
               05  FILLER          PIC X(09)   VALUE "190271010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî·ì´ÉÆâ¾Æ¼Þ½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EB".
               05  FILLER          PIC X(09)   VALUE "190271110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî·ì´ÉÆâºÉÀò½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EC".
               05  FILLER          PIC X(09)   VALUE "190271210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê²¼»èÀÅÌ®áî·ì´ÉÆâºÉÀò½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "ED".
               05  FILLER          PIC X(09)   VALUE "190271310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊæêÌç¥Ý¥ê¡¼¥×ÀÚ½ü½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EE".
               05  FILLER          PIC X(09)   VALUE "190271410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊæêÌç¥Ý¥ê¡¼¥×ÀÚ½ü½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EF".
               05  FILLER          PIC X(09)   VALUE "190271510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊæêÌçÀí·½¥³¥ó¥¸¥í¡¼¥àÀÚ½ü½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EG".
               05  FILLER          PIC X(09)   VALUE "190271610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊæêÌçÀí·½¥³¥ó¥¸¥í¡¼¥àÀÚ½ü½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EH".
               05  FILLER          PIC X(09)   VALUE "190271710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÇ¢¼º¶Ø¼ê½Ñ¡Ê¥Ü¥Ä¥ê¥Ì¥¹ÆÇÁÇ¤Ë¤è¤ë¤â¤Î¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EI".
               05  FILLER          PIC X(09)   VALUE "190271810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÇ¢¼º¶Ø¼ê½Ñ¡Ê¥Ü¥Ä¥ê¥Ì¥¹ÆÇÁÇ¤Ë¤è¤ë¤â¤Î¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EJ".
               05  FILLER          PIC X(09)   VALUE "190271910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¸²Èù¶À²¼Àºº÷ÀÅÌ®áî¼ê½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EK".
               05  FILLER          PIC X(09)   VALUE "190272010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê¸²Èù¶À²¼Àºº÷ÀÅÌ®áî¼ê½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EL".
               05  FILLER          PIC X(09)   VALUE "190272110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼Í­·ÔÇ´Ëì²¼¶Ú¼ðÀÚ½Ð¡¢¥Ý¥ê¡¼¥×¡¦ÅÅ²ò±Õ¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EM".
               05  FILLER          PIC X(09)   VALUE "190272210".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»Ã»¼ê£³¡Ê»ÒµÜ¶À²¼Í­·ÔÇ´Ëì²¼¶Ú¼ðÀÚ½Ð¡¢¥Ý¥ê¡¼¥×¡¦ÅÅ²ò±Õ¡¦À¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EN".
               05  FILLER          PIC X(09)   VALUE "190272310".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼Í­·ÔÇ´Ëì²¼¶Ú¼ðÀÚ½Ð¡¢¥Ý¥ê¡¼¥×¡¦¤½¤ÎÂ¾¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EO".
               05  FILLER          PIC X(09)   VALUE "190272410".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼Í­·ÔÇ´Ëì²¼¶Ú¼ðÀÚ½Ð¡¢¥Ý¥ê¡¼¥×¡¦¤½¤ÎÂ¾¡¦À¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EP".
               05  FILLER          PIC X(09)   VALUE "190272510".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡ÊÅÅ²ò¼ÁÍÏ±ÕÍøÍÑ¡Ë¡Ë 
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EQ".
               05  FILLER          PIC X(09)   VALUE "190272610".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡ÊÅÅ²ò¼ÁÍÏ±ÕÍøÍÑ¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "ER".
               05  FILLER          PIC X(09)   VALUE "190272710".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡Ê¤½¤ÎÂ¾¡Ë¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "ES".
               05  FILLER          PIC X(09)   VALUE "190272810".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡Ê»ÒµÜ¶À²¼»ÒµÜ¶Ú¼ðÅ¦½Ð½Ñ¡Ê¤½¤ÎÂ¾¡Ë¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "ET".
               05  FILLER          PIC X(09)   VALUE "190272910".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼Íñ´É·ÁÀ®½Ñ¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "0".
               05  FILLER          PIC X(02)   VALUE "EU".
               05  FILLER          PIC X(09)   VALUE "190273010".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
      *        Ã»¼ê£³¡ÊÊ¢¹Ð¶À²¼Íñ´É·ÁÀ®½Ñ¡Ë¡ÊÀ¸³è¡Ë
      *        20220401-99999999
               05  FILLER          PIC X(01)   VALUE "1".
               05  FILLER          PIC X(02)   VALUE "EV".
               05  FILLER          PIC X(09)   VALUE "190273110".
               05  FILLER          PIC X(08)   VALUE "20220401".
               05  FILLER          PIC X(08)   VALUE "99999999".
           03  TANKI3-R  REDEFINES TANKI3-VAL.
               05  TANKI3-OCC      OCCURS      150.
                   07  TANKI3-LIFEKBN          PIC X(01).
                   07  TANKI3-TOKCD            PIC X(02).
                   07  TANKI3-TANKICD          PIC X(09).
                   07  TANKI3-YUKOSTYMD        PIC X(08).
                   07  TANKI3-YUKOEDYMD        PIC X(08).
       01  TANKI3-MAX                          PIC 9(03)   VALUE 150.
