      ********************************************************************
      * Project code name "ORCA"
      * ∆¸∞Â…∏Ω‡•Ï•ª•◊•»•Ω•’•»° JMA standard receipt software°À
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *   ∆√ƒÍ∆˛±°Œ¡•≥°º•…            (CPTOKSRYCD.INC)
      ********************************************************************
      *  •≥•‘°º∂ÁΩ§¿µÕ˙ŒÚ
      * Maj/Min/Rev  Ω§¿µº‘       ∆¸…’      ∆‚Õ∆
      ********************************************************************
       01  CONST-TOKSRYCD-AREA.
           03  CONST-TOKSRYCD-G.
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡£±           
               05  FILLER          PIC X(09)   VALUE   "190209110".
               05  FILLER          PIC X(09)   VALUE   "190838910".
               05  FILLER          PIC X(09)   VALUE   "190839110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209210".
               05  FILLER          PIC X(09)   VALUE   "190839010".
               05  FILLER          PIC X(09)   VALUE   "190839210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209310".
               05  FILLER          PIC X(09)   VALUE   "190839310".
               05  FILLER          PIC X(09)   VALUE   "190839510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209410".
               05  FILLER          PIC X(09)   VALUE   "190839410".
               05  FILLER          PIC X(09)   VALUE   "190839610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209510".
               05  FILLER          PIC X(09)   VALUE   "190839710".
               05  FILLER          PIC X(09)   VALUE   "190839910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209610".
               05  FILLER          PIC X(09)   VALUE   "190839810".
               05  FILLER          PIC X(09)   VALUE   "190840010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209710".
               05  FILLER          PIC X(09)   VALUE   "190840110".
               05  FILLER          PIC X(09)   VALUE   "190840310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209810".
               05  FILLER          PIC X(09)   VALUE   "190840210".
               05  FILLER          PIC X(09)   VALUE   "190840410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190209910".
               05  FILLER          PIC X(09)   VALUE   "190840510".
               05  FILLER          PIC X(09)   VALUE   "190840710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210010".
               05  FILLER          PIC X(09)   VALUE   "190840610".
               05  FILLER          PIC X(09)   VALUE   "190840810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210110".
               05  FILLER          PIC X(09)   VALUE   "190840910".
               05  FILLER          PIC X(09)   VALUE   "190841110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210210".
               05  FILLER          PIC X(09)   VALUE   "190841010".
               05  FILLER          PIC X(09)   VALUE   "190841210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210310".
               05  FILLER          PIC X(09)   VALUE   "190841310".
               05  FILLER          PIC X(09)   VALUE   "190841510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210410".
               05  FILLER          PIC X(09)   VALUE   "190841410".
               05  FILLER          PIC X(09)   VALUE   "190841610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210510".
               05  FILLER          PIC X(09)   VALUE   "190841710".
               05  FILLER          PIC X(09)   VALUE   "190841910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210610".
               05  FILLER          PIC X(09)   VALUE   "190841810".
               05  FILLER          PIC X(09)   VALUE   "190842010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡£±° Œ≈Õ‹…¬æ≤°À
               05  FILLER          PIC X(09)   VALUE   "190249710".
               05  FILLER          PIC X(09)   VALUE   "190842110".
               05  FILLER          PIC X(09)   VALUE   "190842310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190249810".
               05  FILLER          PIC X(09)   VALUE   "190842210".
               05  FILLER          PIC X(09)   VALUE   "190842410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190249910".
               05  FILLER          PIC X(09)   VALUE   "190842510".
               05  FILLER          PIC X(09)   VALUE   "190842710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250010".
               05  FILLER          PIC X(09)   VALUE   "190842610".
               05  FILLER          PIC X(09)   VALUE   "190842810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250110".
               05  FILLER          PIC X(09)   VALUE   "190842910".
               05  FILLER          PIC X(09)   VALUE   "190843110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250210".
               05  FILLER          PIC X(09)   VALUE   "190843010".
               05  FILLER          PIC X(09)   VALUE   "190843210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250310".
               05  FILLER          PIC X(09)   VALUE   "190843310".
               05  FILLER          PIC X(09)   VALUE   "190843510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250410".
               05  FILLER          PIC X(09)   VALUE   "190843410".
               05  FILLER          PIC X(09)   VALUE   "190843610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250510".
               05  FILLER          PIC X(09)   VALUE   "190843710".
               05  FILLER          PIC X(09)   VALUE   "190843910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250610".
               05  FILLER          PIC X(09)   VALUE   "190843810".
               05  FILLER          PIC X(09)   VALUE   "190844010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250710".
               05  FILLER          PIC X(09)   VALUE   "190844110".
               05  FILLER          PIC X(09)   VALUE   "190844310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250810".
               05  FILLER          PIC X(09)   VALUE   "190844210".
               05  FILLER          PIC X(09)   VALUE   "190844410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190250910".
               05  FILLER          PIC X(09)   VALUE   "190844510".
               05  FILLER          PIC X(09)   VALUE   "190844710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251010".
               05  FILLER          PIC X(09)   VALUE   "190844610".
               05  FILLER          PIC X(09)   VALUE   "190844810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251110".
               05  FILLER          PIC X(09)   VALUE   "190844910".
               05  FILLER          PIC X(09)   VALUE   "190845110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251210".
               05  FILLER          PIC X(09)   VALUE   "190845010".
               05  FILLER          PIC X(09)   VALUE   "190845210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251310".
               05  FILLER          PIC X(09)   VALUE   "190845310".
               05  FILLER          PIC X(09)   VALUE   "190845510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251410".
               05  FILLER          PIC X(09)   VALUE   "190845410".
               05  FILLER          PIC X(09)   VALUE   "190845610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251510".
               05  FILLER          PIC X(09)   VALUE   "190845710".
               05  FILLER          PIC X(09)   VALUE   "190845910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251610".
               05  FILLER          PIC X(09)   VALUE   "190845810".
               05  FILLER          PIC X(09)   VALUE   "190846010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251710".
               05  FILLER          PIC X(09)   VALUE   "190846110".
               05  FILLER          PIC X(09)   VALUE   "190846310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251810".
               05  FILLER          PIC X(09)   VALUE   "190846210".
               05  FILLER          PIC X(09)   VALUE   "190846410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190251910".
               05  FILLER          PIC X(09)   VALUE   "190846510".
               05  FILLER          PIC X(09)   VALUE   "190846710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252010".
               05  FILLER          PIC X(09)   VALUE   "190846610".
               05  FILLER          PIC X(09)   VALUE   "190846810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252110".
               05  FILLER          PIC X(09)   VALUE   "190846910".
               05  FILLER          PIC X(09)   VALUE   "190847110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252210".
               05  FILLER          PIC X(09)   VALUE   "190847010".
               05  FILLER          PIC X(09)   VALUE   "190847210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252310".
               05  FILLER          PIC X(09)   VALUE   "190847310".
               05  FILLER          PIC X(09)   VALUE   "190847510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252410".
               05  FILLER          PIC X(09)   VALUE   "190847410".
               05  FILLER          PIC X(09)   VALUE   "190847610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252510".
               05  FILLER          PIC X(09)   VALUE   "190847710".
               05  FILLER          PIC X(09)   VALUE   "190847910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252610".
               05  FILLER          PIC X(09)   VALUE   "190847810".
               05  FILLER          PIC X(09)   VALUE   "190848010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252710".
               05  FILLER          PIC X(09)   VALUE   "190848110".
               05  FILLER          PIC X(09)   VALUE   "190848310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252810".
               05  FILLER          PIC X(09)   VALUE   "190848210".
               05  FILLER          PIC X(09)   VALUE   "190848410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190252910".
               05  FILLER          PIC X(09)   VALUE   "190848510".
               05  FILLER          PIC X(09)   VALUE   "190848710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253010".
               05  FILLER          PIC X(09)   VALUE   "190848610".
               05  FILLER          PIC X(09)   VALUE   "190848810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253110".
               05  FILLER          PIC X(09)   VALUE   "190848910".
               05  FILLER          PIC X(09)   VALUE   "190849110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253210".
               05  FILLER          PIC X(09)   VALUE   "190849010".
               05  FILLER          PIC X(09)   VALUE   "190849210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253310".
               05  FILLER          PIC X(09)   VALUE   "190849310".
               05  FILLER          PIC X(09)   VALUE   "190849510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253410".
               05  FILLER          PIC X(09)   VALUE   "190849410".
               05  FILLER          PIC X(09)   VALUE   "190849610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253510".
               05  FILLER          PIC X(09)   VALUE   "190849710".
               05  FILLER          PIC X(09)   VALUE   "190849910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253610".
               05  FILLER          PIC X(09)   VALUE   "190849810".
               05  FILLER          PIC X(09)   VALUE   "190850010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253710".
               05  FILLER          PIC X(09)   VALUE   "190850110".
               05  FILLER          PIC X(09)   VALUE   "190850310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253810".
               05  FILLER          PIC X(09)   VALUE   "190850210".
               05  FILLER          PIC X(09)   VALUE   "190850410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190253910".
               05  FILLER          PIC X(09)   VALUE   "190850510".
               05  FILLER          PIC X(09)   VALUE   "190850710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254010".
               05  FILLER          PIC X(09)   VALUE   "190850610".
               05  FILLER          PIC X(09)   VALUE   "190850810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254110".
               05  FILLER          PIC X(09)   VALUE   "190850910".
               05  FILLER          PIC X(09)   VALUE   "190851110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254210".
               05  FILLER          PIC X(09)   VALUE   "190851010".
               05  FILLER          PIC X(09)   VALUE   "190851210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254310".
               05  FILLER          PIC X(09)   VALUE   "190851310".
               05  FILLER          PIC X(09)   VALUE   "190851510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254410".
               05  FILLER          PIC X(09)   VALUE   "190851410".
               05  FILLER          PIC X(09)   VALUE   "190851610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254510".
               05  FILLER          PIC X(09)   VALUE   "190851710".
               05  FILLER          PIC X(09)   VALUE   "190851910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254610".
               05  FILLER          PIC X(09)   VALUE   "190851810".
               05  FILLER          PIC X(09)   VALUE   "190852010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254710".
               05  FILLER          PIC X(09)   VALUE   "190852110".
               05  FILLER          PIC X(09)   VALUE   "190852310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254810".
               05  FILLER          PIC X(09)   VALUE   "190852210".
               05  FILLER          PIC X(09)   VALUE   "190852410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190254910".
               05  FILLER          PIC X(09)   VALUE   "190852510".
               05  FILLER          PIC X(09)   VALUE   "190852710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255010".
               05  FILLER          PIC X(09)   VALUE   "190852610".
               05  FILLER          PIC X(09)   VALUE   "190852810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255110".
               05  FILLER          PIC X(09)   VALUE   "190852910".
               05  FILLER          PIC X(09)   VALUE   "190853110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255210".
               05  FILLER          PIC X(09)   VALUE   "190853010".
               05  FILLER          PIC X(09)   VALUE   "190853210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255310".
               05  FILLER          PIC X(09)   VALUE   "190853310".
               05  FILLER          PIC X(09)   VALUE   "190853510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255410".
               05  FILLER          PIC X(09)   VALUE   "190853410".
               05  FILLER          PIC X(09)   VALUE   "190853610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255510".
               05  FILLER          PIC X(09)   VALUE   "190853710".
               05  FILLER          PIC X(09)   VALUE   "190853910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255610".
               05  FILLER          PIC X(09)   VALUE   "190853810".
               05  FILLER          PIC X(09)   VALUE   "190854010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255710".
               05  FILLER          PIC X(09)   VALUE   "190854110".
               05  FILLER          PIC X(09)   VALUE   "190854310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255810".
               05  FILLER          PIC X(09)   VALUE   "190854210".
               05  FILLER          PIC X(09)   VALUE   "190854410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190255910".
               05  FILLER          PIC X(09)   VALUE   "190854510".
               05  FILLER          PIC X(09)   VALUE   "190854710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256010".
               05  FILLER          PIC X(09)   VALUE   "190854610".
               05  FILLER          PIC X(09)   VALUE   "190854810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡£±° ∆√ƒÍ√œ∞Ë°À
               05  FILLER          PIC X(09)   VALUE   "190210710".
               05  FILLER          PIC X(09)   VALUE   "190854910".
               05  FILLER          PIC X(09)   VALUE   "190855110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210810".
               05  FILLER          PIC X(09)   VALUE   "190855010".
               05  FILLER          PIC X(09)   VALUE   "190855210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190210910".
               05  FILLER          PIC X(09)   VALUE   "190855310".
               05  FILLER          PIC X(09)   VALUE   "190855510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211010".
               05  FILLER          PIC X(09)   VALUE   "190855410".
               05  FILLER          PIC X(09)   VALUE   "190855610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211110".
               05  FILLER          PIC X(09)   VALUE   "190855710".
               05  FILLER          PIC X(09)   VALUE   "190855910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211210".
               05  FILLER          PIC X(09)   VALUE   "190855810".
               05  FILLER          PIC X(09)   VALUE   "190856010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211310".
               05  FILLER          PIC X(09)   VALUE   "190856110".
               05  FILLER          PIC X(09)   VALUE   "190856310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211410".
               05  FILLER          PIC X(09)   VALUE   "190856210".
               05  FILLER          PIC X(09)   VALUE   "190856410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211510".
               05  FILLER          PIC X(09)   VALUE   "190856510".
               05  FILLER          PIC X(09)   VALUE   "190856710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211610".
               05  FILLER          PIC X(09)   VALUE   "190856610".
               05  FILLER          PIC X(09)   VALUE   "190856810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211710".
               05  FILLER          PIC X(09)   VALUE   "190856910".
               05  FILLER          PIC X(09)   VALUE   "190857110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211810".
               05  FILLER          PIC X(09)   VALUE   "190857010".
               05  FILLER          PIC X(09)   VALUE   "190857210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190211910".
               05  FILLER          PIC X(09)   VALUE   "190857310".
               05  FILLER          PIC X(09)   VALUE   "190857510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190212010".
               05  FILLER          PIC X(09)   VALUE   "190857410".
               05  FILLER          PIC X(09)   VALUE   "190857610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190212110".
               05  FILLER          PIC X(09)   VALUE   "190857710".
               05  FILLER          PIC X(09)   VALUE   "190857910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190212210".
               05  FILLER          PIC X(09)   VALUE   "190857810".
               05  FILLER          PIC X(09)   VALUE   "190858010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡£≤° √Ì£π°À
               05  FILLER          PIC X(09)   VALUE   "190256110".
               05  FILLER          PIC X(09)   VALUE   "190858810".
               05  FILLER          PIC X(09)   VALUE   "190859010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256210".
               05  FILLER          PIC X(09)   VALUE   "190858910".
               05  FILLER          PIC X(09)   VALUE   "190859110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256310".
               05  FILLER          PIC X(09)   VALUE   "190859210".
               05  FILLER          PIC X(09)   VALUE   "190859410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256410".
               05  FILLER          PIC X(09)   VALUE   "190859310".
               05  FILLER          PIC X(09)   VALUE   "190859510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256510".
               05  FILLER          PIC X(09)   VALUE   "190859610".
               05  FILLER          PIC X(09)   VALUE   "190859810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256610".
               05  FILLER          PIC X(09)   VALUE   "190859710".
               05  FILLER          PIC X(09)   VALUE   "190859910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256710".
               05  FILLER          PIC X(09)   VALUE   "190860010".
               05  FILLER          PIC X(09)   VALUE   "190860210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256810".
               05  FILLER          PIC X(09)   VALUE   "190860110".
               05  FILLER          PIC X(09)   VALUE   "190860310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190256910".
               05  FILLER          PIC X(09)   VALUE   "190860410".
               05  FILLER          PIC X(09)   VALUE   "190860610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257010".
               05  FILLER          PIC X(09)   VALUE   "190860510".
               05  FILLER          PIC X(09)   VALUE   "190860710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257110".
               05  FILLER          PIC X(09)   VALUE   "190860810".
               05  FILLER          PIC X(09)   VALUE   "190861010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257210".
               05  FILLER          PIC X(09)   VALUE   "190860910".
               05  FILLER          PIC X(09)   VALUE   "190861110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257310".
               05  FILLER          PIC X(09)   VALUE   "190861210".
               05  FILLER          PIC X(09)   VALUE   "190861410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257410".
               05  FILLER          PIC X(09)   VALUE   "190861310".
               05  FILLER          PIC X(09)   VALUE   "190861510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257510".
               05  FILLER          PIC X(09)   VALUE   "190861610".
               05  FILLER          PIC X(09)   VALUE   "190861810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257610".
               05  FILLER          PIC X(09)   VALUE   "190861710".
               05  FILLER          PIC X(09)   VALUE   "190861910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257710".
               05  FILLER          PIC X(09)   VALUE   "190862010".
               05  FILLER          PIC X(09)   VALUE   "190862210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257810".
               05  FILLER          PIC X(09)   VALUE   "190862110".
               05  FILLER          PIC X(09)   VALUE   "190862310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190257910".
               05  FILLER          PIC X(09)   VALUE   "190862410".
               05  FILLER          PIC X(09)   VALUE   "190862610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258010".
               05  FILLER          PIC X(09)   VALUE   "190862510".
               05  FILLER          PIC X(09)   VALUE   "190862710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258110".
               05  FILLER          PIC X(09)   VALUE   "190862810".
               05  FILLER          PIC X(09)   VALUE   "190863010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258210".
               05  FILLER          PIC X(09)   VALUE   "190862910".
               05  FILLER          PIC X(09)   VALUE   "190863110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258310".
               05  FILLER          PIC X(09)   VALUE   "190863210".
               05  FILLER          PIC X(09)   VALUE   "190863410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258410".
               05  FILLER          PIC X(09)   VALUE   "190863310".
               05  FILLER          PIC X(09)   VALUE   "190863510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258510".
               05  FILLER          PIC X(09)   VALUE   "190863610".
               05  FILLER          PIC X(09)   VALUE   "190863810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258610".
               05  FILLER          PIC X(09)   VALUE   "190863710".
               05  FILLER          PIC X(09)   VALUE   "190863910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258710".
               05  FILLER          PIC X(09)   VALUE   "190864010".
               05  FILLER          PIC X(09)   VALUE   "190864210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190258810".
               05  FILLER          PIC X(09)   VALUE   "190864110".
               05  FILLER          PIC X(09)   VALUE   "190864310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡£≤° √Ì£±£±°À
               05  FILLER          PIC X(09)   VALUE   "190258910".
               05  FILLER          PIC X(09)   VALUE   "190864410".
               05  FILLER          PIC X(09)   VALUE   "190864610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259010".
               05  FILLER          PIC X(09)   VALUE   "190864510".
               05  FILLER          PIC X(09)   VALUE   "190864710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259110".
               05  FILLER          PIC X(09)   VALUE   "190864810".
               05  FILLER          PIC X(09)   VALUE   "190865010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259210".
               05  FILLER          PIC X(09)   VALUE   "190864910".
               05  FILLER          PIC X(09)   VALUE   "190865110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259310".
               05  FILLER          PIC X(09)   VALUE   "190865210".
               05  FILLER          PIC X(09)   VALUE   "190865410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259410".
               05  FILLER          PIC X(09)   VALUE   "190865310".
               05  FILLER          PIC X(09)   VALUE   "190865510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259510".
               05  FILLER          PIC X(09)   VALUE   "190865610".
               05  FILLER          PIC X(09)   VALUE   "190865810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259610".
               05  FILLER          PIC X(09)   VALUE   "190865710".
               05  FILLER          PIC X(09)   VALUE   "190865910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259710".
               05  FILLER          PIC X(09)   VALUE   "190866010".
               05  FILLER          PIC X(09)   VALUE   "190866210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259810".
               05  FILLER          PIC X(09)   VALUE   "190866110".
               05  FILLER          PIC X(09)   VALUE   "190866310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190259910".
               05  FILLER          PIC X(09)   VALUE   "190866410".
               05  FILLER          PIC X(09)   VALUE   "190866610".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260010".
               05  FILLER          PIC X(09)   VALUE   "190866510".
               05  FILLER          PIC X(09)   VALUE   "190866710".
               05  FILLER          PIC X(27)   VALUE   SPACE.
      *        √œ∞Ë Ò≥Á•±•¢…¬≈Ô∆˛±°Œ¡£±° √Ì£±£≤°À
               05  FILLER          PIC X(09)   VALUE   "190260110".
               05  FILLER          PIC X(09)   VALUE   "190866810".
               05  FILLER          PIC X(09)   VALUE   "190867010".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260210".
               05  FILLER          PIC X(09)   VALUE   "190866910".
               05  FILLER          PIC X(09)   VALUE   "190867110".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260310".
               05  FILLER          PIC X(09)   VALUE   "190867210".
               05  FILLER          PIC X(09)   VALUE   "190867410".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260410".
               05  FILLER          PIC X(09)   VALUE   "190867310".
               05  FILLER          PIC X(09)   VALUE   "190867510".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260510".
               05  FILLER          PIC X(09)   VALUE   "190867610".
               05  FILLER          PIC X(09)   VALUE   "190867810".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260610".
               05  FILLER          PIC X(09)   VALUE   "190867710".
               05  FILLER          PIC X(09)   VALUE   "190867910".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260710".
               05  FILLER          PIC X(09)   VALUE   "190868010".
               05  FILLER          PIC X(09)   VALUE   "190868210".
               05  FILLER          PIC X(27)   VALUE   SPACE.
               05  FILLER          PIC X(09)   VALUE   "190260810".
               05  FILLER          PIC X(09)   VALUE   "190868110".
               05  FILLER          PIC X(09)   VALUE   "190868310".
               05  FILLER          PIC X(27)   VALUE   SPACE.
      *         
           03  CONST-TOKSRYCD-R    REDEFINES   CONST-TOKSRYCD-G.
      *        1:20260601     
               05  CONST-TOKSRYCD-OCC          OCCURS  1.
                   07  CONST-TOKSRYCD-OCC1     OCCURS  144.
                       09  CONST-TOKSRYCD-OLD
                                   PIC X(09).
                       09  CONST-TOKSRYCD-NEW-OCC      OCCURS  5.
                           11  CONST-TOKSRYCD-NEW
                                   PIC X(09).
      *
           03  CONST-TOKSRYCD-MAX  PIC 9(03)   VALUE   144.
      *
