      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
       IDENTIFICATION          DIVISION.
       PROGRAM-ID.             ORCR1240.
      *****************************************************************
      *  システム名        : ＯＲＣＡ
      *  サブシステム名    : レセプト
      *  コンポーネント名  : 公害レセプト（入院）
      *                      レセプトコメント編集
      *  管理者            : 
      *  作成日付    作業者        記述
      *  07/11/16    NACL−藤原    新規作成
      *****************************************************************
      *  プログラム修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      *  05.00.01    NACL-門脇    19/04/03  自動記載コメント改元対応
      *  05.00.02    NACL-門脇    19/05/16  退院時共同指導料２コメント自動
      *                                     記載対応
      *  05.00.03    NACL-門脇    19/06/24  リハビリ発症日レセプト記載対応
      *                                     （機能追加）
      *  05.00.04    NACL-門脇    19/08/01  リハビリ発症日レセプト記載対応
      *                                     （機能追加）修正
      *  05.00.05    NACL-門脇    20/03/30  令和２年４月改正対応
      *  05.00.06    NACL-門脇    20/05/07  令和２年４月改正対応
      *                                     画像診断コメント対応
      *  05.00.07    NACL-門脇    20/06/03  画像診断コメント対応修正
      *  05.00.08    NACL-門脇    20/06/05  画像診断コメント対応修正
      *  05.00.09    NACL-門脇    20/07/01  選択式コメント対応（自動記載）
      *  05.00.10    NACL-門脇    20/09/03  選択式コメント対応（自動記載）
      *  05.00.11    NACL-門脇    20/10/09  選択式コメント対応（自動記載）
      *  05.00.12    ORCAMO       21/08/12  【包括診療】画像診断の
      *                                     選択式コメント編集修正
      *  05.01.00    ORCAMO       22/01/06  在宅持続陽圧呼吸療法指導管
      *                                     理料対応
      *  05.01.01    ORCAMO       22/01/27  特別訪問看護指示加算対応
      *  05.01.02    ORCAMO       22/03/31  令和４年４月改正対応
      *  05.01.03    ORCAMO       22/05/11  新たな選択式コメント対応
      *                                     （４桁目が"6"）
      *  05.01.04    ORCAMO       22/05/17  新たな部位コメント追加
      *  05.01.05    ORCAMO       22/06/21  廃用症候群リハの初期加算の
      *                                     疾患名コメントコード変更対応
      *  05.01.06    ORCAMO       22/11/09  （検選）等のコメント編集修正
      *  05.02.01    ORCAMO       23/05/01  令和５年５月改正対応
      *  05.02.02    ORCAMO       24/06/13  令和６年６月改正対応
      *****************************************************************
      *
       ENVIRONMENT             DIVISION.
       CONFIGURATION               SECTION.
       INPUT-OUTPUT                SECTION.
       FILE-CONTROL.
      *
      *
           SELECT  RECE200-FILE    ASSIGN  RECE200PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE200-KEY
                                   FILE    STATUS  IS  STS-RECE200.
      *
           SELECT  RECE220-FILE    ASSIGN  RECE220PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  SEQUENTIAL
                                   RECORD  KEY     IS  RECE220-KEY
                                   FILE    STATUS  IS  STS-RECE220.
      *
           SELECT  RECE230-FILE    ASSIGN  RECE230PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  SEQUENTIAL
                                   RECORD  KEY     IS  RECE230-KEY
                                   FILE    STATUS  IS  STS-RECE230.
      *    （ＯＵＴ）
           SELECT  RECE2201-FILE   ASSIGN  RECE2201PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE2201-KEY
                                   FILE    STATUS  IS  STS-RECE2201.
      *
           SELECT  RECE2301-FILE   ASSIGN  RECE2301PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE2301-KEY
                                   FILE    STATUS  IS  STS-RECE2301.
      *    （ワーク）
           SELECT  RECE2209-FILE   ASSIGN  RECE2209PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE2209-KEY
                                   FILE    STATUS  IS  STS-RECE2209.
      *
           SELECT  RECE2309-FILE   ASSIGN  RECE2309PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE2309-KEY
                                   FILE    STATUS  IS  STS-RECE2309.
      *    エラーファイル
           SELECT  RECEERR-FILE    ASSIGN  RECEERR
                                   FILE    STATUS  IS  STS-RECEERR.
      *
       DATA                    DIVISION.
       FILE                    SECTION.
      *
       FD  RECE200-FILE.
       01  RECE200-REC.
           COPY    "CPRCF200.INC".
      *
       FD  RECE220-FILE.
       01  RECE220-REC.
           COPY    "CPRCF220.INC".
      *
       FD  RECE230-FILE.
       01  RECE230-REC.
           COPY    "CPRCF230.INC".
      *
       FD  RECE2201-FILE.
       01  RECE2201-REC. 
           COPY    "CPRCF220.INC"  REPLACING   //RECE220//
                                   BY          //RECE2201//.
      *
       FD  RECE2301-FILE.
       01  RECE2301-REC. 
           COPY    "CPRCF230.INC"  REPLACING   //RECE230//
                                   BY          //RECE2301//.
      *ワーク
       FD  RECE2209-FILE.
       01  RECE2209-REC. 
           COPY    "CPRCF220.INC"  REPLACING   //RECE220//
                                   BY          //RECE2209//.
      *
       FD  RECE2309-FILE.
       01  RECE2309-REC. 
           COPY    "CPRCF230.INC"  REPLACING   //RECE230//
                                   BY          //RECE2309//.
      *
      *    エラーファイル
       FD  RECEERR-FILE.
       01  RECEERR-REC             PIC X(200). 
      *
       WORKING-STORAGE             SECTION.
      *
      *    レセプト明細ファイル名称
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE200//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE220//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE230//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE2201//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE2301//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE2209//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE2309//.
      *
      *    エラーファイル名称領域
           COPY    "CPERRFL.INC"   REPLACING  //ERRFLPARA//
                                   BY         //RECEERR//.
      *
      *    ファイル名称領域
           COPY    "CPRECEDAT1.INC".
           COPY    "CPTEMPFL.INC".
      *
      *    フラグ領域
       01  STS-AREA.
           03  STS-RECE200         PIC X(02).
           03  STS-RECE220         PIC X(02).
           03  STS-RECE230         PIC X(02).
           03  STS-RECE2201        PIC X(02).
           03  STS-RECE2301        PIC X(02).
           03  STS-RECE2209        PIC X(02).
           03  STS-RECE2309        PIC X(02).
           03  STS-RECEERR         PIC X(02).
      *
      *    フラグ領域
       01  FLG-AREA.
           03  FLG-END             PIC 9(01).
           03  FLG-RECE200         PIC 9(01).
           03  FLG-RECE220         PIC 9(01).
           03  FLG-RECE2209        PIC 9(01).
           03  FLG-RECE2201        PIC 9(01).
           03  FLG-RECE230         PIC 9(01).
           03  FLG-RECE2309        PIC 9(01).
           03  FLG-RECE2301        PIC 9(01).
           03  FLG-YAKUKAN-COMMENT PIC 9(01).
           03  FLG-HINKAI-COMMENT  PIC 9(01).
           03  FLG-KYUSEI-COMMENT  PIC 9(01).
           03  FLG-KYUSEI-COMMENT2 PIC 9(01).
           03  FLG-COMMENT         PIC 9(02).
           03  FLG-WRKRECE230      PIC 9(01).
           03  FLG-FIRST           PIC 9(01).
           03  FLG-NYU-RENZOKU     PIC 9(01).
           03  FLG-SRYACT          PIC 9(01).
           03  FLG-SANTEI          PIC 9(01).
           03  FLG-KYUSEI-OK       PIC 9(01).
           03  FLG-PTCOM           PIC 9(01).
           03  FLG-SYSKANRI        PIC 9(01).
           03  FLG-RIHA            PIC 9(01).
           03  FLG-TENSU           PIC 9(01).
           03  FLG-RYOCOM          PIC 9(01).
           03  FLG-RYOCOM2         PIC 9(01).
           03  FLG-ARI             PIC 9(01).
           03  FLG-COMOKIKAE       PIC 9(01).
           03  FLG-COMOKIKAE2      PIC 9(01).
           03  FLG-HENSYUKIN       PIC 9(01).
           03  FLG-HANTEI          PIC 9(01).
           03  FLG-COMARI          PIC 9(01).
           03  FLG-COMARI2         PIC 9(01).
           03  FLG-SANTEIPLUS      PIC 9(01).
           03  FLG-KAISIEN         PIC 9(01).
           03  FLG-PTNYUINRRK      PIC 9(01).
           03  FLG-NG              PIC 9(01).
           03  FLG-SANTEIPLUS-HANTEI
                                   PIC 9(01).
           03  FLG-KAISYOKU-COMMENT
                                   PIC 9(01).
           03  FLG-OK              PIC 9(01).
           03  FLG-OK2             PIC 9(01).
           03  FLG-SINPESUR-COMMENT
                                   PIC 9(01).
           03  FLG-SINPESUR-COMMENT2
                                   PIC 9(01).
           03  FLG-ZAIKYO-COMMENT  PIC 9(01).
           03  FLG-CHECK-MAE       PIC 9(01).
           03  FLG-CHECK-ATO       PIC 9(01).
           03  FLG-RETRY           PIC 9(01).
           03  FLG-ZAIKYO-OK       PIC 9(01).
           03  FLG-ZAIKYOCOMARI    PIC 9(01).
           03  FLG-CYOJKSN-OK      PIC 9(01).
           03  FLG-CYOJKSNCOMARI   PIC 9(01).
           03  FLG-CYOJKSN         PIC 9(01).
           03  FLG-GET             PIC 9(01).
           03  FLG-RKISAI          PIC 9(01).
           03  FLG-ETC             PIC 9(01).
           03  FLG-SENTAKU-OKIKAE  PIC 9(01).
           03  FLG-JINNAI-COMMENT  PIC 9(01).
           03  FLG-GAZO            PIC 9(01).
           03  FLG-SENTAKU-SYUGI   PIC 9(01).
           03  FLG-YOUATU-COMMENT  PIC 9(01).
           03  FLG-COM-HENSYU      PIC 9(01).
           03  FLG-COM-HENSYU2     PIC 9(01).
           03  FLG-KOUYAK-COMMENT  PIC 9(01).
           03  FLG-TEJHOU-COMMENT  PIC 9(01).
      *
      *    カウント領域
       01  CNT-AREA.
           03  CNT-RECE200         PIC 9(06).
           03  CNT-RECE220         PIC 9(06).
           03  CNT-RECE230         PIC 9(06).
           03  CNT-RECE2209        PIC 9(06).
           03  CNT-RECE2309        PIC 9(06).
           03  CNT-RECE220-RE      PIC 9(06).
           03  CNT-RECE230-RE      PIC 9(06).
           03  CNT-RIHA            PIC 9(06).
           03  CNT-IN-COMMIT       PIC 9(06).
           03  CNT-IN-CANCEL       PIC 9(06).
           03  CNT-KENSA           PIC 9(06).
      *
      *    添字領域
       01  IDX-AREA.
           03  IDX                 PIC 9(04).
           03  IDX1                PIC 9(04).
           03  IDX2                PIC 9(04).
           03  IDX3                PIC 9(02).
           03  IDX4                PIC 9(04).
           03  IDX5                PIC 9(04).
           03  IDX6                PIC 9(04).
           03  IDX12               PIC 9(04).
           03  IDX13               PIC 9(04).
           03  IDX14               PIC 9(04).
           03  IDX15               PIC 9(01).
           03  IDX16               PIC 9(02).
           03  IDX17               PIC 9(02).
           03  IDX18               PIC 9(02).
           03  IDX26               PIC 9(02).
           03  IDX27               PIC 9(02).
           03  IDX28               PIC 9(02).
           03  IDX29               PIC 9(02).
           03  IDX30               PIC 9(02).
           03  IDX41               PIC 9(02).
           03  IDX42               PIC 9(02).
           03  IDX43               PIC 9(02).
           03  IDX44               PIC 9(02).
           03  IDX45               PIC 9(03).
           03  IDX46               PIC 9(03).
           03  IDX48               PIC 9(02).
           03  IDX49               PIC 9(02).
           03  IDX50               PIC 9(02).
           03  IDX51               PIC 9(03).
           03  IDX52               PIC 9(03).
           03  IDX53               PIC 9(03).
           03  DAY-IDX             PIC 9(04).
           03  DAY-IDX2            PIC 9(02).
           03  DAY-IDX4            PIC 9(03).
           03  IDY                 PIC 9(04).
           03  IDY2                PIC 9(04).
           03  IDY11               PIC 9(03).
           03  IDY12               PIC 9(03).
           03  IDY13               PIC 9(03).
           03  IDZ                 PIC 9(04).
           03  IDX-RECE230         PIC 9(04).
           03  IDV                 PIC 9(04).
           03  IDV2                PIC 9(04).
           03  IDV3                PIC 9(04).
           03  IDW                 PIC 9(04).
           03  RYO-IDX             PIC 9(03).
           03  RYO-IDX2            PIC 9(03).
           03  RYO-IDX3            PIC 9(03).
           03  IDA                 PIC 9(04).
           03  IDB                 PIC 9(04).
           03  IDC1                PIC 9(02).
           03  IDC2                PIC 9(02).
           03  IDC3                PIC 9(02).
           03  IDC4                PIC 9(02).
           03  RIHA-IDX            PIC 9(02).
           03  RIHA-IDX2           PIC 9(02).
           03  RIHA-ST             PIC 9(02).
           03  RIHA-ST2            PIC 9(02).
           03  RIHA-ED             PIC 9(02).
           03  RIHA-ED2            PIC 9(02).
           03  IDX-JIDO            PIC 9(04).
      *
      *    一時領域
       01  WRK-AREA.
           03  WRK-PARA.
               05  WRK-PARA-SRYYM  PIC X(06).
               05  WRK-PARA-TERMID PIC X(16).
               05  WRK-PARA-SYSYMD PIC X(08).
               05  WRK-PARA-JOBID  PIC 9(07).
               05  WRK-PARA-SHELLID
                                   PIC X(08).
           03  WRK-PARA-HOSPNUM    PIC 9(02).
      *
           03  WRK-JYUNBAN         PIC 9(04).
           03  WRK-GYOSUU          PIC 9(04).
           03  WRK-GYOSUU2         PIC 9(04).
           03  WRK-RENNUM          PIC 9(02).
           03  WRK-CNT-MEISAI      PIC 9(04).
           03  WRK-KETA            PIC 9(04).
           03  WRK-KETA-TAIHI      PIC 9(04).
           03  WRK-KETA2           PIC 9(04).
           03  WRK-RECEERR         PIC X(200).
      *
           03  WRK-FSANTEIYMD      PIC 9(08).
           03  WRK-AFTER2          PIC 9(08).
           03  WRK-AFTER180        PIC 9(08).
           03  WRK-TOSEKIYMD       PIC 9(08).
           03  WRK-KYUSEIYMD       PIC 9(08).
           03  WRK-HINKAIYMD       PIC 9(08).
           03  WRK-DAY             PIC 9(02).
      *
           03  WRK-SRYKBN          PIC X(02).
           03  WRK-SRYCD           PIC X(09).
           03  WRK-SRYCD2          PIC X(09).
           03  WRK-ZAINUM          PIC 9(08).
      *
           03  WRK-HENSYU-KAISU    PIC X(02).
           03  WRK-HENSYU-KAISU2   PIC X(04).
           03  WRK-HENSYU-KAISU3   PIC X(03).
           03  WRK-HENSYU-KAISU4   PIC X(06).
      *
           03  TBL-SANTEI-DAY.
               05  TB-SANTEI-DAY   PIC 9(02)   OCCURS  31.
      *
      *    該当診療月分
           03  TBL-RIHASANTEI-DAY.
               05  TB-RIHASANTEI-DAY PIC 9(01) OCCURS  31.
      *
           03  TBL-RIHASANTEI-DAY-END.
               05  TB-RIHASANTEI-DAY-END
                                     PIC 9(01) OCCURS  31.
           03  TBL-RIHASANTEI-DAY-END2.
               05  TB-RIHASANTEI-DAY-END2
                                     PIC 9(01) OCCURS  31.
           03  TBL-RIHASANTEI-DAY-END3.
               05  TB-RIHASANTEI-DAY-END3
                                     PIC 9(01) OCCURS  31.
      *
      *    直近分
           03  WRK-RIHASANTEI-YMD    PIC X(08).
      *
      *    直近分退避用
           03  WRK-RIHASANTEI-YMD2   PIC X(08).
           03  WRK-RIHASANTEI-YMD3   PIC X(08).
      *
      *    前月以前の直近終了日
           03  WRK-RIHASANTEI-END    PIC X(08).
      *
      *    ２００６年４月１日に算定日があるか
           03  WRK-RIHASANTEI41-FLG  PIC 9(01).
      *
      *    リハビリ開始日指定チェック用
           03  WRK-CHECK-RIHASANTEI-AREA.
               05  WRK-CHECK-RIHASANTEI-YMD     PIC X(08).
               05  WRK-CHECK-RIHASANTEI-YMD3    PIC X(08).
               05  WRK-CHECK-RIHASANTEI-DAY-OCC.
                 07  WRK-CHECK-RIHASANTEI-DAY   PIC 9(01)  OCCURS  31.
      *
           03  TBL-NYU-DAY.
               05  TBL-NYU-DAY-OCC             OCCURS  31.
                 07  TBL-NYU-DAY-ST  PIC 9(02).
                 07  TBL-NYU-DAY-ED  PIC 9(02).
                 07  TBL-NYU-DAY-CD  PIC X(09).
      *
           03  WRK-ZENYYMM           PIC 9(06).
      *
           03  WRK-TUKI-YAKUKAN      PIC 9(02).
           03  WRK-DAY-YAKUKAN       PIC 9(02).
      *
           03  WRK-KEISAN            PIC 9(09).
           03  WRK-KEISAN2           PIC 9(03).
           03  WRK-KEISAN3           PIC 9(09).
           03  WRK-KEISAN4           PIC 9(09).
           03  WRK-KEISAN-TAIHI      PIC X(09).
      *
           03  WRK-KYUSEI-NYUGAIKBN  PIC X(01).
           03  WRK-KYUSEI-SRYKA      PIC X(02).
           03  WRK-KYUSEI-ZAINUM     PIC 9(08).
      *
           03  WRK-ZAIKYO-NYUGAIKBN  PIC X(01).
           03  WRK-ZAIKYO-SRYKA      PIC X(02).
           03  WRK-ZAIKYO-ZAINUM     PIC 9(08).
      *
           03  WRK-CYOJKSN-INPUTCOMENT
                                     PIC X(140).
           03  WRK-CYOJKSN-NAME      PIC X(140).
           03  WRK-CYOJKSN-INPUTCOMENT2
                                     PIC X(140).
           03  WRK-CYOJKSN-NAME2     PIC X(140).
      *
           03  WRK-HENYMD            PIC X(08).
           03  WRK-TAIHI-XX          PIC X(02).
      *
           03  WRK-HENSYU-KINGAKU    PIC X(09).
           03  WRK-HENSYU-KINGAKU2   PIC X(18).
           03  WRK-HENSYU-KINGAKU3   PIC X(18).
      *
           03  WRK-RIHAIGAKU-SRYCD           PIC X(09).
           03  WRK-RIHAIGAKU-SRYCD2          PIC X(09).
           03  WRK-RIHAIGAKU-FSANTEIYMD      PIC X(08).
           03  WRK-RIHAIGAKU-SANTEI-AREA.
               05  WRK-RIHAIGAKU-SANTEI-FLG  PIC X(01).
               05  WRK-RIHAIGAKU-SANTEI-DAY  PIC 9(03)
                                             OCCURS 31.
      *
           03  WRK-YAKUKAN-SRYCD     PIC X(09).
      *
           03  WRK-KAISIEN-FSANTEIYMD        PIC X(08).
           03  WRK-KAISIEN-YMD               PIC X(08).
           03  WRK-KAISIEN-CHECKYMD          PIC X(08).
           03  WRK-KAISIEN-RRKNUM            PIC 9(03).
           03  WRK-KAISIEN-RRKNUM-X          PIC 9(03).
           03  WRK-KAISIEN-RRKNUM-Y          PIC 9(03).
      *
           03  WRK-KAISYOKU-YMD              PIC X(08).
      *
           03  WRK-SINPESUR-YMD              PIC X(08).
           03  WRK-SINPESUR-YMD2             PIC X(08).
           03  WRK-ZAIKYO-YMD                PIC X(08).
           03  WRK-ZAIKYO-YMD2               PIC X(08).
           03  WRK-CYOJKSN-YMD               PIC X(08).
           03  WRK-HAIJRT-YMD                PIC X(08).
      *
           03  WRK-GANSIDO-YMD-AREA.
               05  WRK-GANSIDO-YMD           PIC X(08)
                                             OCCURS 10.
           03  WRK-GANSIDO-DATA              PIC X(08).
      *
           03  WRK-BOKOHO-YMD2-AREA.
               05  WRK-BOKOHO-YMD2           PIC X(08)
                                             OCCURS 30.
      *
           03  WRK-ZAIKYO-YMD9               PIC X(08).
           03  WRK-ZAIKYO-KAISU              PIC 9(02).
           03  WRK-HAIJRT-KAISU              PIC 9(02).
      *
           03  WRK-CYOJKSN-TAIHIYM           PIC X(06).
           03  WRK-CYOJKSN-TAIHIDD           PIC X(02).
      *
           03  WRK-CYOJKSN-YMD-XXX              PIC X(08).
           03  WRK-CYOJKSN-COM-XXX              PIC X(140).
           03  WRK-CYOJKSN-COM2-XXX             PIC X(140).
           03  WRK-CYOJKSN-YMD-YYY              PIC X(08).
           03  WRK-CYOJKSN-COM-YYY              PIC X(140).
           03  WRK-CYOJKSN-COM2-YYY             PIC X(140).
           03  WRK-CYOJKSN-KAISHIDAY-XXX-AREA.
             04  WRK-CYOJKSN-KAISHIDAY-XXX-OCC  OCCURS  2.
               05  WRK-CYOJKSN-KAISHIDAY-XXX    PIC X(08).
               05  WRK-CYOJKSN-INPUTCOMENT-XXX  PIC X(140).
               05  WRK-CYOJKSN-NAME-XXX         PIC X(140).
           03  WRK-CYOJKSN-KAISHIDAY-YYY-AREA.
             04  WRK-CYOJKSN-KAISHIDAY-YYY-OCC  OCCURS  2.
               05  WRK-CYOJKSN-KAISHIDAY-YYY    PIC X(08).
               05  WRK-CYOJKSN-INPUTCOMENT-YYY  PIC X(140).
               05  WRK-CYOJKSN-NAME-YYY         PIC X(140).
      *
           03  WRK-SRYACCT-PATHNAME             PIC X(64).
      *
           03  WRK-ZAIHANKO-FSANTEIYMD          PIC X(08).
      *
           03  WRK-CHECK-SRYCD                  PIC X(09).
           03  WRK-TENSU-SRYCD                  PIC X(09).
           03  WRK-TENSU-SRYYM                  PIC X(06).
      *
           03  WRK-SJIYMD                       PIC X(08).
      *
           03  WRK-MCP-TABLE                    PIC X(64).
           03  WRK-MCP-PATHNAME                 PIC X(64).
      *
           03  WRK-JINNAI-YMD                   PIC X(08).
      *
           03  WRK-HAIJSK-FSANTEIYM             PIC X(08).
           03  WRK-HAIJSK-KAISU                 PIC 9(02).
      *
           03  WRK-RCW-KBN                      PIC X(01).
           03  WRK-RCW-SRYCD                    PIC X(09).
           03  WRK-RCW-SRYYMD                   PIC X(08).
      *
           03  WRK-YOUATU-FSANTEIYMD            PIC X(08).
      *
           03  WRK-KOUYAK-FSANTEIYMD            PIC X(08).
      *
           03  WRK-TEJHOU-YMD                   PIC X(08).
      *
       01  WK-RECE220-REC. 
           COPY    "CPRCF220.INC"  REPLACING   //RECE220//
                                   BY          //WK-RECE220//.
      *
       01  WRK-RECE230-REC. 
           COPY    "CPRCF230.INC"  REPLACING   //RECE230//
                                   BY          //WRK-RECE230//.
      *
       01  WRK-RECE230XX-REC.
         02 WRK-RECE230XX-TBL       OCCURS 100.
           COPY    "CPRCF230.INC"  REPLACING   //RECE230//
                                   BY          //WRK-RECE230XX//.
      *
       01  WRK-RECE230XX2-REC.
         02 WRK-RECE230XX2-TBL      OCCURS 300.
           COPY    "CPRCF230.INC"  REPLACING   //RECE230//
                                   BY          //WRK-RECE230XX2//.
      *
       01  WRK-RECE230ZZ-REC.
         02 WRK-RECE230ZZ-TBL       OCCURS 100.
           COPY    "CPRCF230.INC"  REPLACING   //RECE230//
                                   BY          //WRK-RECE230ZZ//.
      *
       01  WRK-FREE-AREA.
           03  WRK-FREEINF                     OCCURS 49.         
               05  WK-FREE-YUKOKETA          PIC  9(03).
               05  WK-FREE-NAME              PIC  X(300).
      *
       01  WRK-FREE-AREA2.                                              
           03  WRK-FREEINF2                    OCCURS 50.               
               05  WK-FREE-SRYCD2            PIC  X(09).
               05  WK-FREE-YUKOKETA2         PIC  9(03).                
               05  WK-FREE-NAME2             PIC  X(300).               
               05  WK-FREE-INPUTCOMENT2      PIC  X(140).
      *
       01  WRK-FREE-AREA3.                                              
           03  WRK-FREEINF3.
               05  WK-FREE-NAME3             PIC  X(1000).              
               05  WK-FREE-NAME3-TAIHI       PIC  X(1000).              
      *
       01  WRK-JIDO-SETCOM-AREA.
           03  WRK-JIDO-SETCOMFLG            PIC  X(01).
      *
       01  WRK-RECECOM-AREA.                                              
           03  WRK-RECECOM-KBN               PIC  X(01).
           03  WRK-RECECOM-SRYCD             PIC  X(09).
           03  WRK-RECECOM-YMD               PIC  X(08).
           03  WRK-RECECOM-COMMENT           PIC  X(100).
           03  WRK-RECECOM-NUM               PIC  S9(05)V9(06).
           03  WRK-RECECOM-SRYYMD            PIC  X(08).
      *
      *    日付全角変換領域
       01  TBL-DAY-AREA.
           03  FILLER              PIC X(04)  VALUE "　１".
           03  FILLER              PIC X(04)  VALUE "　２".
           03  FILLER              PIC X(04)  VALUE "　３".
           03  FILLER              PIC X(04)  VALUE "　４".
           03  FILLER              PIC X(04)  VALUE "　５".
           03  FILLER              PIC X(04)  VALUE "　６".
           03  FILLER              PIC X(04)  VALUE "　７".
           03  FILLER              PIC X(04)  VALUE "　８".
           03  FILLER              PIC X(04)  VALUE "　９".
           03  FILLER              PIC X(04)  VALUE "１０".
           03  FILLER              PIC X(04)  VALUE "１１".
           03  FILLER              PIC X(04)  VALUE "１２".
           03  FILLER              PIC X(04)  VALUE "１３".
           03  FILLER              PIC X(04)  VALUE "１４".
           03  FILLER              PIC X(04)  VALUE "１５".
           03  FILLER              PIC X(04)  VALUE "１６".
           03  FILLER              PIC X(04)  VALUE "１７".
           03  FILLER              PIC X(04)  VALUE "１８".
           03  FILLER              PIC X(04)  VALUE "１９".
           03  FILLER              PIC X(04)  VALUE "２０".
           03  FILLER              PIC X(04)  VALUE "２１".
           03  FILLER              PIC X(04)  VALUE "２２".
           03  FILLER              PIC X(04)  VALUE "２３".
           03  FILLER              PIC X(04)  VALUE "２４".
           03  FILLER              PIC X(04)  VALUE "２５".
           03  FILLER              PIC X(04)  VALUE "２６".
           03  FILLER              PIC X(04)  VALUE "２７".
           03  FILLER              PIC X(04)  VALUE "２８".
           03  FILLER              PIC X(04)  VALUE "２９".
           03  FILLER              PIC X(04)  VALUE "３０".
           03  FILLER              PIC X(04)  VALUE "３１".
       01  TBL-DAY-AREA-R          REDEFINES   TBL-DAY-AREA.
           03  TBL-DAY             PIC X(04)   OCCURS   31.
      *
       01  MAX-MEISAISU            PIC 9(07).
      *
      *    固定値
       01  CONST-AREA.
      *    薬剤管理指導料
           03  CONS-YAKUKAN-COMMENT PIC X(09)  VALUE "120001610".
      *    算定日コメント
           03  CONS-SANTEI-COMMENT1  PIC X(09) VALUE "840000058".
           03  CONS-SANTEI-COMMENT2  PIC X(09) VALUE "840000065".
      *    在宅血液透析指導管理料
           03  CONS-TOSEKI          PIC X(09)  VALUE "114009310".
      *    脳血管疾患急性発症日
           03  CONS-KYUSEI          PIC X(09)  VALUE "099800101".
      *    脳血管疾患急性発症終了日
           03  CONS-KYUSEI-END      PIC X(09)  VALUE "099800102".
      *    心大リハ開始日
           03  CONS-SINDAI          PIC X(09) VALUE "099800111".
      *    呼吸器リハ開始日
           03  CONS-KOKYUKI         PIC X(09) VALUE "099800141".
      *    脳血管疾患等リハ開始日
           03  CONS-NOUKE           PIC X(09) VALUE "099800121".
      *    運動器リハ開始日
           03  CONS-UNDOKI          PIC X(09) VALUE "099800131".
      *    難病患者リハ開始日
           03  CONS-NANBYO          PIC X(09) VALUE "099800161".
      *    障害児（者）リハ開始日
           03  CONS-SYOGAI          PIC X(09) VALUE "099800171".
      *    摂食療法開始日
           03  CONS-SESSYOKU        PIC X(09) VALUE "099800151".
      *    廃用症候群リハ開始日
           03  CONS-HAIYO           PIC X(09) VALUE "099800191".
      *
      *    心大リハ終了日
           03  CONS-SINDAI-E        PIC X(09) VALUE "099800112".
      *    呼吸器リハ終了日
           03  CONS-KOKYUKI-E       PIC X(09) VALUE "099800142".
      *    脳血管疾患等リハ終了日
           03  CONS-NOUKE-E         PIC X(09) VALUE "099800122".
      *    運動器リハ終了日
           03  CONS-UNDOKI-E        PIC X(09) VALUE "099800132".
      *    難病患者リハ終了日
           03  CONS-NANBYO-E        PIC X(09) VALUE "099800162".
      *    障害児（者）リハ終了日
           03  CONS-SYOGAI-E        PIC X(09) VALUE "099800172".
      *    摂食療法終了日
           03  CONS-SESSYOKU-E      PIC X(09) VALUE "099800152".
      *    廃用症候群リハ開始日
           03  CONS-HAIYO-E         PIC X(09) VALUE "099800192".
      *
      *    心大リハ加算開始日
           03  CONS-SINDAI-K        PIC X(09) VALUE "099800211".
      *    呼吸器リハ加算開始日
           03  CONS-KOKYUKI-K       PIC X(09) VALUE "099800241".
      *    廃用症候群リハ加算開始日
           03  CONS-HAIYO-K         PIC X(09) VALUE "099800291".
      *
      *    心大血管疾患リハビリテーション医学管理料（１）
           03  CONS-SINDAI-IGAKU1   PIC X(09) VALUE "180029910".
      *    心大血管疾患リハビリテーション医学管理料（２）
           03  CONS-SINDAI-IGAKU2   PIC X(09) VALUE "180030010".
      *    呼吸器リハビリテーション医学管理料（１）
           03  CONS-KOKYUKI-IGAKU1  PIC X(09) VALUE "180030510".
      *    呼吸器リハビリテーション医学管理料（２）
           03  CONS-KOKYUKI-IGAKU2  PIC X(09) VALUE "180030610".
      *    脳血管疾患等リハビリテーション医学管理料（１）
           03  CONS-NOUKE-IGAKU1    PIC X(09) VALUE "180030110".
      *    脳血管疾患等リハビリテーション医学管理料（２）
           03  CONS-NOUKE-IGAKU2    PIC X(09) VALUE "180030210".
      *    運動器リハビリテーション医学管理料（１）
           03  CONS-UNDOKI-IGAKU1   PIC X(09) VALUE "180030310".
      *    運動器リハビリテーション医学管理料（２）
           03  CONS-UNDOKI-IGAKU2   PIC X(09) VALUE "180030410".
      *
      *    心大血管疾患リハ実施
           03  CONS-SINDAI-DUMMY    PIC X(09) VALUE "099800311".
      *    呼吸器リハ実施
           03  CONS-KOKYUKI-DUMMY   PIC X(09) VALUE "099800341".
      *    脳血管疾患リハ実施
           03  CONS-NOUKE-DUMMY     PIC X(09) VALUE "099800321".
      *    運動器リハ実施
           03  CONS-UNDOKI-DUMMY    PIC X(09) VALUE "099800331".
      *
      *    介護支援連携指導料
           03  CONS-KAISIEN         PIC X(09) VALUE "113011710".
      *
      *    介護職員等喀痰吸引等指示料
           03  CONS-KAISYOKU        PIC X(09) VALUE "114020910".
      *
      *    心臓ペースメーカー指導管理料（着用型自動除細動器）
           03  CONS-SINPESUR1       PIC X(09) VALUE "113015010".
      *    心臓ペースメーカー指導管理料（ロ・植込型除細動器移行期加算含む）
           03  CONS-SINPESUR2       PIC X(09) VALUE "113015130".
      *
      *    がん患者指導管理料（心理的不安軽減のため面接）
           03  CONS-GANSIDO1        PIC X(09) VALUE "113015310".
      *    がん患者指導管理料（抗悪性腫瘍剤の必要等文書説明）
           03  CONS-GANSIDO2        PIC X(09) VALUE "113015410".
      *    がん患者指導管理料（心理的不安軽減のため面接・情報通信機器）
           03  CONS-GANSIDO3        PIC X(09) VALUE "113035410".
      *    がん患者指導管理料（抗悪性腫瘍剤の必要性文書説明・情報通信機器）
           03  CONS-GANSIDO4        PIC X(09) VALUE "113035510".
      *
      *    在宅患者共同診療料開始日
           03  CONS-ZAIKYO          PIC X(09) VALUE "099140004".
      *
      *    磁気による膀胱等刺激法開始日
           03  CONS-BOKOHO1         PIC X(09) VALUE "099400001".
      *    磁気による膀胱等刺激法
           03  CONS-BOKOHO2         PIC X(09) VALUE "140055110".
      *
      *    排尿自立指導料
           03  CONS-HAIJRT          PIC X(09) VALUE "113022810".
      *
      *    在宅酸素療法指導管理料（その他）
           03  CONS-ZAISAN          PIC X(09) VALUE "114003710".
      *    在宅酸素療法指導管理料（その他）（特例）
           03  CONS-ZAISAN2         PIC X(09) VALUE "114055550".
      *    在宅持続陽圧呼吸療法指導管理料１
           03  CONS-YOUATU1         PIC X(09) VALUE "114040710".
      *    在宅持続陽圧呼吸療法指導管理料２
           03  CONS-YOUATU2         PIC X(09) VALUE "114040810".
      *    在宅持続陽圧呼吸療法指導管理料
           03  CONS-YOUATU3         PIC X(09) VALUE "114009710".
      *
      *    在宅半固形栄養経管栄養法指導管理料
           03  CONS-ZAIHANKO        PIC X(09) VALUE "114045510".
      *
      *    高気圧酸素治療（減圧症又は空気塞栓）
           03  CONS-KIATU           PIC X(09) VALUE "140057510".
      *    高気圧酸素治療（その他のもの）
           03  CONS-KIATU2          PIC X(09) VALUE "140057610".
      *    高気圧酸素治療開始日
           03  CONS-KIATU3          PIC X(09) VALUE "099400002".
      *
      *    精神科ＳＣ疾患別等専門プログラム加算開始日
           03  CONS-SCPRO           PIC X(09) VALUE "099830104".
      *
      *    経頭蓋磁気刺激療法開始日
           03  CONS-JIKSGK          PIC X(09) VALUE "099830106".
      *    経頭蓋磁気刺激療法終了日
           03  CONS-JIKSGK-E        PIC X(09) VALUE "099830107".
      *
      *    心不全に対する遠赤外線温熱療法開始日
           03  CONS-ONNETU          PIC X(09) VALUE "099400003".
      *
      *    人工内耳機器調整加算（６歳未満）
           03  CONS-JINNAI1         PIC X(09) VALUE "113030670".
      *    人工内耳機器調整加算（６歳以上）
           03  CONS-JINNAI2         PIC X(09) VALUE "113030770".
      *
      *    精神科デイ・ケア等開始日
           03  CONS-SEIKEA          PIC X(09) VALUE "099830108".
      *
      *    在宅抗菌薬吸入療法用ネブライザ加算（１月目）
           03  CONS-KOUYAK          PIC X(09) VALUE "114051750".
      *    手順書加算（訪問看護指示料）
           03  CONS-TEJHOU          PIC X(09) VALUE "114061070".
      *
      *    在宅患者共同診療料テーブル
       01  TBL-ZAIKYO-CHECK-AREA.
           03  FILLER          PIC X(09)   VALUE    "114027610".
           03  FILLER          PIC X(09)   VALUE    "114027710".
           03  FILLER          PIC X(09)   VALUE    "114027810".
           03  FILLER          PIC X(09)   VALUE    "114027910".
      *
       01  TBL-ZAIKYO-CHECK-R  REDEFINES   TBL-ZAIKYO-CHECK-AREA.
           03  TBL-ZAIKYO-CHECK     PIC X(09)   OCCURS    4.
      *
       01  TBL-ZAIKYO-CHECK-MAX     PIC 9(02)   VALUE     4.
      *
      *    超重症児（者）入院診療加算テーブル
       01  TBL-CYOJKSN-CHECK-XXX-AREA.
           03  FILLER          PIC X(09)   VALUE    "190127510".
           03  FILLER          PIC X(09)   VALUE    "190076570".
      *
       01  TBL-CYOJKSN-CHECK-XXX-R
                               REDEFINES  TBL-CYOJKSN-CHECK-XXX-AREA.
           03  TBL-CYOJKSN-CHECK-XXX  PIC X(09)   OCCURS    2.
      *
       01  TBL-CYOJKSN-CHECK-XXX-MAX  PIC 9(02)   VALUE     2.
      *
      *    準超重症児（者）入院診療加算テーブル
       01  TBL-CYOJKSN-CHECK-YYY-AREA.
           03  FILLER          PIC X(09)   VALUE    "190127610".
           03  FILLER          PIC X(09)   VALUE    "190076670".
      *
       01  TBL-CYOJKSN-CHECK-YYY-R
                               REDEFINES  TBL-CYOJKSN-CHECK-YYY-AREA.
           03  TBL-CYOJKSN-CHECK-YYY  PIC X(09)   OCCURS    2.
      *
       01  TBL-CYOJKSN-CHECK-YYY-MAX  PIC 9(02)   VALUE     2.
      *
      *    薬剤管理指導料テーブル（２００８年４月診療分以降）
       01  TBL-YAKUKAN-AREA.
           03  FILLER               PIC X(09) VALUE "113010710".
           03  FILLER               PIC X(09) VALUE "113010810".
           03  FILLER               PIC X(09) VALUE "120001610".
      *
       01  TBL-YAKUKAN-R       REDEFINES   TBL-YAKUKAN-AREA.
            03  TBL-YAKUKAN    PIC X(09)   OCCURS   3.
      *
       01  TBL-YAKUKAN-MAX     PIC 9(02)   VALUE    3.
      *
      *
       01  TBL-HASSYO-INF.
           03  TBL-HASSYO-KAITATU-COMMENT   PIC 9(01).
           03  TBL-HASSYO-SINDAI-COMMENT    PIC 9(01).
           03  TBL-HASSYO-KOKYUKI-COMMENT   PIC 9(01).
           03  TBL-HASSYO-NOUKE-COMMENT     PIC 9(01).
           03  TBL-HASSYO-UNDOKI-COMMENT    PIC 9(01).
           03  TBL-HASSYO-NANBYO-COMMENT    PIC 9(01).
           03  TBL-HASSYO-SYOGAI-COMMENT    PIC 9(01).
           03  TBL-HASSYO-SESSYOKU-COMMENT  PIC 9(01).
           03  TBL-HASSYO-HAIYO-COMMENT     PIC 9(01).
      *
           03  TBL-HASSYO-SINDAI-DAY-T.
               05  TBL-HASSYO-SINDAI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-SINDAI-SANTEI   PIC 9(01).
           03  TBL-HASSYO-KOKYUKI-DAY-T.
               05  TBL-HASSYO-KOKYUKI-DAY-OCC     OCCURS  31.
                   07  TBL-HASSYO-KOKYUKI-SANTEI  PIC 9(01).
           03  TBL-HASSYO-NOUKE-DAY-T.
               05  TBL-HASSYO-NOUKE-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO-NOUKE-SANTEI    PIC 9(01).
           03  TBL-HASSYO-UNDOKI-DAY-T.
               05  TBL-HASSYO-UNDOKI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-UNDOKI-SANTEI   PIC 9(01).
           03  TBL-HASSYO-NANBYO-DAY-T.
               05  TBL-HASSYO-NANBYO-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-NANBYO-SANTEI   PIC 9(01).
           03  TBL-HASSYO-SYOGAI-DAY-T.
               05  TBL-HASSYO-SYOGAI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-SYOGAI-SANTEI   PIC 9(01).
           03  TBL-HASSYO-SESSYOKU-DAY-T.
               05  TBL-HASSYO-SESSYOKU-DAY-OCC    OCCURS  31.
                   07  TBL-HASSYO-SESSYOKU-SANTEI PIC 9(01).
           03  TBL-HASSYO-HAIYO-DAY-T.
               05  TBL-HASSYO-HAIYO-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO-HAIYO-SANTEI    PIC 9(01).
           03  TBL-HASSYO-TAIHI-DAY-T.
               05  TBL-HASSYO-TAIHI-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO-TAIHI-SANTEI    PIC 9(01).
      *
           03  TBL-HASSYO-TAIHIYMD1-DAY-T.
               05  TBL-HASSYO-TAIHIYMD1-FLG       PIC 9(01).
               05  TBL-HASSYO-TAIHIYMD1-DAY-OCC1.
                   07  TBL-HASSYO-TAIHIYMD11      PIC X(08) OCCURS  2.
               05  TBL-HASSYO-TAIHIYMD1-DAY-OCC2.
                   07  TBL-HASSYO-TAIHIYMD12      PIC 9(01) OCCURS 31.
      *
      *****（リハ加算用）
       01  TBL-HASSYO9-INF.
           03  TBL-HASSYO9-SINDAI-COMMENT    PIC 9(01).
           03  TBL-HASSYO9-KOKYUKI-COMMENT   PIC 9(01).
           03  TBL-HASSYO9-HAIYO-COMMENT     PIC 9(01).
      *
           03  TBL-HASSYO9-SINDAI-DAY-T.
               05  TBL-HASSYO9-SINDAI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO9-SINDAI-SANTEI   PIC 9(01).
           03  TBL-HASSYO9-KOKYUKI-DAY-T.
               05  TBL-HASSYO9-KOKYUKI-DAY-OCC     OCCURS  31.
                   07  TBL-HASSYO9-KOKYUKI-SANTEI  PIC 9(01).
           03  TBL-HASSYO9-HAIYO-DAY-T.
               05  TBL-HASSYO9-HAIYO-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO9-HAIYO-SANTEI    PIC 9(01).
      *****
      *
       01  TBL-ZAISIEN-INF.
           03  TBL-ZAISIEN-COMMENT          PIC 9(01).
      *
      *    酸素（金額・数量）情報
       01  TBL-SANSO-INF.
           03  TBL-SANSO-INF2       OCCURS    10.
               05  TBL-SANSO-TEN           PIC 9(09)V9(02).
               05  TBL-SANSO-SRYSURYO      PIC 9(05)V9(05).
           03  TBL-SANSO-INF3.
               05  TBL-KASAN-SRYSURYO      PIC 9(05)V9(05).
      *
      *    療養レセコメント情報
       01  TBL-RYOCOM-INF.
           03  TBL-RYOCOM-INF2                 OCCURS  31.
               05  TBL-RYOCOM-NYUINKBN         PIC  X(01).
               05  TBL-RYOCOM-AREA.
                 06  TBL-RYOCOM-MEISAISU       PIC  9(03).
                 06  TBL-RYOCOM-SRYCDTOTAL     PIC  9(14).
                 06  TBL-RYOCOM-INF3           OCCURS  30.
                   07  TBL-RYOCOM-IRYO-SRYCD   PIC  X(09).
                 06  TBL-RYOCOM-ADL-SRYCD      PIC  X(09).
                 06  TBL-RYOCOM-ADL-TEN        PIC  9(02).
                 06  TBL-RYOCOM-ADL-TEN-MOJI   PIC  X(04).
                 06  TBL-RYOCOM-INF4           OCCURS   4.
                   07  TBL-RYOCOM-ADL-SRYCD-H22      PIC  X(09).
                   07  TBL-RYOCOM-ADL-TEN-H22        PIC  9(02).
                   07  TBL-RYOCOM-ADL-TEN-MOJI-H22   PIC  X(04).
      *
      *    療養レセコメント情報（該当分のまとめ）
       01  TBL-RYOCOM2-INF.
           03  TBL-RYOCOM2-INF2                OCCURS  31.
               05  TBL-RYOCOM2-AREA.
                 06  TBL-RYOCOM2-MEISAISU      PIC  9(03).
                 06  TBL-RYOCOM2-SRYCDTOTAL    PIC  9(14).
                 06  TBL-RYOCOM2-INF3          OCCURS  30.
                   07  TBL-RYOCOM2-IRYO-SRYCD  PIC  X(09).
                 06  TBL-RYOCOM2-ADL-SRYCD     PIC  X(09).
                 06  TBL-RYOCOM2-ADL-TEN       PIC  9(02).
                 06  TBL-RYOCOM2-ADL-TEN-MOJI  PIC  X(04).
                 06  TBL-RYOCOM2-INF4          OCCURS   4.
                   07  TBL-RYOCOM2-ADL-SRYCD-H22     PIC  X(09).
                   07  TBL-RYOCOM2-ADL-TEN-H22       PIC  9(02).
                   07  TBL-RYOCOM2-ADL-TEN-MOJI-H22  PIC  X(04).
               05  TBL-RYOCOM2-INF5            OCCURS  31.
                 06  TBL-RYOCOM2-DAY           PIC  9(01).
      *
      *    画像診断の部位コード編集用
       01  TBL-GAZO-INF.
           03  TBL-GAZO-INF2                   OCCURS 10.
             05  TBL-GAZO-CHEKFLG              PIC  9(02).
      *
      *    酸素 
           COPY    "CMSANSOTBL.INC".
      *
           COPY    "MCPAREA".
      *
           COPY    "COMMON-SPA".
      *
      *****************************************************************
      *    ファイルレイアウト
      *****************************************************************
      *
      *    ジョブ管理マスタ
       01  JOBKANRI-REC.
           COPY    "CPJOBKANRI.INC".
      *
      *    システム管理マスタ
           COPY    "CPSYSKANRI.INC".
      *
      *    診療科目情報
           COPY    "CPSK1005.INC".
      *
      *    診療会計
       01  SRYACCT-REC.
           COPY    "CPSRYACCT.INC".
      *
      *    診療行為
       01  SRYACT-REC.
           COPY    "CPSRYACT.INC".
      *
      *    算定履歴
       01  SANTEI-REC.
           COPY    "CPSANTEI.INC".
      *
      *    患者コメント
       01  PTCOM-REC.
           COPY    "CPPTCOM.INC".
      *
      *    点数
           COPY    "CPTENSU.INC".
      *
      *    算定履歴付加
       01  SANTEIPLUS-REC.
           COPY    "CPSANTEIPLUS.INC".
      *
      *    入院履歴
       01  PTNYUINRRK-REC.
           COPY    "CPPTNYUINRRK.INC".
      *
      *    レセプト記載
       01  RKISAI-REC.
           COPY    "CPRECEKISAI.INC".
      *
      *****************************************************************
      *    サブプロ用領域
      *****************************************************************
      *   ジョブ管理ＤＢ制御サブ
           COPY    "CPORCSJOBKANRI.INC".
      *     
      *    数値変換サブ
           COPY    "CPORCSNUM.INC".
      *
      *    日付変換サブ
           COPY    "CPORCSDAY.INC".
           COPY    "CPORCSLNK.INC".
      *
      *    全角チェックパラメタ
           COPY    "CPORCSKANACHK.INC".
      *
      *    療養レセコメント取得サブ
           COPY    "CPORCSRYOCOM.INC".
      *
           COPY    "CPORCSGETTEMP.INC".
      *
      *    オンライン診療料等に関わる算定履歴チェックサブ
           COPY    "CPORCSRECESRCHK.INC".
      *
      *    レセプト自動記載コメント編集サブ
           COPY    "CPORCSRECECOMMENT.INC".
      *
      *    ＤＢ検索
           COPY    "MCPDATA.INC".
      *
      ****************************************************************
       LINKAGE                 SECTION.
       01  COMMAND-PARAM.
           02  FILLER      PIC X(256).
      ****************************************************************
       PROCEDURE           DIVISION
               USING
           COMMAND-PARAM.
      *
      *****************************************************************
      *    主　　処理
      *****************************************************************
       000-PROC-SEC                SECTION.
      *
           PERFORM 100-INIT-SEC
      *
           PERFORM 200-MAIN-SEC
                   UNTIL  FLG-END  =   1
      *
           PERFORM 300-END-SEC
      *
           IF      WRK-PARA-SHELLID    NOT =   "RECEPTX"
               STOP    RUN
           ELSE
               EXIT    PROGRAM
           END-IF 
           .
      *****************************************************************
      *    初期　処理
      *****************************************************************
       100-INIT-SEC                SECTION.
      *
           INITIALIZE                  FLG-AREA
           INITIALIZE                  STS-AREA
           INITIALIZE                  WRK-AREA
           INITIALIZE                  CNT-AREA
           INITIALIZE                  SPA-AREA
      *
      *    ファイルＯＰＥＮ処理
      *
           PERFORM 110-FILE-OPEN-SEC
      *
           IF      WRK-PARA-SHELLID    NOT =   "RECEPTX"
      *        ＤＢオープン処理
               PERFORM 120-DBOPEN-SEC
      *
      *        ステップ管理開始処理
               MOVE    "STS"           TO  SJOBKANRI-MODE
               INITIALIZE                  JOBKANRI-REC
               MOVE    "ORCR1240"      TO  JOB-PGID
               MOVE    "コメント編集"  TO  JOB-SHELLMSG
               PERFORM   900-CALL-ORCSJOB-SEC
      *        処理中止設定処理
               PERFORM 500-CANCEL-HENSYU-SEC
           END-IF
      *
           PERFORM 990-RECE200-READ-SEC
           .
       100-INIT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイルＯＰＥＮ処理
      *****************************************************************
       110-FILE-OPEN-SEC          SECTION.
      *
           UNSTRING    COMMAND-PARAM   DELIMITED  BY  ","
                                       INTO    WRK-PARA
                                               WRK-PARA-HOSPNUM
                                               RECEERR
           END-UNSTRING
           MOVE    WRK-PARA-HOSPNUM    TO  SPA-HOSPNUM
      *
           INITIALIZE                      SGETTEMP-AREA
           MOVE    RECEERR             TO  SGETTEMP-BASENAME
           CALL    "ORCSGETTEMP"       USING   SGETTEMP-AREA
           MOVE    SPACE               TO  RECEERR
           MOVE    SGETTEMP-FULLNAME   TO  RECEERR
      *
           MOVE    "RECE700"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE200PARA
           MOVE    "RECE720"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE220PARA
           MOVE    "RECE730"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE230PARA
      *
           MOVE    "RECE722"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE2201PARA
           MOVE    "RECE732"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE2301PARA
      *
           MOVE    "RECE72Y"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE2209PARA
           MOVE    "RECE73Y"           TO  RECEDAT1PARA-FILE-ID
           PERFORM 800-FILENM-SET-SEC
           MOVE    TEMPFLPARA          TO  RECE2309PARA
      *
           OPEN    INPUT               RECE200-FILE
           OPEN    INPUT               RECE220-FILE
           OPEN    INPUT               RECE230-FILE
      *
           OPEN    OUTPUT              RECE2201-FILE
           CLOSE                       RECE2201-FILE
           OPEN    OUTPUT              RECE2301-FILE
           CLOSE                       RECE2301-FILE
      *
           OPEN    OUTPUT              RECE2209-FILE
           CLOSE                       RECE2209-FILE
           OPEN    OUTPUT              RECE2309-FILE
           CLOSE                       RECE2309-FILE
      *
           OPEN    I-O                 RECE2201-FILE
           OPEN    I-O                 RECE2301-FILE
      *
           OPEN    I-O                 RECE2209-FILE
           OPEN    I-O                 RECE2309-FILE
      *
           .
       110-FILE-OPEN-EXT.
           EXIT.
      *
      *****************************************************************
      *    主処理
      *****************************************************************
       200-MAIN-SEC                SECTION.
      *
           INITIALIZE                      TBL-HASSYO-INF
           INITIALIZE                      TBL-HASSYO9-INF
           INITIALIZE                      TBL-ZAISIEN-INF
           INITIALIZE                      TBL-RYOCOM-INF
      *
      *    療養レセコメント取得
      *
           MOVE      ZERO     TO      FLG-RYOCOM
      *
           IF    RECE200-SRYYM   >=  "200610"
           AND   RECE200-SRYYM   <=  "201803"
             INITIALIZE                    ORCSRYOCOM-AREA
             MOVE    RECE200-HOSPNUM   TO  LNK-RYOCOM-HOSPNUM
             MOVE    RECE200-PTID      TO  LNK-RYOCOM-PTID
             MOVE    RECE200-SRYYM     TO  LNK-RYOCOM-SANTEIYM
             CALL    "ORCSRYOCOM"          USING
                                           ORCSRYOCOM-AREA
                                           SPA-AREA
             IF      LNK-RYOCOM-RC    =   ZERO
               MOVE       1            TO  FLG-RYOCOM
               PERFORM  VARYING  RYO-IDX  FROM  1  BY  1
                         UNTIL   RYO-IDX   >   31
                 MOVE  LNK-RYOCOM-NYUINKBN(RYO-IDX)
                                 TO  TBL-RYOCOM-NYUINKBN(RYO-IDX)
                 MOVE  LNK-RYOCOM-MEISAISU(RYO-IDX)
                                 TO  TBL-RYOCOM-MEISAISU(RYO-IDX)
                 MOVE  LNK-RYOCOM-SRYCDTOTAL(RYO-IDX)
                                 TO  TBL-RYOCOM-SRYCDTOTAL(RYO-IDX)
                 PERFORM  VARYING  RYO-IDX2  FROM  1  BY  1
                           UNTIL   RYO-IDX2   >   30
                   MOVE  LNK-RYOCOM-IRYO-SRYCD(RYO-IDX RYO-IDX2)
                           TO  TBL-RYOCOM-IRYO-SRYCD(RYO-IDX RYO-IDX2)
                 END-PERFORM
                 MOVE  LNK-RYOCOM-ADL-SRYCD(RYO-IDX)
                                 TO  TBL-RYOCOM-ADL-SRYCD(RYO-IDX)
                 MOVE  LNK-RYOCOM-ADL-TEN(RYO-IDX)
                                 TO  TBL-RYOCOM-ADL-TEN(RYO-IDX)
                 MOVE  LNK-RYOCOM-ADL-TEN-MOJI(RYO-IDX)
                                 TO  TBL-RYOCOM-ADL-TEN-MOJI(RYO-IDX)
                 PERFORM  VARYING  RYO-IDX2  FROM  1  BY  1
                           UNTIL   RYO-IDX2   >    4
                   MOVE  LNK-RYOCOM-ADL-SRYCD-H22(RYO-IDX RYO-IDX2)
                      TO  TBL-RYOCOM-ADL-SRYCD-H22(RYO-IDX RYO-IDX2)
                   MOVE  LNK-RYOCOM-ADL-TEN-H22(RYO-IDX RYO-IDX2)
                      TO  TBL-RYOCOM-ADL-TEN-H22(RYO-IDX RYO-IDX2)
                   MOVE  LNK-RYOCOM-ADL-TEN-MOJI-H22(RYO-IDX RYO-IDX2)
                      TO  TBL-RYOCOM-ADL-TEN-MOJI-H22(RYO-IDX RYO-IDX2)
                 END-PERFORM
               END-PERFORM
             END-IF
           END-IF
      *
           MOVE  ZERO        TO    CNT-KENSA
           IF   RECE200-KENSA-BNPFLG     =   1
                 ADD    1    TO    CNT-KENSA
           END-IF
           IF   RECE200-KENSA-NTPROFLG   =   1
                 ADD    1    TO    CNT-KENSA
           END-IF
           IF   RECE200-KENSA-ANPFLG     =   1
                 ADD    1    TO    CNT-KENSA
           END-IF
      *
           IF   RECE200-COMCNTFLG   =   "1"
      *
             INITIALIZE                      RECE220-REC
             MOVE    RECE200-KEY         TO  RECE220-KEY1
             MOVE    ZERO                TO  RECE220-ZAINUM
      *
             START   RECE220-FILE
                 KEY IS    >=   RECE220-KEY
                 INVALID
                     MOVE    1           TO  FLG-RECE220
                 NOT INVALID
                     PERFORM 990-RECE220-NEXT-SEC
             END-START
             PERFORM
               UNTIL  ( FLG-RECE220          =   1            )
               OR     ( RECE200-KEY      NOT =   RECE220-KEY1 )
      *
               EVALUATE      RECE220-SRYKBN
                   WHEN      "14"
      *            （在支援に関する診療のカウント）
                      IF  RECE220-FLG-ZAISIEN-COMMENT   =  "1" OR "2"
                        MOVE    RECE220-REC    TO   WK-RECE220-REC
                        EVALUATE  RECE220-FLG-ZAISIEN-COMMENT
                          WHEN      "1"
                            MOVE  1  TO  TBL-ZAISIEN-COMMENT
                          WHEN      "2"
                            MOVE  2  TO  TBL-ZAISIEN-COMMENT
                        END-EVALUATE
                      END-IF
                   WHEN      "40"
      *            （介達牽引あり）
                      IF  RECE220-KAITATU-COMMENT    =  "1"
                        MOVE    1    TO    TBL-HASSYO-KAITATU-COMMENT
                      END-IF
                   WHEN      "80"
      *            （リハビリあり）
                      IF  RECE220-SINDAI-COMMENT     =  "1"
                        MOVE    1    TO    TBL-HASSYO-SINDAI-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-SINDAI-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-KOKYUKI-COMMENT    =  "1"
                        MOVE    1    TO    TBL-HASSYO-KOKYUKI-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-KOKYUKI-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-NOUKE-COMMENT      =  "1"
                        MOVE    1    TO    TBL-HASSYO-NOUKE-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-NOUKE-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-UNDOKI-COMMENT     =  "1"
                        MOVE    1    TO    TBL-HASSYO-UNDOKI-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-UNDOKI-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-NANBYO-COMMENT     =  "1"
                        MOVE    1    TO    TBL-HASSYO-NANBYO-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-NANBYO-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-SYOGAI-COMMENT     =  "1"
                        MOVE    1    TO    TBL-HASSYO-SYOGAI-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-SYOGAI-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-SESSYOKU-COMMENT   =  "1"
                        MOVE    1    TO    TBL-HASSYO-SESSYOKU-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-SESSYOKU-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-HAIYO-COMMENT     =  "1"
                        MOVE  1  TO  TBL-HASSYO-HAIYO-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO-HAIYO-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
      *
                      IF  RECE220-SINDAI9-COMMENT     =  "1"
                      OR  RECE220-SINDAI9X-COMMENT    =  "1"
                        MOVE  1  TO  TBL-HASSYO9-SINDAI-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO9-SINDAI-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-KOKYUKI9-COMMENT    =  "1"
                      OR  RECE220-KOKYUKI9X-COMMENT   =  "1"
                        MOVE  1  TO  TBL-HASSYO9-KOKYUKI-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO9-KOKYUKI-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                      IF  RECE220-HAIYO9-COMMENT     =  "1"
                      OR  RECE220-HAIYO9X-COMMENT    =  "1"
                        MOVE  1  TO  TBL-HASSYO9-HAIYO-COMMENT
                        PERFORM  VARYING  IDX1  FROM  1  BY  1
                                  UNTIL   IDX1   >   31
                         IF   RECE220-KAISU(1 IDX1)  NOT = ZERO
                          MOVE 1 TO TBL-HASSYO9-HAIYO-SANTEI(IDX1)
                         END-IF
                        END-PERFORM
                      END-IF
                   WHEN      "90"
                   WHEN      "92"
                      IF  (RECE200-CYOJKSNFLG  NOT = SPACE    )
                      AND (RECE220-FLG-CYOJKSN-COMMENT =
                                      "1" OR "2" OR "3" OR "4")
                        PERFORM   20011-CYOJKSN-KAISHIDAY-SEC
                      END-IF
               END-EVALUATE
      *
               PERFORM 990-RECE220-NEXT-SEC
      *
             END-PERFORM
      *
           END-IF
      *
      *    パラメータ０４ファイルより編集
           INITIALIZE                      RECE220-REC
           MOVE    RECE200-KEY         TO  RECE220-KEY1
           MOVE    ZERO                TO  RECE220-ZAINUM
      *
           START   RECE220-FILE
               KEY IS    >=   RECE220-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE220
               NOT INVALID
                   PERFORM 990-RECE220-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE220           =   1            )
               OR     ( RECE200-KEY       NOT =   RECE220-KEY1 )
      *
               MOVE    ZERO   TO   FLG-KAISIEN
      *
               IF   RECE220-JIHOKBN  NOT =  SPACE
                 PERFORM     20011-HOKATU-COMMENT-SEC
               ELSE
                 EVALUATE      RECE220-SRYKBN
                   WHEN      "11"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYODOU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "13"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-YAKUKANSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-NYUEIYOSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUMONSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYOBYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-RYOYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TAIIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KAISIEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYUEIYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-JINNAI-HANTEI-SEC
                      END-IF
      *               診区１３・１４共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SINPESUR-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-GANSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HAIJRT-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TAIKYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "14"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUSIJI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUSKSN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TEJHOU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HINKAI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-OSIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KAISYOKU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-YOUATU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-ZAIKYO-HANTEI-SEC
                      END-IF
      *               診区１３・１４共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SINPESUR-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-ZAIHANKO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-GAIZAI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KOUYAK-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "40"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-JINZOUETC-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KYOKUIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-BOKOHO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KIATU-HANTEI-SEC
                      END-IF
      *               診区４０・８０共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SCPRO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "50"
                      PERFORM      2001-SHUJUTSU-HANTEI-SEC
                   WHEN      "54"
                      PERFORM      2001-MASUI-HANTEI-SEC
                   WHEN      "60"
                   WHEN      "64"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENSEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENSA-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENKSN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "70"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-CTMRI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KINGAZ-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "80"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUMONSIDO-SEI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        IF    RECE220-RIHABIRI-COMMENT  NOT = SPACE
                          IF  RECE220-RIHABIRI-COMMENT      =  "1"
                            MOVE      99   TO   FLG-COMMENT
                            PERFORM   2001-RIHA-COMMENT-SEC
                          ELSE
                            MOVE      99   TO   FLG-COMMENT
                            PERFORM   2001-RIHAIGAKU-COMMENT-SEC
                          END-IF
                        END-IF
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-RIHASEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SEIKEA-HANTEI-SEC
                      END-IF
      *               診区４０・８０共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SCPRO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE220-TENSOU-SEC
                      END-IF
                   WHEN      "90"
                   WHEN      "92"
                      EVALUATE    RECE220-ZAISKBKBN
                        WHEN   "2"
                          PERFORM      2001-NYU-COMMENT-SEC
                        WHEN   "6"
                          MOVE   ZERO   TO  FLG-COMMENT
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-KAKURI-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-EISAPO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-KOKKEA-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-JYUSYO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-SEIRIE-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-BYOYAK-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-CYOJKSN-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-HAIJSK-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-NYUKSN-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2099-RECE220-TENSOU-SEC
                          END-IF
                        WHEN   OTHER
                          PERFORM      2099-RECE220-TENSOU-SEC
                      END-EVALUATE
                   WHEN   OTHER
                      PERFORM          2099-RECE220-TENSOU-SEC
                 END-EVALUATE
               END-IF
      *
               PERFORM 990-RECE220-NEXT-SEC
      *
           END-PERFORM
      *
      *    他保険にて入院料算定済みのコメント
      *
           IF   RECE200-NYUINRYOFLG   NOT =   SPACE
               PERFORM   2001-NYUINRYO-COMMENT-SEC
           END-IF
      *
      *    発症日のコメント
           PERFORM   2001-HASSYO-HANTEI-SEC
      *
      *    在支援コメント
           IF  TBL-ZAISIEN-COMMENT   NOT =  ZERO
                  PERFORM    2001-ZAISIEN-COMMENT-SEC
           END-IF
      *
      *    特別のコメント（特別な関係にある他院）
      *
           IF   RECE200-TAINFLG           =   "1"
               PERFORM   2001-TAIN-TOKUBETU-COMMENT-SEC
           END-IF
      *
      *    妊婦のコメント
           IF   RECE200-NINPUFLG   =   1
               PERFORM   2001-NINPU-COMMENT-SEC
           END-IF
      *
      *****差込編集２**********************
           PERFORM     250-SASHIKOMI2-SEC
      *
      *****選択式コメント編集**************
           IF   RECE200-SRYYM  >=  "201810"
             PERFORM   270-SENTAKUCOM-HENSYU-SEC
           END-IF
      *
           PERFORM 990-RECE200-READ-SEC
      *
           IF  CNT-IN-COMMIT   =    300
                 MOVE  ZERO          TO      CNT-IN-COMMIT
                 PERFORM 900-DBCOMMIT-SEC
                 PERFORM 900-DBSTART-SEC
           END-IF
      *
      *    処理中止設定処理
           IF      CNT-IN-CANCEL       =   50
               MOVE    ZERO                TO  CNT-IN-CANCEL
               PERFORM 500-CANCEL-HENSYU-SEC
           END-IF
      *
           .
       200-MAIN-EXT.
           EXIT.
      *
      *****************************************************************
      *    他保険にて入院料算定済みのコメント編集
      *****************************************************************
       2001-NYUINRYO-COMMENT-SEC          SECTION.
      *
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
           MOVE    99999999            TO  RECE2209-ZAINUM
           MOVE    "90"                TO  RECE2209-SRYKBN
      ***  MOVE    RECE200-HKNCOMBI    TO  RECE2209-HKNCOMBI
      *
           MOVE    1                   TO  RECE2209-MEISAISU
      *
           WRITE   RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           INITIALIZE                      RECE2309-REC
           MOVE    RECE200-KEY         TO  RECE2309-KEY1
           MOVE    99999999            TO  RECE2309-ZAINUM
           MOVE    "90"                TO  RECE2309-SRYKBN
      *    コメントの挿入
           MOVE    SPACE               TO  WRK-RECE230XX-REC
           INITIALIZE                      WRK-RECE230XX-REC
           MOVE    "810000001"         TO  WRK-RECE230XX-SRYCD(1 1)
           MOVE     ZERO               TO  WRK-RECE230XX-SRYSURYO(1 1)
           EVALUATE   RECE200-NYUINRYOFLG
             WHEN     "1"
               MOVE     10             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "自費にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "2"
               MOVE     10             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "労災にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "3"
               MOVE     11             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "自賠責にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "4"
               MOVE     10             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "国保にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "5"
               MOVE     10             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "社保にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "6"
               MOVE     11             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "他保険にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "7"
               MOVE     10             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "公害にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
             WHEN     "8"
               MOVE     10             TO  WRK-RECE230XX-YUKOKETA(1 1)
               MOVE    "後保にて入院料算定済" 
                                       TO  WRK-RECE230XX-NAME(1 1)
           END-EVALUATE
      *
           MOVE    WRK-RECE230XX-SRYACT-TBL(1 1)
                                       TO  RECE2309-SRYACT-TBL(1)
           WRITE   RECE2309-REC
           ADD     1                   TO  CNT-RECE2309
      *
           .
       2001-NYUINRYO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    在支援のコメント編集
      *****************************************************************
       2001-ZAISIEN-COMMENT-SEC          SECTION.
      *
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
           MOVE    99999965            TO  RECE2209-ZAINUM
           MOVE    WK-RECE220-SRYKBN   TO  RECE2209-SRYKBN
      ***  MOVE    RECE200-HKNCOMBI    TO  RECE2209-HKNCOMBI
      *
           MOVE    1                   TO  RECE2209-MEISAISU
      *
           WRITE   RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           INITIALIZE                      RECE2309-REC
           MOVE    RECE200-KEY         TO  RECE2309-KEY1
           MOVE    99999965            TO  RECE2309-ZAINUM
           MOVE    WK-RECE220-SRYKBN   TO  RECE2309-SRYKBN
      *    在支援コメントの挿入
           MOVE    SPACE               TO  WRK-RECE230XX-REC
           INITIALIZE                      WRK-RECE230XX-REC
           MOVE    "810000001"         TO  WRK-RECE230XX-SRYCD(1 1)
           MOVE     ZERO               TO  WRK-RECE230XX-SRYSURYO(1 1)
           MOVE     3                  TO  WRK-RECE230XX-YUKOKETA(1 1)
           EVALUATE  TBL-ZAISIEN-COMMENT
             WHEN      1
               MOVE    "在支援"        TO  WRK-RECE230XX-NAME(1 1)
             WHEN      2
               MOVE    "在支病"        TO  WRK-RECE230XX-NAME(1 1)
           END-EVALUATE
      *
           MOVE    WRK-RECE230XX-SRYACT-TBL(1 1)
                                       TO  RECE2309-SRYACT-TBL(1)
           WRITE   RECE2309-REC
           ADD     1                   TO  CNT-RECE2309
      *
           .
       2001-ZAISIEN-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    特別のコメント（特別な関係にある他院）
      *****************************************************************
       2001-TAIN-TOKUBETU-COMMENT-SEC          SECTION.
      *
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
           MOVE    99999990            TO  RECE2209-ZAINUM
           MOVE    "99"                TO  RECE2209-SRYKBN
           MOVE    1                   TO  RECE2209-MEISAISU
      *
           WRITE   RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           INITIALIZE                      RECE2309-REC
           MOVE    RECE200-KEY         TO  RECE2309-KEY1
           MOVE    99999990            TO  RECE2309-ZAINUM
           MOVE    "99"                TO  RECE2309-SRYKBN
      *
           MOVE    SPACE               TO  WRK-RECE230XX-REC
           INITIALIZE                      WRK-RECE230XX-REC
           MOVE    "810000001"         TO  WRK-RECE230XX-SRYCD(1 1)
           MOVE     ZERO               TO  WRK-RECE230XX-SRYSURYO(1 1)
           MOVE     4                  TO  WRK-RECE230XX-YUKOKETA(1 1)
           MOVE    "（特別）"          TO  WRK-RECE230XX-NAME(1 1)
      *
           MOVE    WRK-RECE230XX-SRYACT-TBL(1 1)
                                       TO  RECE2309-SRYACT-TBL(1)
           WRITE   RECE2309-REC
           ADD     1                   TO  CNT-RECE2309
      *
           .
       2001-TAIN-TOKUBETU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    妊婦のコメント編集
      *****************************************************************
       2001-NINPU-COMMENT-SEC          SECTION.
      *
           INITIALIZE                   RECE2209-REC
           MOVE    RECE200-KEY      TO  RECE2209-KEY1
           MOVE    99999960         TO  RECE2209-ZAINUM
           MOVE    "99"             TO  RECE2209-SRYKBN
           MOVE    1                TO  RECE2209-MEISAISU
           WRITE   RECE2209-REC
           ADD     1                TO  CNT-RECE2209
      *
           INITIALIZE                   RECE2309-REC
           MOVE    RECE200-KEY      TO  RECE2309-KEY1
           MOVE    99999960         TO  RECE2309-ZAINUM
           MOVE    "99"             TO  RECE2309-SRYKBN
      *    コメントの挿入
           MOVE    SPACE            TO  WRK-RECE230XX-REC
           INITIALIZE                   WRK-RECE230XX-REC
      *    「妊婦」
           MOVE    "820100348"      TO  WRK-TENSU-SRYCD
           MOVE    RECE200-SRYYM    TO  WRK-TENSU-SRYYM
           PERFORM 900-TENSU-TBL-SEC
      *
           MOVE    TNS-SRYCD        TO  WRK-RECE230XX-SRYCD(1 1)
           MOVE    ZERO             TO  WRK-RECE230XX-SRYSURYO(1 1)
           MOVE    TNS-YUKOKETA     TO  WRK-RECE230XX-YUKOKETA(1 1)
           MOVE    TNS-NAME         TO  WRK-RECE230XX-NAME(1 1)
                                        WRK-RECE230XX-INPUTCOMENT(1 1)
           MOVE    WRK-RECE230XX-SRYACT-TBL(1 1)
                                    TO  RECE2309-SRYACT-TBL(1)
           WRITE   RECE2309-REC
           ADD     1                TO  CNT-RECE2309
      *
           .
       2001-NINPU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日があるか判定
      *****************************************************************
       2001-HASSYO-HANTEI-SEC          SECTION.
      *
           IF   TBL-HASSYO-KAITATU-COMMENT   =  1
             MOVE      ZERO            TO   FLG-COMOKIKAE
             MOVE      CONS-KYUSEI     TO   WRK-SRYCD
             PERFORM   2001-KYUSEIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-SINDAI-COMMENT    =  1
             MOVE      ZERO            TO   FLG-COMOKIKAE
             MOVE      CONS-SINDAI     TO   WRK-SRYCD
             MOVE      CONS-SINDAI-E   TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-SINDAI-DAY-T
                                       TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-SINDAI-AREA
                                   TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-KOKYUKI-COMMENT   =  1
             MOVE      ZERO            TO   FLG-COMOKIKAE
             MOVE      CONS-KOKYUKI    TO   WRK-SRYCD
             MOVE      CONS-KOKYUKI-E  TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-KOKYUKI-DAY-T
                                       TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-KOKYUKI-AREA
                                   TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-NOUKE-COMMENT     =  1
             MOVE      1               TO   FLG-COMOKIKAE
             MOVE      CONS-NOUKE      TO   WRK-SRYCD
             MOVE      CONS-NOUKE-E    TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-NOUKE-DAY-T
                                       TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-NOUKE-AREA
                                   TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-UNDOKI-COMMENT    =  1
             MOVE      1                TO   FLG-COMOKIKAE
             MOVE      CONS-UNDOKI      TO   WRK-SRYCD
             MOVE      CONS-UNDOKI-E    TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-UNDOKI-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-UNDOKI-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-NANBYO-COMMENT    =  1
             MOVE      1                TO   FLG-COMOKIKAE
             MOVE      CONS-NANBYO      TO   WRK-SRYCD
             MOVE      CONS-NANBYO-E    TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-NANBYO-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-NANBYO-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-SYOGAI-COMMENT    =  1
             MOVE      ZERO             TO   FLG-COMOKIKAE
             MOVE      CONS-SYOGAI      TO   WRK-SRYCD
             MOVE      CONS-SYOGAI-E    TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-SYOGAI-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-SYOGAI-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-SESSYOKU-COMMENT  =  1
             MOVE      ZERO               TO   FLG-COMOKIKAE
             MOVE      CONS-SESSYOKU      TO   WRK-SRYCD
             MOVE      CONS-SESSYOKU-E    TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-SESSYOKU-DAY-T
                                          TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-SESSYOKU-AREA
                                      TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-HAIYO-COMMENT    =  1
             MOVE      1                TO   FLG-COMOKIKAE
             MOVE      CONS-HAIYO       TO   WRK-SRYCD
             MOVE      CONS-HAIYO-E     TO   WRK-SRYCD2
             MOVE      TBL-HASSYO-HAIYO-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-HAIYO-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      *####
           IF   TBL-HASSYO9-SINDAI-COMMENT    =  1
             MOVE      1                TO   FLG-COMOKIKAE
             MOVE      CONS-SINDAI-K    TO   WRK-SRYCD
             MOVE      "999999999"      TO   WRK-SRYCD2
             MOVE      TBL-HASSYO9-SINDAI-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-SINDAI9-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO9-KOKYUKI-COMMENT   =  1
             MOVE      1                TO   FLG-COMOKIKAE
             MOVE      CONS-KOKYUKI-K   TO   WRK-SRYCD
             MOVE      "999999999"      TO   WRK-SRYCD2
             MOVE      TBL-HASSYO9-KOKYUKI-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-KOKYUKI9-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO9-HAIYO-COMMENT    =  1
             MOVE      1                TO   FLG-COMOKIKAE
             MOVE      CONS-HAIYO-K     TO   WRK-SRYCD
             MOVE      "999999999"      TO   WRK-SRYCD2
             MOVE      TBL-HASSYO9-HAIYO-DAY-T
                                        TO   TBL-HASSYO-TAIHI-DAY-T
             MOVE      RECE200-RIHA2-HAIYO9-AREA
                                    TO   TBL-HASSYO-TAIHIYMD1-DAY-T
             PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      *
           .
       2001-HASSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    脳血管疾患急性発症日があるか判定
      *    脳血管疾患急性発症日の１８０日以内か判定
      *****************************************************************
       2001-KYUSEIHASSYO-HANTEI-SEC          SECTION.
      *
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT2
           MOVE     ZERO     TO     WRK-KYUSEIYMD
      *
      *    脳血管疾患急性発症日
      *
      *    算定履歴検索
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEI-PTID
           MOVE    WRK-SRYCD           TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    RECE200-HKNCOMBI    TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
      *
                MOVE    "tbl_santei"        TO      MCP-TABLE
                MOVE    "key3"              TO      MCP-PATHNAME
                PERFORM        900-SANTEI-READ-SEC
      *
                PERFORM   UNTIL  ( FLG-SANTEI         =   1 ) OR
                                 ( FLG-KYUSEI-COMMENT =   1 )
      *
                   PERFORM  VARYING   IDX3   FROM  31  BY  -1
                             UNTIL   ( IDX3               <    1 )
                               OR    ( FLG-KYUSEI-COMMENT =    1 )
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                         MOVE   SANTEI-SRYYM   TO  WRK-FSANTEIYMD(1:6)
                         MOVE   IDX3           TO  WRK-FSANTEIYMD(7:2)
      *
                         INITIALIZE                  STS-AREA-DAY
                         INITIALIZE                  LNK-DAY6-AREA
                         MOVE    "61"            TO  LNK-DAY6-IRAI
                         MOVE    WRK-FSANTEIYMD  TO  LNK-DAY6-KIJUN
                         MOVE    "1"             TO  LNK-DAY6-ZOGENPTN
                         MOVE     179            TO  LNK-DAY6-ZOGEN
                         CALL    "ORCSDAY"       USING   STS-AREA-DAY
                                                         LNK-DAY6-AREA
                         MOVE    LNK-DAY6-KEISAN TO  WRK-AFTER180
      *
                         IF   WRK-FSANTEIYMD(1:6) <=  RECE200-SRYYM
                         AND  RECE200-SRYYM       <=  WRK-AFTER180(1:6)
                               MOVE    1    TO   FLG-KYUSEI-COMMENT
                               MOVE  WRK-FSANTEIYMD
                                            TO   WRK-KYUSEIYMD
                         END-IF
      *
                     END-IF
      *
                   END-PERFORM
      *
                   MOVE    "tbl_santei"        TO      MCP-TABLE
                   MOVE    "key3"              TO      MCP-PATHNAME
                   PERFORM        900-SANTEI-READ-SEC
      *
                END-PERFORM
      *
           END-IF
      *
           MOVE    "tbl_santei"        TO      MCP-TABLE
           MOVE    "key3"              TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *    脳血管疾患急性発症終了日
      *
           IF      FLG-KYUSEI-COMMENT    =      1
      *       算定履歴検索
              INITIALIZE                      SANTEI-REC
              MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
              MOVE    RECE200-PTID        TO  SANTEI-PTID
              MOVE    CONS-KYUSEI-END     TO  SANTEI-SRYCD
              MOVE    ZERO                TO  SANTEI-NYUGAIKBN
              MOVE    ZERO                TO  SANTEI-SRYKA
              MOVE    RECE200-HKNCOMBI    TO  SANTEI-HKNCOMBINUM
              MOVE    SANTEI-REC          TO  MCPDATA-REC
              MOVE    "tbl_santei"        TO  MCP-TABLE
              MOVE    "key3"              TO  MCP-PATHNAME
              PERFORM   900-DBSELECT-SEC
              IF      MCP-RC              =   ZERO
      *
                   MOVE    "tbl_santei"        TO      MCP-TABLE
                   MOVE    "key3"              TO      MCP-PATHNAME
                   PERFORM        900-SANTEI-READ-SEC
      *
                   PERFORM   UNTIL ( FLG-SANTEI          =   1         )
                              OR   ( SANTEI-SRYYM  < WRK-KYUSEIYMD(1:6))
                              OR   ( FLG-KYUSEI-COMMENT2 =   1         )
      *
                      PERFORM  VARYING   IDX3   FROM  31  BY  -1
                             UNTIL ( IDX3                  <    1      )
                              OR   ( FLG-KYUSEI-COMMENT2   =    1      )
      *
                        IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                           MOVE   SANTEI-SRYYM   TO  WRK-FSANTEIYMD(1:6)
                           MOVE   IDX3           TO  WRK-FSANTEIYMD(7:2)
      *
                           IF   WRK-KYUSEIYMD        <  WRK-FSANTEIYMD
                           AND  WRK-FSANTEIYMD(1:6)  <  RECE200-SRYYM
                                  MOVE    1    TO   FLG-KYUSEI-COMMENT2
                           END-IF
      *
                        END-IF
      *
                      END-PERFORM
      *
                      MOVE    "tbl_santei"        TO      MCP-TABLE
                      MOVE    "key3"              TO      MCP-PATHNAME
                      PERFORM        900-SANTEI-READ-SEC
      *
                   END-PERFORM
      *
              END-IF
      *
              MOVE    "tbl_santei"        TO      MCP-TABLE
              MOVE    "key3"              TO      MCP-PATHNAME
              PERFORM   900-CLOSE-SEC
           END-IF
      *
           IF      FLG-KYUSEI-COMMENT    =      1
           AND     FLG-KYUSEI-COMMENT2   =      ZERO
               PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
               MOVE       WRK-KYUSEIYMD(7:2)  TO  IDX16
               IF   RECE200-SRYYM >= "201905"
                 PERFORM  20011-HASSYO-COM-201905-SEC
               ELSE
                 PERFORM  20011-HASSYO-COMMENT-SEC
               END-IF
           END-IF
      *
           .
       2001-KYUSEIHASSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    脳血管疾患急性発症日等の検索
      *****************************************************************
       20011-KYUSEIHASSYO-KENSAKU-SEC          SECTION.
      *
           MOVE    ZERO                  TO  FLG-KYUSEI-OK
           MOVE    SPACE                 TO  WRK-KYUSEI-NYUGAIKBN
           MOVE    SPACE                 TO  WRK-KYUSEI-SRYKA
           MOVE    ZERO                  TO  WRK-KYUSEI-ZAINUM
           MOVE    ZERO                  TO  FLG-COMOKIKAE2
           MOVE    ZERO                  TO  FLG-COMARI
           MOVE    ZERO                  TO  FLG-COMARI2
      *
           MOVE    ZERO                  TO  IDZ
           INITIALIZE                        WRK-FREE-AREA
           INITIALIZE                        WRK-FREE-AREA2
      *++++
           PERFORM   VARYING   IDX15    FROM   1   BY   1
                      UNTIL   (IDX15          >    2)
                       OR     (FLG-KYUSEI-OK  =    1)
      *
           INITIALIZE                        SRYACT-REC
           MOVE    RECE200-HOSPNUM       TO  SRY-HOSPNUM
           MOVE    IDX15                 TO  SRY-NYUGAIKBN
           MOVE    RECE200-PTID          TO  SRY-PTID
           MOVE    WRK-KYUSEIYMD(1:6)    TO  SRY-SRYYM
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (1)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (2)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (3)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (4)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (5)
           MOVE    SRYACT-REC            TO  MCPDATA-REC
           MOVE    "tbl_sryact"          TO  MCP-TABLE
           MOVE    "key7"                TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC               =       ZERO
               MOVE    "tbl_sryact"      TO     MCP-TABLE
               MOVE    "key7"            TO     MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT     =   1
                         OR     FLG-KYUSEI-OK  =   1
                 INITIALIZE                     SRYACCT-REC
                 MOVE    SRY-HOSPNUM      TO    ACCT-HOSPNUM
                 MOVE    SRY-NYUGAIKBN    TO    ACCT-NYUGAIKBN
                 MOVE    SRY-PTID         TO    ACCT-PTID
                 MOVE    SRY-SRYKA        TO    ACCT-SRYKA
                 MOVE    SRY-SRYYM        TO    ACCT-SRYYM
                 MOVE    SRY-ZAINUM       TO    ACCT-ZAINUM
                 MOVE    SRYACCT-REC      TO    MCPDATA-REC
                 MOVE    "tbl_sryacct"    TO    MCP-TABLE
                 MOVE    "key31"          TO    MCP-PATHNAME
                 PERFORM   900-DBSELECT-SEC
                 IF     MCP-RC            =  ZERO
                    MOVE    "tbl_sryacct"    TO    MCP-TABLE
                    MOVE    "key31"          TO    MCP-PATHNAME
                    PERFORM   900-DBFETCH-SEC
                    IF      MCP-RC        =       ZERO
                        MOVE    MCPDATA-REC  TO  SRYACCT-REC
                        MOVE    WRK-KYUSEIYMD(7:2)  TO  DAY-IDX2
                        IF  ( ACCT-DAY(1 DAY-IDX2)  NOT =  ZERO )
                        AND ( ACCT-HKNCOMBI =  RECE200-HKNCOMBI )
                           MOVE   1   TO  FLG-KYUSEI-OK
                           MOVE   ACCT-NYUGAIKBN
                                      TO  WRK-KYUSEI-NYUGAIKBN
                           MOVE   ACCT-SRYKA
                                      TO  WRK-KYUSEI-SRYKA
                           MOVE   ACCT-ZAINUM
                                      TO  WRK-KYUSEI-ZAINUM
                        END-IF
                    END-IF
                 END-IF
                 MOVE    "tbl_sryacct"    TO    MCP-TABLE
                 MOVE    "key31"          TO    MCP-PATHNAME
                 PERFORM   900-CLOSE-SEC
      *
                 MOVE    "tbl_sryact"          TO      MCP-TABLE
                 MOVE    "key7"                TO      MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_sryact"          TO      MCP-TABLE
           MOVE    "key7"                TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           END-PERFORM
      *++++
           IF      WRK-KYUSEI-ZAINUM    NOT =    ZERO
              INITIALIZE                           SRYACT-REC
              MOVE    RECE200-HOSPNUM        TO    SRY-HOSPNUM
              MOVE    WRK-KYUSEI-NYUGAIKBN   TO    SRY-NYUGAIKBN
              MOVE    RECE200-PTID           TO    SRY-PTID
              MOVE    WRK-KYUSEI-SRYKA       TO    SRY-SRYKA
              MOVE    WRK-KYUSEIYMD(1:6)     TO    SRY-SRYYM
              MOVE    WRK-KYUSEI-ZAINUM      TO    SRY-ZAINUM
              MOVE    SRYACT-REC             TO    MCPDATA-REC
              MOVE    "tbl_sryact"           TO    MCP-TABLE
              MOVE    "key2"                 TO    MCP-PATHNAME
              PERFORM   900-DBSELECT-SEC
              IF     MCP-RC            =  ZERO
                 MOVE    "tbl_sryact"        TO    MCP-TABLE
                 MOVE    "key2"              TO    MCP-PATHNAME
                 PERFORM  900-SRYACT-READ-SEC
                 PERFORM  UNTIL   FLG-SRYACT     =   1
                   PERFORM  VARYING  IDX12  FROM  1  BY  1
                             UNTIL  (IDX12             >    5   )  OR
                                    (SRY-SRYCD(IDX12)  =   SPACE)
                    IF   RECE200-SRYYM >= "202008"
                      PERFORM  200111-KYUSEIHASSYO-KSCOM1-SEC
                    ELSE
                      IF  ((SRY-SRYCD(IDX12)(1:1)     =   "8"  )  OR
                           (SRY-SRYCD(IDX12)(1:3)     =   "008"))
                      AND ( SRY-SRYCD(IDX12)(1:4) NOT =
                                              "0085" AND "0086" )
                       IF   SRY-INPUTNUM(IDX12)   NOT =   ZERO
                         INITIALIZE                      PTCOM-REC
                         MOVE    SRY-HOSPNUM         TO  PTCOM-HOSPNUM
                         MOVE    SRY-PTID            TO  PTCOM-PTID
                         MOVE    SRY-ZAINUM          TO  PTCOM-ZAINUM
                         MOVE    SRY-SRYCD(IDX12)    TO  PTCOM-SRYCD
                         MOVE    SRY-INPUTNUM(IDX12) TO  PTCOM-RENNUM
                         PERFORM 900-PTCOM-READ-SEC
                         ADD     1     TO    IDZ
                         MOVE    PTCOM-INPUTCOMENT
                                                TO  WK-FREE-NAME(IDZ)
                         PERFORM   VARYING   IDX13   FROM   300   BY  -1
                                    UNTIL    IDX13    <    1
                           IF  WK-FREE-NAME(IDZ)(IDX13:1)  NOT =  SPACE
                             COMPUTE  WK-FREE-YUKOKETA(IDZ)  =
                                      IDX13    /    2
                             MOVE     1     TO      IDX13
                           END-IF
                         END-PERFORM
                       ELSE
                         MOVE  SRY-SRYCD(IDX12) TO  WRK-TENSU-SRYCD
                         MOVE  SRY-SRYYM        TO  WRK-TENSU-SRYYM
                         PERFORM      900-TENSU-TBL-SEC
                         ADD     1           TO  IDZ
                         MOVE    TNS-NAME    TO  WK-FREE-NAME(IDZ)
                         PERFORM   VARYING   IDX13   FROM   300   BY  -1
                                    UNTIL    IDX13    <    1
                           IF  WK-FREE-NAME(IDZ)(IDX13:1)  NOT =  SPACE
                             COMPUTE  WK-FREE-YUKOKETA(IDZ)  =
                                      IDX13    /    2
                             MOVE     1     TO      IDX13
                           END-IF
                         END-PERFORM
                       END-IF
                       IF   FLG-COMOKIKAE  =   1
                          EVALUATE  SRY-SRYCD(IDX12)
                            WHEN     "840000042"
                              IF   FLG-COMOKIKAE2 = ZERO
                                 MOVE    1    TO  FLG-COMOKIKAE2
                                 MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                                 MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                                 COMPUTE  IDZ  =  IDZ - 1
                              END-IF
                            WHEN     "840000101"
                              IF   FLG-COMOKIKAE2 = ZERO
                                 MOVE    2    TO  FLG-COMOKIKAE2
                                 MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                                 MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                                 COMPUTE  IDZ  =  IDZ - 1
                              END-IF
                            WHEN     "840000058"
                              IF   FLG-COMOKIKAE2 = ZERO
                                 MOVE    3    TO  FLG-COMOKIKAE2
                                 MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                                 MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                                 COMPUTE  IDZ  =  IDZ - 1
                              END-IF
                          END-EVALUATE
                       END-IF
                       IF   FLG-COMOKIKAE  =   1
                          IF  SRY-SRYCD(IDX12) = "840000042" OR
                                                 "840000101" OR
                                                 "840000058"
                            MOVE    1    TO   FLG-COMARI2
                          ELSE
                            MOVE    1    TO   FLG-COMARI
                          END-IF
                       ELSE
                            MOVE    1    TO   FLG-COMARI
                       END-IF
                      END-IF
                    END-IF
                   END-PERFORM
                   MOVE    "tbl_sryact"      TO    MCP-TABLE
                   MOVE    "key2"            TO    MCP-PATHNAME
                   PERFORM   900-SRYACT-READ-SEC
                 END-PERFORM
              END-IF
              INITIALIZE                     MCPAREA
              MOVE    "tbl_sryact"      TO    MCP-TABLE
              MOVE    "key2"            TO    MCP-PATHNAME
              PERFORM   900-CLOSE-SEC
           END-IF
      *++++
           IF      FLG-COMARI    =    ZERO
              INITIALIZE                      SANTEIPLUS-REC
              MOVE    RECE200-HOSPNUM     TO  SANTEIPLUS-HOSPNUM
              MOVE    RECE200-PTID        TO  SANTEIPLUS-PTID
              MOVE    WRK-KYUSEIYMD(1:6)  TO  SANTEIPLUS-SRYYM
              MOVE    WRK-SRYCD           TO  SANTEIPLUS-SRYCD
              MOVE    ZERO                TO  SANTEIPLUS-NYUGAIKBN
              MOVE    ZERO                TO  SANTEIPLUS-SRYKA
              MOVE    RECE200-HKNCOMBI    TO  SANTEIPLUS-HKNCOMBINUM
              MOVE    WRK-KYUSEIYMD(7:2)  TO  SANTEIPLUS-DAYKEY
              MOVE    SANTEIPLUS-REC      TO  MCPDATA-REC
              MOVE    "tbl_santeiplus"    TO  MCP-TABLE
              MOVE    "key2"              TO  MCP-PATHNAME
              PERFORM 900-DBSELECT-SEC
              IF      MCP-RC               =       ZERO
                 MOVE    "tbl_santeiplus"     TO  MCP-TABLE
                 MOVE    "key2"               TO  MCP-PATHNAME
                 PERFORM  900-SANTEIPLUS-READ-SEC
                 PERFORM  UNTIL   FLG-SANTEIPLUS     =   1
      *           リハコメントの終了日と診療月をチェック
      *           （履歴番号＞０のデータ）
                  IF     SANTEIPLUS-RENNUM   NOT =  ZERO
                   IF  ( SANTEIPLUS-ENDYMD       =  SPACE         )
                   OR  ((SANTEIPLUS-ENDYMD   NOT =  SPACE        ) AND
                        (SANTEIPLUS-ENDYMD(1:6) >=  RECE200-SRYYM))
                    IF   RECE200-SRYYM >= "202008"
                      PERFORM  200111-KYUSEIHASSYO-KSCOM2-SEC
                    ELSE
                     IF  SANTEIPLUS-COMMENT  NOT =  SPACE
                      ADD     1                 TO  IDZ
                      MOVE  SANTEIPLUS-COMMENT  TO  WK-FREE-NAME(IDZ)
                      PERFORM   VARYING   IDX13   FROM   300   BY  -1
                                 UNTIL    IDX13    <     1
                        IF  WK-FREE-NAME(IDZ)(IDX13:1)  NOT =  SPACE
                          COMPUTE  WK-FREE-YUKOKETA(IDZ)  =
                                   IDX13    /    2
                          MOVE     1     TO      IDX13
                        END-IF
                      END-PERFORM
                     END-IF
                     IF   FLG-COMOKIKAE  =    1
                     AND  FLG-COMARI2    =   ZERO
                      IF   SANTEIPLUS-COMMENT(1:8)  = "手術　日"
                        IF   FLG-COMOKIKAE2 = ZERO
                           MOVE    1    TO  FLG-COMOKIKAE2
                           MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                           MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                           COMPUTE  IDZ  =  IDZ - 1
                        END-IF
                      END-IF
                      IF   SANTEIPLUS-COMMENT(1:12) = "急性増悪　日"
                        IF   FLG-COMOKIKAE2 = ZERO
                           MOVE    2    TO  FLG-COMOKIKAE2
                           MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                           MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                           COMPUTE  IDZ  =  IDZ - 1
                        END-IF
                      END-IF
                      IF   SANTEIPLUS-COMMENT(1:8) = "診断　日"
                        IF   FLG-COMOKIKAE2 = ZERO
                           MOVE    3    TO  FLG-COMOKIKAE2
                           MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                           MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                           COMPUTE  IDZ  =  IDZ - 1
                        END-IF
                      END-IF
                     END-IF
                    END-IF
                   END-IF
                  END-IF
                  MOVE    "tbl_santeiplus"     TO  MCP-TABLE
                  MOVE    "key2"               TO  MCP-PATHNAME
                  PERFORM  900-SANTEIPLUS-READ-SEC
                 END-PERFORM
              END-IF
              MOVE    "tbl_santeiplus"     TO  MCP-TABLE
              MOVE    "key2"               TO  MCP-PATHNAME
              PERFORM 900-CLOSE-SEC
           END-IF
      *
           .
       20011-KYUSEIHASSYO-KENSAKU-EXT.
           EXIT.
      *
      *****************************************************************
      *    コメント検索
      *****************************************************************
       200111-KYUSEIHASSYO-KSCOM1-SEC          SECTION.
      *
           IF  (SRY-SRYCD(IDX12) = "810000001" OR "840000042"
                                OR "840000101" OR "840000058")
           OR  (SRY-SRYCD(IDX12)(1:4) = "0082" OR "0083"     )
           OR  (SRY-SRYCD(IDX12)(1:4) = "8301"               )
      *
             MOVE    SRY-SRYCD(IDX12)  TO  WRK-TENSU-SRYCD
             MOVE    SRY-SRYYM         TO  WRK-TENSU-SRYYM
             PERFORM      900-TENSU-TBL-SEC
      *
             IF   SRY-INPUTNUM(IDX12)   NOT =   ZERO
               INITIALIZE                      PTCOM-REC
               MOVE    SRY-HOSPNUM         TO  PTCOM-HOSPNUM
               MOVE    SRY-PTID            TO  PTCOM-PTID
               MOVE    SRY-ZAINUM          TO  PTCOM-ZAINUM
               MOVE    SRY-SRYCD(IDX12)    TO  PTCOM-SRYCD
               MOVE    SRY-INPUTNUM(IDX12) TO  PTCOM-RENNUM
               PERFORM 900-PTCOM-READ-SEC
               ADD     1     TO    IDZ
               MOVE    "999999999"         TO  WK-FREE-SRYCD2(IDZ)
               MOVE    PTCOM-INPUTCOMENT   TO  WK-FREE-NAME2(IDZ)
                                               WK-FREE-INPUTCOMENT2(IDZ)
      *
               IF  (SRY-SRYCD(IDX12)(1:4) = "8301")
      *********OR  (SRY-SRYCD(IDX12)(1:4) = "0083")
                 INITIALIZE                ORCSKANACHKAREA
                 MOVE  "2"             TO  KANACHK-SYORI 
                 MOVE  TNS-NAME        TO  KANACHK-MAE-INPUT
                 CALL  "ORCSKANACHK"   USING  ORCSKANACHKAREA
                 IF    ( KANACHK-RC      =   ZERO )
                 AND   ( KANACHK-MAX     >   ZERO )
                   COMPUTE IDX51 = KANACHK-MAX + 1
                   MOVE  PTCOM-INPUTCOMENT(IDX51:)
                                       TO  WK-FREE-INPUTCOMENT2(IDZ)
                 ELSE
                   MOVE  PTCOM-INPUTCOMENT
                                       TO  WK-FREE-INPUTCOMENT2(IDZ)
                 END-IF
      ***********IF   SRY-SRYCD(IDX12)(1:4) = "8301"
      ***********  MOVE  SRY-SRYCD(IDX12)  TO  WK-FREE-SRYCD2(IDZ)
      ***********END-IF
               END-IF
      *
               IF   SRY-SRYCD(IDX12)(1:4) = "8301"
                 IF      PTCOM-INPUTSTRING  =  SPACE
                   IF  TNS-FORMALNAME  =  SPACE
                     CONTINUE
                   ELSE
                     COMPUTE IDX52 = TNS-YUKOKETA * 2 + 1
                     INITIALIZE              ORCSKANACHKAREA
                     MOVE    "2"         TO  KANACHK-SYORI
                     STRING  TNS-FORMALNAME
                                     DELIMITED  BY  SPACE
                             PTCOM-INPUTCOMENT(IDX52:)
                                     DELIMITED  BY  SPACE
                                     INTO    KANACHK-MAE-INPUT
                     END-STRING
                     CALL    "ORCSKANACHK"   USING  ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                       MOVE  KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                         TO  WK-FREE-NAME2(IDZ)
                     END-IF
                   END-IF
                 ELSE
                   IF  TNS-FORMALNAME  =  SPACE
                     INITIALIZE              ORCSKANACHKAREA
                     MOVE    "2"         TO  KANACHK-SYORI
                     STRING  TNS-NAME
                                     DELIMITED  BY  SPACE
                             PTCOM-INPUTSTRING
                                     DELIMITED  BY  SPACE
                                     INTO    KANACHK-MAE-INPUT
                     END-STRING
                     CALL    "ORCSKANACHK"   USING  ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                       MOVE  KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                         TO  WK-FREE-NAME2(IDZ)
                     END-IF
                   ELSE
                     INITIALIZE              ORCSKANACHKAREA
                     MOVE    "2"         TO  KANACHK-SYORI
                     STRING  TNS-FORMALNAME
                                     DELIMITED  BY  SPACE
                             PTCOM-INPUTSTRING
                                     DELIMITED  BY  SPACE
                                     INTO    KANACHK-MAE-INPUT
                     END-STRING
                     CALL    "ORCSKANACHK"   USING  ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                       MOVE  KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                         TO  WK-FREE-NAME2(IDZ)
                     END-IF
                   END-IF
                   MOVE    PTCOM-INPUTSTRING
                                         TO  WK-FREE-INPUTCOMENT2(IDZ)
                 END-IF
               END-IF
             ELSE
               ADD     1           TO  IDZ
               MOVE    "999999999" TO  WK-FREE-SRYCD2(IDZ)
               MOVE    TNS-NAME    TO  WK-FREE-NAME2(IDZ)
                                       WK-FREE-INPUTCOMENT2(IDZ)
             END-IF
             PERFORM   VARYING   IDX13   FROM   300   BY  -1
                        UNTIL    IDX13    <    1
               IF  WK-FREE-NAME2(IDZ)(IDX13:1)  NOT =  SPACE
                 COMPUTE  WK-FREE-YUKOKETA2(IDZ) = IDX13  /  2
                 MOVE     1      TO  IDX13
               END-IF
             END-PERFORM
      *
             IF   SRY-SRYCD(IDX12) = "840000042" OR "840000101"
                                                 OR "840000058"
               MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
               MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
               MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
               MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
               COMPUTE  IDZ  =  IDZ - 1
               EVALUATE  SRY-SRYCD(IDX12)
                 WHEN     "840000042"
                   IF   FLG-COMOKIKAE  =   1
                   AND  FLG-COMOKIKAE2 =  ZERO
                     MOVE   1    TO   FLG-COMOKIKAE2
                   END-IF
                 WHEN     "840000101"
                   IF   FLG-COMOKIKAE  =   1
                   AND  FLG-COMOKIKAE2 =  ZERO
                     MOVE   2    TO   FLG-COMOKIKAE2
                   END-IF
                 WHEN     "840000058"
                   IF   FLG-COMOKIKAE  =   1
                   AND  FLG-COMOKIKAE2 =  ZERO
                     MOVE   3    TO   FLG-COMOKIKAE2
                   END-IF
               END-EVALUATE
             END-IF
             IF   FLG-COMOKIKAE  =   1
               IF   SRY-SRYCD(IDX12) = "840000042" OR "840000101"
                                                   OR "840000058"
                     MOVE   1    TO   FLG-COMARI2
               ELSE
                     MOVE   1    TO   FLG-COMARI
               END-IF
             ELSE
               IF   SRY-SRYCD(IDX12) = "840000042" OR "840000101"
                                                   OR "840000058"
                     CONTINUE
               ELSE
                     MOVE   1    TO   FLG-COMARI
               END-IF
             END-IF
           END-IF
      *
           .
       200111-KYUSEIHASSYO-KSCOM1-EXT.
           EXIT.
      *
      *****************************************************************
      *    コメント検索
      *****************************************************************
       200111-KYUSEIHASSYO-KSCOM2-SEC          SECTION.
      *
           IF   SANTEIPLUS-COMMENT  NOT =  SPACE
             ADD     1           TO  IDZ
             MOVE    "999999999" TO  WK-FREE-SRYCD2(IDZ)
             MOVE    SANTEIPLUS-COMMENT
                                 TO  WK-FREE-NAME2(IDZ)
                                     WK-FREE-INPUTCOMENT2(IDZ)
             PERFORM   VARYING   IDX13   FROM   300   BY  -1
                        UNTIL    IDX13    <    1
               IF  WK-FREE-NAME2(IDZ)(IDX13:1)  NOT =  SPACE
                 COMPUTE  WK-FREE-YUKOKETA2(IDZ) = IDX13  /  2
                 MOVE     1      TO  IDX13
               END-IF
             END-PERFORM
           END-IF
      *
           IF   SANTEIPLUS-COMMENT(1:8)  = "手術　日"
             MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
             MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
             MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
             MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
             COMPUTE  IDZ  =  IDZ - 1
             IF   FLG-COMOKIKAE  =   1
             AND  FLG-COMARI2    =  ZERO
             AND  FLG-COMOKIKAE2 =  ZERO
               MOVE   1   TO   FLG-COMOKIKAE2
             END-IF
           END-IF
           IF   SANTEIPLUS-COMMENT(1:12) = "急性増悪　日"
             MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
             MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
             MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
             MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
             COMPUTE  IDZ  =  IDZ - 1
             IF   FLG-COMOKIKAE  =   1
             AND  FLG-COMARI2    =  ZERO
             AND  FLG-COMOKIKAE2 =  ZERO
               MOVE   2   TO   FLG-COMOKIKAE2
             END-IF
           END-IF
           IF   SANTEIPLUS-COMMENT(1:8) = "診断　日"
             MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
             MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
             MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
             MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
             COMPUTE  IDZ  =  IDZ - 1
             IF   FLG-COMOKIKAE  =   1
             AND  FLG-COMARI2    =  ZERO
             AND  FLG-COMOKIKAE2 =  ZERO
               MOVE   3   TO   FLG-COMOKIKAE2
             END-IF
           END-IF
      *
           .
       200111-KYUSEIHASSYO-KSCOM2-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集
      *****************************************************************
       20011-HASSYO-COMMENT-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO        TO  IDX-RECE230
           MOVE    SPACE       TO  WRK-RECE230XX-REC
           INITIALIZE              WRK-RECE230XX-REC
      *
           ADD     1           TO  IDX-RECE230
           MOVE    "810000001" TO  WRK-RECE230XX-SRYCD(IDX-RECE230 1)
           MOVE    ZERO        TO  WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
      *
           EVALUATE      WRK-SRYCD
             WHEN       CONS-KYUSEI
               MOVE    19   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE    "脳血管疾患急性発症　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    21   TO  IDC1
               MOVE    27   TO  IDC2
               MOVE    33   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               COMPUTE WRK-ZAINUM    =    99980000
                                     +   (IDX16 + 31)
               MOVE    "40" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI
               MOVE    23   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE    "心大血管疾患リハ：治療開始　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    29   TO  IDC1
               MOVE    35   TO  IDC2
               MOVE    41   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE  "早期・初期リハ加算：発症　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE  "早期・初期リハ加算：手術　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE  "早期・初期リハ加算：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-NOUKE
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    21  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "脳血管疾患等リハ：発症　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    21  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "脳血管疾患等リハ：手術　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    23  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE
                       "脳血管疾患等リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    21  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "脳血管疾患等リハ：診断　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-HAIYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       1
                 WHEN       3
                   MOVE    20  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "廃用症候群リハ：診断　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE
                       "廃用症候群リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-HAIYO-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE  "早期・初期リハ加算：発症　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE  "早期・初期リハ加算：手術　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE  "早期・初期リハ加算：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-UNDOKI
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    18  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "運動器リハ：発症　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    19  TO  IDC1
                   MOVE    25  TO  IDC2
                   MOVE    31  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    18  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "運動器リハ：手術　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    19  TO  IDC1
                   MOVE    25  TO  IDC2
                   MOVE    31  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    20  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "運動器リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    18  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "運動器リハ：診断　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    19  TO  IDC1
                   MOVE    25  TO  IDC2
                   MOVE    31  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-KOKYUKI
               MOVE    20   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE    "呼吸器リハ：治療開始　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    23   TO  IDC1
               MOVE    29   TO  IDC2
               MOVE    35   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-KOKYUKI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE  "早期・初期リハ加算：発症　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE  "早期・初期リハ加算：手術　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE  "早期・初期リハ加算：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SESSYOKU
               MOVE    21   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE    "摂食機能療法：治療開始　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    25   TO  IDC1
               MOVE    31   TO  IDC2
               MOVE    37   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-NANBYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    19  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "難病患者リハ：発症　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    21  TO  IDC1
                   MOVE    27  TO  IDC2
                   MOVE    33  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    19  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "難病患者リハ：手術　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    21  TO  IDC1
                   MOVE    27  TO  IDC2
                   MOVE    33  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    21  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE    "難病患者リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SYOGAI
               MOVE    21   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE    "障害児（者）リハ：発症　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    25   TO  IDC1
               MOVE    31   TO  IDC2
               MOVE    37   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
           END-EVALUATE
      *
           PERFORM   VARYING    IDX12   FROM    1   BY  1
                      UNTIL   ( IDX12               >   49    )
                       OR     ( WK-FREE-NAME(IDX12) =   SPACE )
                ADD    1       TO  IDX-RECE230
                MOVE   "810000001"
                               TO  WRK-RECE230XX-SRYCD(IDX-RECE230 1)
                MOVE   ZERO    TO  WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
                MOVE   WK-FREE-YUKOKETA(IDX12)
                               TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                MOVE   WK-FREE-NAME(IDX12)
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
           END-PERFORM
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
                INITIALIZE                       RECE2309-REC
                MOVE    RECE200-KEY          TO  RECE2309-KEY1
                MOVE    WRK-ZAINUM           TO  RECE2309-ZAINUM
                MOVE    WRK-SRYKBN           TO  RECE2309-SRYKBN
                ADD     1                    TO  WRK-RENNUM
                MOVE    WRK-RENNUM           TO  RECE2309-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE230  =    1)
                   ADD         1             TO    IDX-RECE230
                   IF (WRK-RECE230XX-SRYCD(IDX-RECE230 1) = SPACE)
                   OR (IDX-RECE230                        >  100 )
                       MOVE    1             TO    FLG-WRKRECE230
                   ELSE
                       MOVE  WRK-RECE230XX-SRYACT-TBL (IDX-RECE230 1)
                                        TO   RECE2309-SRYACT-TBL (IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE2309-SRYCD(1)  NOT =  SPACE
                   WRITE   RECE2309-REC
                   ADD     1            TO   CNT-RECE2309
                END-IF
           END-PERFORM
      *
      *
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
           MOVE    WRK-ZAINUM          TO  RECE2209-ZAINUM
           MOVE    WRK-SRYKBN          TO  RECE2209-SRYKBN
      ***  MOVE    RECE200-HKNCOMBI    TO  RECE2209-HKNCOMBI
           MOVE    WRK-CNT-MEISAI      TO  RECE2209-MEISAISU
      *
           WRITE   RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           .
       20011-HASSYO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集
      *****************************************************************
       20011-HASSYO-COM-201905-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO        TO  IDX-RECE230
           MOVE    SPACE       TO  WRK-RECE230XX-REC
           INITIALIZE              WRK-RECE230XX-REC
      *
           ADD     1           TO  IDX-RECE230
           MOVE    "810000001" TO  WRK-RECE230XX-SRYCD(IDX-RECE230 1)
           MOVE    ZERO        TO  WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
      *
           EVALUATE      WRK-SRYCD
             WHEN       CONS-KYUSEI
               MOVE    21   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "脳血管疾患急性発症　　　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    25   TO  IDC1
               MOVE    31   TO  IDC2
               MOVE    37   TO  IDC3
               MOVE    21   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               COMPUTE WRK-ZAINUM    =    99980000
                                     +   (IDX16 + 31)
               MOVE    "40" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI
               MOVE    25   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "心大血管疾患リハ：治療開始　　　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    33   TO  IDC1
               MOVE    39   TO  IDC2
               MOVE    45   TO  IDC3
               MOVE    29   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                 MOVE "早期・初期リハ加算：発症　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                 MOVE "早期・初期リハ加算：手術　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    26  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
             MOVE "早期・初期リハ加算：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    35  TO  IDC1
                   MOVE    41  TO  IDC2
                   MOVE    47  TO  IDC3
                   MOVE    31  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-NOUKE
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    23  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "脳血管疾患等リハ：発症　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    23  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "脳血管疾患等リハ：手術　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    25  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "脳血管疾患等リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    33  TO  IDC1
                   MOVE    39  TO  IDC2
                   MOVE    45  TO  IDC3
                   MOVE    29  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    23  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "脳血管疾患等リハ：診断　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-HAIYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       1
                 WHEN       3
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "廃用症候群リハ：診断　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   MOVE    23  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "廃用症候群リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-HAIYO-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "早期・初期リハ加算：発症　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "早期・初期リハ加算：手術　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    26  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
           MOVE "早期・初期リハ加算：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    35  TO  IDC1
                   MOVE    41  TO  IDC2
                   MOVE    47  TO  IDC3
                   MOVE    31  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-UNDOKI
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    20  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "運動器リハ：発症　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   MOVE    19  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    20  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "運動器リハ：手術　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   MOVE    19  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    22  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "運動器リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   MOVE    23  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    20  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "運動器リハ：診断　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   MOVE    19  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-KOKYUKI
               MOVE    22   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "呼吸器リハ：治療開始　　　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    27   TO  IDC1
               MOVE    33   TO  IDC2
               MOVE    39   TO  IDC3
               MOVE    23   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-KOKYUKI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                 MOVE "早期・初期リハ加算：発症　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    24  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                 MOVE "早期・初期リハ加算：手術　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    26  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
             MOVE "早期・初期リハ加算：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    35  TO  IDC1
                   MOVE    41  TO  IDC2
                   MOVE    47  TO  IDC3
                   MOVE    31  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SESSYOKU
               MOVE    23   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "摂食機能療法：治療開始　　　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    29   TO  IDC1
               MOVE    35   TO  IDC2
               MOVE    41   TO  IDC3
               MOVE    25   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-NANBYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    21  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "難病患者リハ：発症　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   MOVE    21  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    21  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "難病患者リハ：手術　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   MOVE    21  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    23  TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE "難病患者リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SYOGAI
               MOVE    23   TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "障害児（者）リハ：発症　　　　　年　　月　　日"
                            TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
               MOVE    29   TO  IDC1
               MOVE    35   TO  IDC2
               MOVE    41   TO  IDC3
               MOVE    25   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
           END-EVALUATE
      *
           PERFORM   VARYING    IDX12   FROM    1   BY  1
                      UNTIL   ( IDX12               >   49    )
                       OR     ( WK-FREE-NAME(IDX12) =   SPACE )
                ADD    1       TO  IDX-RECE230
                MOVE   "810000001"
                               TO  WRK-RECE230XX-SRYCD(IDX-RECE230 1)
                MOVE   ZERO    TO  WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
                MOVE   WK-FREE-YUKOKETA(IDX12)
                               TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                MOVE   WK-FREE-NAME(IDX12)
                               TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
           END-PERFORM
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
                INITIALIZE                       RECE2309-REC
                MOVE    RECE200-KEY          TO  RECE2309-KEY1
                MOVE    WRK-ZAINUM           TO  RECE2309-ZAINUM
                MOVE    WRK-SRYKBN           TO  RECE2309-SRYKBN
                ADD     1                    TO  WRK-RENNUM
                MOVE    WRK-RENNUM           TO  RECE2309-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE230  =    1)
                   ADD         1             TO    IDX-RECE230
                   IF (WRK-RECE230XX-SRYCD(IDX-RECE230 1) = SPACE)
                   OR (IDX-RECE230                        >  100 )
                       MOVE    1             TO    FLG-WRKRECE230
                   ELSE
                       MOVE  WRK-RECE230XX-SRYACT-TBL (IDX-RECE230 1)
                                        TO   RECE2309-SRYACT-TBL (IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE2309-SRYCD(1)  NOT =  SPACE
                   WRITE   RECE2309-REC
                   ADD     1            TO   CNT-RECE2309
                END-IF
           END-PERFORM
      *
      *
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
           MOVE    WRK-ZAINUM          TO  RECE2209-ZAINUM
           MOVE    WRK-SRYKBN          TO  RECE2209-SRYKBN
      ***  MOVE    RECE200-HKNCOMBI    TO  RECE2209-HKNCOMBI
           MOVE    WRK-CNT-MEISAI      TO  RECE2209-MEISAISU
      *
           WRITE   RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           .
       20011-HASSYO-COM-201905-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集（年月日）
      *****************************************************************
       200111-HASSYO-COMMENT-DATE-SEC          SECTION.
      *
           INITIALIZE                         STS-AREA-DAY
           INITIALIZE                         LNK-DAY2-AREA
           MOVE    "21"                   TO  LNK-DAY2-IRAI
           MOVE    WRK-KYUSEIYMD          TO  LNK-DAY2-YMD
           CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                          LNK-DAY2-AREA
           IF      STS-DAY-RC1            =   ZERO
              MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                       TO  WRK-RECE230XX-NAME(IDX-RECE230 1)(IDC1:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                       TO  WRK-RECE230XX-NAME(IDX-RECE230 1)(IDC2:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                       TO  WRK-RECE230XX-NAME(IDX-RECE230 1)(IDC3:4)
              END-IF
              IF   RECE200-SRYYM >= "201905"
                 MOVE    LNK-DAY2-EDTYMD2-G
                       TO  WRK-RECE230XX-NAME(IDX-RECE230 1)(IDC4:4)
              END-IF
           END-IF
      *
           .
       200111-HASSYO-COMMENT-DATE-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集
      *  ＃202008選択式コメント対応
      *****************************************************************
       20011-HASSYO-COM-202008-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO        TO  IDX-RECE230
           MOVE    SPACE       TO  WRK-RECE230XX-REC
           INITIALIZE              WRK-RECE230XX-REC
      *
           MOVE    ZERO        TO  FLG-COM-HENSYU
           MOVE    ZERO        TO  FLG-COM-HENSYU2
           EVALUATE      WRK-SRYCD
             WHEN       CONS-SINDAI
               MOVE   68            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   IF   RECE200-RSKSN-SYOKI-SIN  =  1
                     MOVE   74            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-SIN  =  1
                     MOVE   75            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       1
                   IF   RECE200-RSKSN-SYOKI-SIN  =  1
                     MOVE   574           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-SIN  =  1
                     MOVE   575           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       2
                   IF   RECE200-RSKSN-SYOKI-SIN  =  1
                     MOVE   1074          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-SIN  =  1
                     MOVE   1075          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-NOUKE
               IF  RECE200-SRYYM >= "202010"
                 EVALUATE   FLG-COMOKIKAE2
                   WHEN       0
                   WHEN       3
                     IF  (RECE200-SRYYM  >= "202204")
                     AND (FLG-COMOKIKAE2  =  3      )
                       MOVE 2070      TO  IDX-JIDO
                     ELSE
                       MOVE   70      TO  IDX-JIDO
                     END-IF
                   WHEN       1
                     MOVE   1070      TO  IDX-JIDO
                   WHEN       2
                     MOVE   1570      TO  IDX-JIDO
                 END-EVALUATE
               ELSE
                     MOVE     70      TO  IDX-JIDO
               END-IF
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-HAIYO
               MOVE   73            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-HAIYO-K
               MOVE     1   TO  FLG-COM-HENSYU
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   IF   RECE200-RSKSN-SYOKI-HAI  =  1
                     MOVE   74            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     1           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-HAI  =  1
                     MOVE   75            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     2           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                 WHEN       1
                   IF   RECE200-RSKSN-SYOKI-HAI  =  1
                     MOVE   574           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     1           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-HAI  =  1
                     MOVE   575           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     2           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                 WHEN       2
                   IF   RECE200-RSKSN-SYOKI-HAI  =  1
                     MOVE   1074          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     1           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-HAI  =  1
                     MOVE   1075          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     2           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-UNDOKI
               IF  RECE200-SRYYM >= "202010"
                 EVALUATE   FLG-COMOKIKAE2
                   WHEN       0
                   WHEN       3
                     IF  (RECE200-SRYYM  >= "202204")
                     AND (FLG-COMOKIKAE2  =  3      )
                       MOVE 2071      TO  IDX-JIDO
                     ELSE
                       MOVE   71      TO  IDX-JIDO
                     END-IF
                   WHEN       1
                     MOVE   1071      TO  IDX-JIDO
                   WHEN       2
                     MOVE   1571      TO  IDX-JIDO
                 END-EVALUATE
               ELSE
                     MOVE     71      TO  IDX-JIDO
               END-IF
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-KOKYUKI
               MOVE   69            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-KOKYUKI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   IF   RECE200-RSKSN-SYOKI-KOK  =  1
                     MOVE   74            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-KOK  =  1
                     MOVE   75            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       1
                   IF   RECE200-RSKSN-SYOKI-KOK  =  1
                     MOVE   574           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-KOK  =  1
                     MOVE   575           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       2
                   IF   RECE200-RSKSN-SYOKI-KOK  =  1
                     MOVE   1074          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE200-RSKSN-SOUKI-KOK  =  1
                     MOVE   1075          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
             WHEN       CONS-SESSYOKU
               MOVE   72            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               MOVE    "80" TO  WRK-SRYKBN
           END-EVALUATE
      *
      *    疾患名編集
           IF  FLG-COM-HENSYU = ZERO
             PERFORM 200111-HASSYO-COM-202008X-SEC
           END-IF
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
                PERFORM 800-RECE200-SET2309-SEC
                MOVE    WRK-ZAINUM           TO  RECE2309-ZAINUM
                MOVE    WRK-SRYKBN           TO  RECE2309-SRYKBN
                ADD     1                    TO  WRK-RENNUM
                MOVE    WRK-RENNUM           TO  RECE2309-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE230  =    1)
                   ADD         1             TO    IDX-RECE230
                   IF (WRK-RECE230XX-SRYCD(IDX-RECE230 1) = SPACE)
                   OR (IDX-RECE230                        >  100 )
                       MOVE    1             TO    FLG-WRKRECE230
                   ELSE
                       MOVE  WRK-RECE230XX-SRYACT-TBL (IDX-RECE230 1)
                                        TO   RECE2309-SRYACT-TBL (IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE2309-SRYCD(1)  NOT =  SPACE
                   WRITE   RECE2309-REC
                   ADD     1            TO   CNT-RECE2309
                END-IF
           END-PERFORM
      *
           PERFORM 800-RECE200-SET2209-SEC
           MOVE    WRK-ZAINUM          TO  RECE2209-ZAINUM
           MOVE    WRK-SRYKBN          TO  RECE2209-SRYKBN
           MOVE    WRK-CNT-MEISAI      TO  RECE2209-MEISAISU
      *
           WRITE   RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           .
       20011-HASSYO-COM-202008-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集（疾患名編集）
      *  ＃202008選択式コメント対応
      *****************************************************************
       200111-HASSYO-COM-202008X-SEC          SECTION.
      *
           PERFORM  VARYING  IDX12  FROM  1  BY  1
                     UNTIL  (IDX12                >   50  )
                       OR   (WK-FREE-NAME2(IDX12) =  SPACE)
               IF  WK-FREE-SRYCD2(IDX12) = "999999999"
                 MOVE    ZERO      TO  IDX-JIDO
                 EVALUATE  WRK-SRYCD
                   WHEN     CONS-SINDAI
                      MOVE    568  TO  IDX-JIDO
                   WHEN     CONS-NOUKE
                      MOVE    570  TO  IDX-JIDO
                   WHEN     CONS-HAIYO
                      MOVE    573  TO  IDX-JIDO
                   WHEN     CONS-UNDOKI
                      MOVE    571  TO  IDX-JIDO
                   WHEN     CONS-KOKYUKI
                      MOVE    569  TO  IDX-JIDO
                   WHEN     CONS-SESSYOKU
                      MOVE    572  TO  IDX-JIDO
                   WHEN     CONS-HAIYO-K
                     IF  RECE200-SRYYM >= "202204"
                      IF   FLG-COM-HENSYU2  =  1
                       MOVE  1574  TO  IDX-JIDO
                      END-IF
                      IF   FLG-COM-HENSYU2  =  2
                       MOVE  1575  TO  IDX-JIDO
                      END-IF
                     END-IF
                 END-EVALUATE
                 PERFORM  200111-RECECOMMENT-IDXGET-SEC
                 MOVE   WK-FREE-INPUTCOMENT2(IDX12)
                                   TO  WRK-RECECOM-COMMENT
      *
                 INITIALIZE                  ORCSRECECOMMENTAREA
                 MOVE  WRK-RECECOM-AREA   TO ORCSRECECOMMENT-IN-AREA
                 CALL  "ORCSRECECOMMENT"  USING  ORCSRECECOMMENTAREA
                                                 SPA-AREA
                 IF    LNK-RECECOMMENT-RC  =  ZERO
                   ADD  1    TO IDX-RECE230
                   MOVE LNK-RECECOMMENT-SRYCD
                             TO WRK-RECE230XX-SRYCD(IDX-RECE230 1)
                   MOVE ZERO TO WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
                   MOVE LNK-RECECOMMENT-YUKOKETA
                             TO WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                   MOVE LNK-RECECOMMENT-NAME
                             TO WRK-RECE230XX-NAME(IDX-RECE230 1)
                   MOVE LNK-RECECOMMENT-INPUTCOMMENT
                             TO WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)
                 END-IF
               ELSE
                 ADD    1    TO IDX-RECE230
                 MOVE   WK-FREE-SRYCD2(IDX12)
                             TO WRK-RECE230XX-SRYCD(IDX-RECE230 1)
                 MOVE   ZERO TO WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
                 MOVE   WK-FREE-YUKOKETA2(IDX12)
                             TO WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                 MOVE   WK-FREE-NAME2(IDX12)
                             TO WRK-RECE230XX-NAME(IDX-RECE230 1)
                 MOVE   WK-FREE-INPUTCOMENT2(IDX12)
                             TO WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)
               END-IF
           END-PERFORM
      *
           .
       200111-HASSYO-COM-202008X-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ発症日があるか判定
      *****************************************************************
       20011-RIHABIRIHASSYO-HANTEI-SEC          SECTION.
      *
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT2
           MOVE     SPACE    TO     WRK-RIHASANTEI-END
           INITIALIZE               TBL-RIHASANTEI-DAY-END
           INITIALIZE               TBL-RIHASANTEI-DAY-END2
           INITIALIZE               TBL-RIHASANTEI-DAY-END3
      *
      *    リハ終了日
      *
      *    算定履歴検索
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEI-PTID
           MOVE    WRK-SRYCD2          TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    RECE200-HKNCOMBI    TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
      *
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM        900-SANTEI-READ-SEC
      *
                PERFORM   UNTIL  ( FLG-SANTEI          =  1 ) OR
                                 ( FLG-KYUSEI-COMMENT2 =  1 )
      *
                 IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                  IF   SANTEI-SRYYM  =  RECE200-SRYYM
                   PERFORM   VARYING   IDX3   FROM   1  BY   1
                              UNTIL    IDX3    >    31
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                        MOVE    1   TO   TB-RIHASANTEI-DAY-END(IDX3)
      *
                     END-IF
      *
                   END-PERFORM
                  ELSE
                   PERFORM   VARYING   IDX3   FROM  31  BY  -1
                              UNTIL  ( IDX3                <   1 )
                                OR   ( FLG-KYUSEI-COMMENT2 =   1 )
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                        MOVE  SANTEI-SRYYM  TO  WRK-RIHASANTEI-END(1:6)
                        MOVE  IDX3          TO  WRK-RIHASANTEI-END(7:2)
      *
                        MOVE  1             TO  FLG-KYUSEI-COMMENT2
      *
                     END-IF
      *
                   END-PERFORM
                  END-IF
                 END-IF
      *
                 MOVE    "tbl_santei"        TO  MCP-TABLE
                 MOVE    "key3"              TO  MCP-PATHNAME
                 PERFORM        900-SANTEI-READ-SEC
      *
                END-PERFORM
      *
           END-IF
      *
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      ********
      *
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT2
           MOVE     ZERO     TO     WRK-KYUSEIYMD
           INITIALIZE               TBL-RIHASANTEI-DAY
           MOVE     SPACE    TO     WRK-RIHASANTEI-YMD
           MOVE     SPACE    TO     WRK-RIHASANTEI-YMD2
           MOVE     SPACE    TO     WRK-RIHASANTEI-YMD3
           MOVE     ZERO     TO     WRK-RIHASANTEI41-FLG
      *
      *    リハ開始日
      *
      *    当月の先頭のリハビリ算定日
           MOVE     ZERO           TO  RIHA-ST2
           PERFORM  VARYING  RIHA-IDX  FROM   1  BY   1
                     UNTIL   RIHA-IDX    >   31
             IF     TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO
               MOVE     RIHA-IDX   TO  RIHA-ST2
               MOVE     31         TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    算定履歴検索
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEI-PTID
           MOVE    WRK-SRYCD           TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    RECE200-HKNCOMBI    TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
      *
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM        900-SANTEI-READ-SEC
      *
                PERFORM   UNTIL  ( FLG-SANTEI          =  1 ) OR
                                 ( FLG-KYUSEI-COMMENT2 =  1 )
      *
                 IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                  IF   SANTEI-SRYYM  =  RECE200-SRYYM
                   PERFORM  VARYING   IDX3   FROM   1  BY  1
                             UNTIL    IDX3    >    31
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                         MOVE   1     TO  TB-RIHASANTEI-DAY(IDX3)
      *
                         MOVE   1     TO  FLG-KYUSEI-COMMENT
      *
                         IF    (SANTEI-SRYYM = "200604")
                         AND   (IDX3         =  1      )
                            MOVE    1    TO   WRK-RIHASANTEI41-FLG
                         END-IF
      **>                IF    (SANTEI-SRYYM  NOT = "200604")
      **>                AND   (IDX3              =  1      )
      **>                   MOVE   1     TO   FLG-KYUSEI-COMMENT2
      **>                END-IF
      *
                     END-IF
      *
                   END-PERFORM
                  ELSE
                   PERFORM  VARYING   IDX3   FROM  31  BY  -1
                             UNTIL   ( IDX3                <   1 )
                               OR    ( FLG-KYUSEI-COMMENT2 =   1 )
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
                       PERFORM  200111-RIHA-SANTEIPLUS-SEC
                     END-IF
      *
                     IF  (SANTEI-DAY(IDX3)  NOT =  ZERO)
                     AND (FLG-SANTEIPLUS-HANTEI =  ZERO)
                       MOVE  SANTEI-SRYYM    TO WRK-RIHASANTEI-YMD2(1:6)
                       MOVE  IDX3            TO WRK-RIHASANTEI-YMD2(7:2)
                       IF   (WRK-RIHASANTEI-YMD   = SPACE     )
                       OR   (WRK-RIHASANTEI-YMD   = "20060401")
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           MOVE  WRK-RIHASANTEI-YMD2
                                             TO WRK-RIHASANTEI-YMD
                           MOVE  1           TO FLG-KYUSEI-COMMENT
                           IF  (SANTEIPLUS-ENDYMD   NOT = SPACE        )
                           AND (SANTEIPLUS-ENDYMD(1:6)  = RECE200-SRYYM)
                           AND (IDX43                  >= RIHA-ST2     )
                             MOVE   1   TO TB-RIHASANTEI-DAY-END3(IDX43)
                           END-IF
                         END-IF
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           IF   (WRK-RIHASANTEI41-FLG =  1        )
                           AND  (WRK-RIHASANTEI-YMD2  < "20060401")
                             MOVE  ZERO      TO TB-RIHASANTEI-DAY(1)
                           END-IF
                         END-IF
                       ELSE
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           MOVE  WRK-RIHASANTEI-YMD2
                                             TO WRK-RIHASANTEI-YMD3
                         END-IF
                         MOVE     1          TO FLG-KYUSEI-COMMENT2
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           IF    WRK-RIHASANTEI-YMD2  = "20060401"
                             MOVE  ZERO      TO FLG-KYUSEI-COMMENT2
                           END-IF
                         END-IF
                       END-IF
                     END-IF
      *
                   END-PERFORM
                  END-IF
                 END-IF
      *
                 MOVE    "tbl_santei"        TO  MCP-TABLE
                 MOVE    "key3"              TO  MCP-PATHNAME
                 PERFORM        900-SANTEI-READ-SEC
      *
                END-PERFORM
      *
           END-IF
      *
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      ***
      *
      *    当月先頭のリハビリ算定日より前に当月のリハビリ終了日があれば
      *    前月以前の直近のリハビリ開始日をクリアする
      *    及び、
      *    当月のリハビリ終了日より前の当月のリハビリ開始日をクリアする
           IF    RIHA-ST2            NOT = ZERO
             PERFORM  VARYING  RIHA-IDX  FROM   1  BY   1
                       UNTIL   RIHA-IDX    >   31
               IF    (TB-RIHASANTEI-DAY-END(RIHA-IDX) NOT = ZERO)
               AND   (RIHA-ST2  >  RIHA-IDX                     )
                 MOVE   SPACE      TO  WRK-RIHASANTEI-YMD
                 MOVE   SPACE      TO  WRK-RIHASANTEI-YMD3
                 PERFORM  VARYING  RIHA-IDX2  FROM  1  BY  1
                           UNTIL   RIHA-IDX2    >  31
                   IF    (TB-RIHASANTEI-DAY(RIHA-IDX2)  NOT = ZERO)
                   AND   (RIHA-IDX  >= RIHA-IDX2                  )
                     MOVE  ZERO    TO  TB-RIHASANTEI-DAY(RIHA-IDX2)
                   END-IF
                 END-PERFORM
               END-IF
             END-PERFORM
           END-IF
      *
      *    リハビリ開始日を退避
           INITIALIZE                     WRK-CHECK-RIHASANTEI-AREA
           MOVE  TBL-RIHASANTEI-DAY   TO  WRK-CHECK-RIHASANTEI-DAY-OCC
           MOVE  WRK-RIHASANTEI-YMD   TO  WRK-CHECK-RIHASANTEI-YMD
           MOVE  WRK-RIHASANTEI-YMD3  TO  WRK-CHECK-RIHASANTEI-YMD3
      *
      *    当月のリハビリ開始日より後に当月のリハビリ算定日がなければ
      *    当月のリハビリ開始日をクリアする
           MOVE     ZERO       TO  FLG-OK
           PERFORM  VARYING  RIHA-IDX  FROM  31  BY  -1
                     UNTIL   RIHA-IDX    <    1
             IF     TB-RIHASANTEI-DAY(RIHA-IDX)  NOT = ZERO
               PERFORM   200111-RIHA-SANTEIPLUS2-SEC
               MOVE      ZERO  TO  FLG-OK
               PERFORM  VARYING  RIHA-IDX2  FROM  1  BY  1
                         UNTIL   RIHA-IDX2    >  31
                 IF    (TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX2) NOT = ZERO)
                 AND   (RIHA-IDX  <=  RIHA-IDX2                      )
                 AND   (IDX43     >=  RIHA-IDX2                      )
                   MOVE  ZERO  TO  TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX2)
                   MOVE  1     TO  FLG-OK
                 END-IF
               END-PERFORM
               IF   FLG-OK  =  ZERO
                 MOVE    ZERO  TO  TB-RIHASANTEI-DAY(RIHA-IDX)
               ELSE
                 IF  IDX43  NOT =  99
                   MOVE  1     TO  TB-RIHASANTEI-DAY-END2(IDX43)
                 END-IF
               END-IF
             END-IF
           END-PERFORM
      *
      *    当月の先頭のリハビリ開始日
           MOVE     ZERO           TO  RIHA-ST
           PERFORM  VARYING  RIHA-IDX  FROM   1  BY   1
                     UNTIL   RIHA-IDX    >   31
             IF     TB-RIHASANTEI-DAY(RIHA-IDX)  NOT = ZERO
               MOVE   RIHA-IDX     TO  RIHA-ST
               MOVE   31           TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    当月のリハビリ開始日に当月の終了日の入力（算定履歴で入力）
      *    があり、その中で一番月末に近い日
           MOVE     99             TO  RIHA-ED
           PERFORM  VARYING  RIHA-IDX  FROM  31  BY  -1
                     UNTIL   RIHA-IDX    <    1
             IF     TB-RIHASANTEI-DAY-END2(RIHA-IDX)  NOT = ZERO
               MOVE   RIHA-IDX     TO  RIHA-ED
               MOVE   1            TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    直近のリハビリ開始日に入力した当月の終了日（算定履歴で入力）
           MOVE     99             TO  RIHA-ED2
           PERFORM  VARYING  RIHA-IDX  FROM  31  BY  -1
                     UNTIL   RIHA-IDX    <    1
             IF     TB-RIHASANTEI-DAY-END3(RIHA-IDX)  NOT = ZERO
               MOVE   RIHA-IDX     TO  RIHA-ED2
               MOVE   1            TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    当月先頭のリハビリ開始日より前に当月のリハビリ算定日がなければ
      *    前月以前の直近のリハビリ開始日をクリアする
           MOVE     ZERO           TO  FLG-OK
           IF    WRK-RIHASANTEI-YMD  NOT = SPACE
             IF  RIHA-ST             NOT = ZERO
               PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                         UNTIL   RIHA-IDX    >  31
                 IF ((TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO) AND
                     (RIHA-ST   >  RIHA-IDX                       ))
                 OR ((TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO) AND
                     (RIHA-ED   <  RIHA-IDX                       ))
                   MOVE   1        TO  FLG-OK
                 END-IF
               END-PERFORM
               IF    FLG-OK  =  ZERO
                 MOVE     SPACE    TO  WRK-RIHASANTEI-YMD
                 MOVE     SPACE    TO  WRK-RIHASANTEI-YMD3
               ELSE
                 MOVE     ZERO     TO  FLG-OK
                 PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                           UNTIL   RIHA-IDX    >  31
                   IF  (TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO)
                   AND (RIHA-ED2  <  RIHA-IDX                       )
                     MOVE   1      TO  FLG-OK
                   END-IF
                 END-PERFORM
                 IF    FLG-OK  =  ZERO
                   MOVE     SPACE  TO  WRK-RIHASANTEI-YMD3
                 END-IF
               END-IF
             ELSE
               PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                         UNTIL   RIHA-IDX    >  31
                 IF  (TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO)
                 AND (RIHA-ED2  <  RIHA-IDX                       )
                   MOVE   1        TO  FLG-OK
                 END-IF
               END-PERFORM
               IF    FLG-OK  =  ZERO
                 MOVE     SPACE    TO  WRK-RIHASANTEI-YMD3
               END-IF
             END-IF
           END-IF
      *
           IF   (TBL-HASSYO-TAIHIYMD1-FLG  =  1)
           AND  (FLG-KYUSEI-COMMENT        =  1)
             INITIALIZE                     TBL-RIHASANTEI-DAY
             MOVE     SPACE            TO   WRK-RIHASANTEI-YMD
             MOVE     SPACE            TO   WRK-RIHASANTEI-YMD3
      *
             IF  (TBL-HASSYO-TAIHIYMD11(1) NOT = SPACE                )
             AND (TBL-HASSYO-TAIHIYMD11(1) = WRK-CHECK-RIHASANTEI-YMD
                                          OR WRK-CHECK-RIHASANTEI-YMD3)
                 CONTINUE
             ELSE
                 MOVE  SPACE  TO  TBL-HASSYO-TAIHIYMD11(1)
             END-IF
             IF  (TBL-HASSYO-TAIHIYMD11(2) NOT = SPACE                )
             AND (TBL-HASSYO-TAIHIYMD11(2) = WRK-CHECK-RIHASANTEI-YMD
                                          OR WRK-CHECK-RIHASANTEI-YMD3)
                 CONTINUE
             ELSE
                 MOVE  SPACE  TO  TBL-HASSYO-TAIHIYMD11(2)
             END-IF
      *
             IF  (TBL-HASSYO-TAIHIYMD11(1) NOT = SPACE)
             AND (TBL-HASSYO-TAIHIYMD11(2) NOT = SPACE)
               IF TBL-HASSYO-TAIHIYMD11(2) > TBL-HASSYO-TAIHIYMD11(1)
                 MOVE TBL-HASSYO-TAIHIYMD11(1) TO WRK-RIHASANTEI-YMD3
                 MOVE TBL-HASSYO-TAIHIYMD11(2) TO WRK-RIHASANTEI-YMD
               ELSE
                 MOVE TBL-HASSYO-TAIHIYMD11(2) TO WRK-RIHASANTEI-YMD3
                 MOVE TBL-HASSYO-TAIHIYMD11(1) TO WRK-RIHASANTEI-YMD
               END-IF
             ELSE
               IF TBL-HASSYO-TAIHIYMD11(1) NOT = SPACE
                 MOVE TBL-HASSYO-TAIHIYMD11(1) TO WRK-RIHASANTEI-YMD
               END-IF
               IF TBL-HASSYO-TAIHIYMD11(2) NOT = SPACE
                 MOVE TBL-HASSYO-TAIHIYMD11(2) TO WRK-RIHASANTEI-YMD
               END-IF
             END-IF
      *
             PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                       UNTIL   RIHA-IDX    >  31
               IF    (TBL-HASSYO-TAIHIYMD12(RIHA-IDX)  NOT = ZERO)
               AND   (WRK-CHECK-RIHASANTEI-DAY(RIHA-IDX)   = ZERO)
                 MOVE  ZERO  TO  TBL-HASSYO-TAIHIYMD12(RIHA-IDX)
               END-IF
             END-PERFORM
             MOVE  TBL-HASSYO-TAIHIYMD1-DAY-OCC2
                             TO  TBL-RIHASANTEI-DAY
           END-IF
      *
      ***
      *
           IF      FLG-KYUSEI-COMMENT    =      1
               IF  WRK-RIHASANTEI-YMD3 NOT = SPACE
                     MOVE   ZERO   TO  FLG-RIHA
                     MOVE   WRK-RIHASANTEI-YMD3
                                   TO  WRK-KYUSEIYMD
                     PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
                     IF     RECE200-SRYYM >= "202008"
                       PERFORM    20011-HASSYO-COM-202008-SEC
                     ELSE
                       IF   RECE200-SRYYM >= "201905"
                         PERFORM  20011-HASSYO-COM-201905-SEC
                       ELSE
                         PERFORM  20011-HASSYO-COMMENT-SEC
                       END-IF
                     END-IF
               END-IF
               IF  WRK-RIHASANTEI-YMD  NOT = SPACE
                     MOVE   1      TO  FLG-RIHA
                     MOVE   WRK-RIHASANTEI-YMD
                                   TO  WRK-KYUSEIYMD
                     PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
                     IF     RECE200-SRYYM >= "202008"
                       PERFORM    20011-HASSYO-COM-202008-SEC
                     ELSE
                       IF   RECE200-SRYYM >= "201905"
                         PERFORM  20011-HASSYO-COM-201905-SEC
                       ELSE
                         PERFORM  20011-HASSYO-COMMENT-SEC
                       END-IF
                     END-IF
               END-IF
               PERFORM   VARYING   IDX16    FROM   1   BY   1
                          UNTIL    IDX16      >   31
                 IF  TB-RIHASANTEI-DAY(IDX16)  NOT = ZERO
                     MOVE   2      TO  FLG-RIHA
                     MOVE   RECE200-SRYYM
                                   TO  WRK-KYUSEIYMD(1:6)
                     MOVE   IDX16  TO  WRK-KYUSEIYMD(7:2)
                     PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
                     IF     RECE200-SRYYM >= "202008"
                       PERFORM    20011-HASSYO-COM-202008-SEC
                     ELSE
                       IF   RECE200-SRYYM >= "201905"
                         PERFORM  20011-HASSYO-COM-201905-SEC
                       ELSE
                         PERFORM  20011-HASSYO-COMMENT-SEC
                       END-IF
                     END-IF
                 END-IF
               END-PERFORM
           END-IF
      *
           .
       20011-RIHABIRIHASSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ・算定履歴付加判定
      *    （リハ開始日の終了日と診療月をチェック）（履歴番号＝０のデータ）
      *****************************************************************
       200111-RIHA-SANTEIPLUS-SEC          SECTION.
      *
           MOVE    ZERO                TO  FLG-SANTEIPLUS-HANTEI
           MOVE    ZERO                TO  IDX43
      *
           INITIALIZE                      SANTEIPLUS-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEIPLUS-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEIPLUS-PTID
           MOVE    SANTEI-SRYYM        TO  SANTEIPLUS-SRYYM
           MOVE    WRK-SRYCD           TO  SANTEIPLUS-SRYCD
           MOVE    ZERO                TO  SANTEIPLUS-NYUGAIKBN
           MOVE    ZERO                TO  SANTEIPLUS-SRYKA
           MOVE    RECE200-HKNCOMBI    TO  SANTEIPLUS-HKNCOMBINUM
           MOVE    IDX3                TO  SANTEIPLUS-DAYKEY
           MOVE    SANTEIPLUS-REC      TO  MCPDATA-REC
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC           =  ZERO
             MOVE  "tbl_santeiplus"    TO  MCP-TABLE
             MOVE  "key4"              TO  MCP-PATHNAME
             PERFORM  900-SANTEIPLUS-READ-SEC
             IF    FLG-SANTEIPLUS   =  ZERO
               MOVE  SANTEIPLUS-ENDYMD(7:2)  TO  IDX43
               IF  ((SANTEIPLUS-ENDYMD   NOT =  SPACE        ) AND
                    (SANTEIPLUS-ENDYMD(1:6)  <  RECE200-SRYYM))
               OR  ((SANTEIPLUS-ENDYMD   NOT =  SPACE        ) AND
                    (SANTEIPLUS-ENDYMD(1:6)  =  RECE200-SRYYM) AND
                    (IDX43                   <  RIHA-ST2     ))
                  MOVE     1           TO  FLG-SANTEIPLUS-HANTEI
               END-IF
             END-IF
           END-IF
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       200111-RIHA-SANTEIPLUS-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ・算定履歴付加判定
      *    （リハ開始日の終了日と診療月をチェック）（履歴番号＝０のデータ）
      *****************************************************************
       200111-RIHA-SANTEIPLUS2-SEC          SECTION.
      *
           MOVE    99                  TO  IDX43
      *
           INITIALIZE                      SANTEIPLUS-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEIPLUS-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEIPLUS-PTID
           MOVE    RECE200-SRYYM       TO  SANTEIPLUS-SRYYM
           MOVE    WRK-SRYCD           TO  SANTEIPLUS-SRYCD
           MOVE    ZERO                TO  SANTEIPLUS-NYUGAIKBN
           MOVE    ZERO                TO  SANTEIPLUS-SRYKA
           MOVE    RECE200-HKNCOMBI    TO  SANTEIPLUS-HKNCOMBINUM
           MOVE    RIHA-IDX            TO  SANTEIPLUS-DAYKEY
           MOVE    SANTEIPLUS-REC      TO  MCPDATA-REC
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC           =  ZERO
             MOVE  "tbl_santeiplus"    TO  MCP-TABLE
             MOVE  "key4"              TO  MCP-PATHNAME
             PERFORM  900-SANTEIPLUS-READ-SEC
             IF    FLG-SANTEIPLUS   =  ZERO
               IF   (SANTEIPLUS-ENDYMD   NOT =  SPACE        )
               AND  (SANTEIPLUS-ENDYMD(1:6)  =  RECE200-SRYYM)
                 MOVE  SANTEIPLUS-ENDYMD(7:2)  TO  IDX43
               END-IF
             END-IF
           END-IF
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       200111-RIHA-SANTEIPLUS2-EXT.
           EXIT.
      *
      *****************************************************************
      *    初診（同日複数診療科）があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SYODOU-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-SYODOU-COMMENT   =    "1"
                INITIALIZE             WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"       TO     WRK-JIDO-SETCOMFLG
                END-IF
                MOVE       99       TO     FLG-COMMENT
                PERFORM    20011-SYODOU-COMMENT-SEC
           END-IF
      *
           .
       2001-SYODOU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    初診（同日複数診療科）のコメント編集
      *****************************************************************
       20011-SYODOU-COMMENT-SEC          SECTION.
      *
           MOVE       ZERO       TO   IDZ
           INITIALIZE            WRK-FREE-AREA2
      *
           PERFORM   VARYING   IDX    FROM   1   BY   1
                      UNTIL   (IDX                       >   10  )
                       OR     (RECE220-SYODOU-SRYKA(IDX) =  SPACE)
      *
      *      診療科の取得
             INITIALIZE                      SYS-1005-REC
             MOVE    "1005"              TO  SYS-1005-KANRICD
             MOVE    RECE220-SYODOU-SRYKA(IDX)
                                         TO  SYS-1005-KBNCD
             MOVE    RECE200-SRYYM       TO  SYS-1005-STYUKYMD(1:6)
             MOVE    "01"                TO  SYS-1005-STYUKYMD(7:2)
             MOVE    SYS-1005-STYUKYMD   TO  SYS-1005-EDYUKYMD
             MOVE    SPA-HOSPNUM         TO  SYS-1005-HOSPNUM
             MOVE    SYS-1005-REC        TO  MCPDATA-REC
             MOVE    "tbl_syskanri"      TO  MCP-TABLE
             MOVE    "key10"             TO  MCP-PATHNAME
             PERFORM   900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"      TO  MCP-TABLE
               MOVE    "key10"             TO  MCP-PATHNAME
               PERFORM  900-SYSKANRI-READ-SEC
               IF      FLG-SYSKANRI      =   ZERO
                IF   RECE200-SRYYM  >= "202008"
                  MOVE   1             TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   SYS-1005-SRYKANAME(1:40)
                                       TO  WRK-RECECOM-COMMENT
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
                ELSE
                  ADD   1                TO  IDZ
                  MOVE  "複初算定診療科："
                                         TO  WK-FREE-NAME2(IDZ)(1:16)
                  MOVE  SYS-1005-SRYKANAME(1:40)
                                         TO  WK-FREE-NAME2(IDZ)(17:40)
                  PERFORM  VARYING  IDW  FROM  300  BY  -1
                            UNTIL   IDW    <   1
                    IF   WK-FREE-NAME2(IDZ)(IDW:1)  NOT =  SPACE
                      COMPUTE WK-FREE-YUKOKETA2(IDZ) =  IDW  /   2
                      MOVE    1   TO    IDW
                    END-IF
                  END-PERFORM
                END-IF
               END-IF
             END-IF
      *
             INITIALIZE                        MCPAREA
             MOVE    "tbl_syskanri"      TO  MCP-TABLE
             MOVE    "key10"             TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
           END-PERFORM
      *
           PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           .
       20011-SYODOU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    薬剤管理指導料があるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-YAKUKANSIDO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-YAKUKAN-COMMENT   =    "1"
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-YAKUKANSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院栄養食事指導料があるか判定
      *****************************************************************
       2001-NYUEIYOSIDO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-NYUEIYO-COMMENT   =    "1"
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-NYUEIYOSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院前訪問指導料があるか判定
      *  （202006で自動記載取り止め）
      *****************************************************************
       2001-HOUMONSIDO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-HOUMON-COMMENT   =    "1"
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-HOUMONSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    傷病手当金意見書交付料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SYOBYO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-SYOBYO-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     99      TO     FLG-COMMENT
                  MOVE     5       TO     IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                ELSE
                  MOVE     4       TO     FLG-COMMENT
                END-IF
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-SYOBYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養費同意書交付料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-RYOYO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-RYOYO-COMMENT    =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     99      TO     FLG-COMMENT
                  MOVE     6       TO     IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                ELSE
                  MOVE     4       TO     FLG-COMMENT
                END-IF
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-RYOYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院時服薬指導加算を算定時、当月に薬剤管理指導料がなく、前月
      *    に薬剤管理指導料があるか判定
      *****************************************************************
       2001-TAIIN-HANTEI-SEC          SECTION.
      *
           MOVE      ZERO            TO      WRK-TUKI-YAKUKAN
           MOVE      ZERO            TO      WRK-DAY-YAKUKAN
      *
           IF      RECE220-FLG-TAIIN-COMMENT   =    "1"
      *
             MOVE      ZERO            TO      FLG-YAKUKAN-COMMENT
      *
             IF    RECE200-SRYYM    >=  "200804"
               PERFORM   VARYING   IDX6   FROM    1   BY    1
                          UNTIL  ( IDX6   >   TBL-YAKUKAN-MAX       )
                            OR   ( FLG-YAKUKAN-COMMENT   =    1     )
                  MOVE   TBL-YAKUKAN(IDX6)     TO  WRK-YAKUKAN-SRYCD
                  PERFORM  2001X-TAIIN-HANTEI-TOUGETU-SEC
               END-PERFORM
             ELSE
                  MOVE   CONS-YAKUKAN-COMMENT  TO  WRK-YAKUKAN-SRYCD
                  PERFORM  2001X-TAIIN-HANTEI-TOUGETU-SEC
             END-IF
      *
             IF      FLG-YAKUKAN-COMMENT   =   ZERO
      *
               MOVE      ZERO            TO      WRK-ZENYYMM
      *
               INITIALIZE                      STS-AREA-DAY
               INITIALIZE                      LNK-DAY6-AREA
               MOVE    "61"                TO  LNK-DAY6-IRAI
               MOVE    RECE200-SRYYM       TO  LNK-DAY6-KIJUN(1:6)
               MOVE    "01"                TO  LNK-DAY6-KIJUN(7:2)
               MOVE    "2"                 TO  LNK-DAY6-ZOGENPTN
               MOVE     -1                 TO  LNK-DAY6-ZOGEN
               CALL    "ORCSDAY"           USING   STS-AREA-DAY
                                                   LNK-DAY6-AREA
               MOVE    LNK-DAY6-KEISAN(1:6)
                                           TO  WRK-ZENYYMM
      *
               IF    RECE200-SRYYM    >=  "200804"
                 PERFORM   VARYING   IDX6   FROM    1   BY    1
                            UNTIL    IDX6   >   TBL-YAKUKAN-MAX
                    MOVE   TBL-YAKUKAN(IDX6)     TO  WRK-YAKUKAN-SRYCD
                    PERFORM  2001Y-TAIIN-HANTEI-ZENGETU-SEC
                 END-PERFORM
               ELSE
                    MOVE   CONS-YAKUKAN-COMMENT  TO  WRK-YAKUKAN-SRYCD
                    PERFORM  2001Y-TAIIN-HANTEI-ZENGETU-SEC
               END-IF
      *
             END-IF
      *
             MOVE       99                TO     FLG-COMMENT
             IF    WRK-DAY-YAKUKAN    NOT   =   ZERO
                MOVE    2                 TO     FLG-HANTEI
                MOVE    WRK-ZENYYMM(5:2)  TO     WRK-TUKI-YAKUKAN
             ELSE
                MOVE    1                 TO     FLG-HANTEI
             END-IF
             PERFORM    20011-TAIIN-COMMENT-SEC
      *
           END-IF
      *
           .
       2001-TAIIN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    当月に薬剤管理指導料があるかチェック
      *****************************************************************
       2001X-TAIIN-HANTEI-TOUGETU-SEC          SECTION.
      *
           INITIALIZE                    SRYACT-REC
           MOVE    RECE200-HOSPNUM   TO  SRY-HOSPNUM
           MOVE    RECE200-NYUGAIKBN TO  SRY-NYUGAIKBN
           MOVE    RECE200-PTID      TO  SRY-PTID
           MOVE    RECE200-SRYYM     TO  SRY-SRYYM
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (1)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (2)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (3)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (4)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (5)
           MOVE    SRYACT-REC        TO  MCPDATA-REC
           MOVE    "tbl_sryact"      TO  MCP-TABLE
           MOVE    "key7"            TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
      *
           IF      MCP-RC               =       ZERO
             MOVE    "tbl_sryact"    TO  MCP-TABLE
             MOVE    "key7"          TO  MCP-PATHNAME
             PERFORM  900-SRYACT-READ-SEC
             IF      FLG-SRYACT  =  ZERO
                   MOVE    1         TO  FLG-YAKUKAN-COMMENT
             END-IF
           END-IF
      *
           MOVE    "tbl_sryact"      TO  MCP-TABLE
           MOVE    "key7"            TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       2001X-TAIIN-HANTEI-TOUGETU-EXT.
           EXIT.
      *
      *****************************************************************
      *    前月に薬剤管理指導料があるかチェック
      *****************************************************************
       2001Y-TAIIN-HANTEI-ZENGETU-SEC          SECTION.
      *
           INITIALIZE                    SRYACT-REC
           MOVE    RECE200-HOSPNUM   TO  SRY-HOSPNUM
           MOVE    RECE200-NYUGAIKBN TO  SRY-NYUGAIKBN
           MOVE    RECE200-PTID      TO  SRY-PTID
           MOVE    WRK-ZENYYMM       TO  SRY-SRYYM
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (1)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (2)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (3)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (4)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (5)
           MOVE    SRYACT-REC        TO  MCPDATA-REC
           MOVE    "tbl_sryact"      TO  MCP-TABLE
           MOVE    "key7"            TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
      *
           IF      MCP-RC               =       ZERO
               MOVE    "tbl_sryact"     TO   MCP-TABLE
               MOVE    "key7"           TO   MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
      *
               PERFORM  UNTIL   FLG-SRYACT   =  1
      *
                 INITIALIZE                  SRYACCT-REC
                 MOVE    SRY-HOSPNUM    TO   ACCT-HOSPNUM
                 MOVE    SRY-NYUGAIKBN  TO   ACCT-NYUGAIKBN
                 MOVE    SRY-PTID       TO   ACCT-PTID
                 MOVE    SRY-SRYKA      TO   ACCT-SRYKA
                 MOVE    SRY-SRYYM      TO   ACCT-SRYYM
                 MOVE    SRY-ZAINUM     TO   ACCT-ZAINUM
                 MOVE    SRYACCT-REC    TO   MCPDATA-REC
                 MOVE    "tbl_sryacct"  TO   MCP-TABLE
                 MOVE    "key31"        TO   MCP-PATHNAME
                 PERFORM   900-DBSELECT-SEC
      *
                 IF  MCP-RC               =  ZERO
                     MOVE    "tbl_sryacct"  TO  MCP-TABLE
                     MOVE    "key31"        TO  MCP-PATHNAME
                     PERFORM   900-DBFETCH-SEC
                     IF      MCP-RC       =  ZERO
                       MOVE    MCPDATA-REC  TO  SRYACCT-REC
                       PERFORM   VARYING   IDX  FROM   1   BY   1
                                  UNTIL    IDX    >   31
                         IF    ACCT-DAY(1 IDX)  NOT =  ZERO
                            IF    IDX   >   WRK-DAY-YAKUKAN
                                MOVE  IDX   TO  WRK-DAY-YAKUKAN
                            END-IF
                         END-IF
                       END-PERFORM
                     END-IF
                 END-IF
      *
                 INITIALIZE                  MCPAREA
                 MOVE    "tbl_sryacct"  TO   MCP-TABLE
                 MOVE    "key31"        TO   MCP-PATHNAME
                 PERFORM   900-CLOSE-SEC
      *
                 MOVE    "tbl_sryact"   TO   MCP-TABLE
                 MOVE    "key7"         TO   MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
      *
               END-PERFORM
           END-IF
      *
           MOVE    "tbl_sryact"      TO      MCP-TABLE
           MOVE    "key7"            TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       2001Y-TAIIN-HANTEI-ZENGETU-EXT.
           EXIT.
      *
      *****************************************************************
      *    介護支援連携指導料があるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-KAISIEN-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-KAISIEN-COMMENT   =    "1"
               MOVE    ZERO                TO  FLG-KAISIEN
               MOVE    SPACE               TO  WRK-KAISIEN-FSANTEIYMD
               INITIALIZE                      SANTEI-REC
               MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID        TO  SANTEI-PTID
               MOVE    CONS-KAISIEN        TO  SANTEI-SRYCD
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM   900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"      TO  MCP-TABLE
                 MOVE    "key3"            TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI   =  1 )
                            OR    ( FLG-KAISIEN  =  1 )
                   IF   SANTEI-SRYYM  <  RECE200-SRYYM
                     PERFORM  VARYING   IDX3   FROM  31  BY  -1
                               UNTIL  ( IDX3        <   1 )
                                OR    ( FLG-KAISIEN =   1 )
                       IF   SANTEI-DAY(IDX3)  NOT =  ZERO
                         MOVE    1    TO  FLG-KAISIEN
                         MOVE   SANTEI-SRYYM
                                      TO  WRK-KAISIEN-FSANTEIYMD(1:6)
                         MOVE   IDX3  TO  WRK-KAISIEN-FSANTEIYMD(7:2)
                       END-IF
                     END-PERFORM
                   END-IF
                   MOVE    "tbl_santei"    TO  MCP-TABLE
                   MOVE    "key3"          TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM  900-CLOSE-SEC
      *
               IF   FLG-KAISIEN  =   1
      *           剤の最初の日検索
                  MOVE       SPACE         TO  WRK-KAISIEN-YMD
                  PERFORM  VARYING   IDX3   FROM  1  BY  1
                            UNTIL    IDX3  >   31
                    IF   RECE220-KAISU(1 IDX3)  NOT =  ZERO
                       MOVE  RECE200-SRYYM TO  WRK-KAISIEN-YMD(1:6)
                       MOVE  IDX3          TO  WRK-KAISIEN-YMD(7:2)
                       MOVE  31            TO  IDX3
                    END-IF
                  END-PERFORM
      *
                  IF   WRK-KAISIEN-YMD   NOT =  SPACE
                    MOVE  WRK-KAISIEN-YMD     TO  WRK-KAISIEN-CHECKYMD
                    PERFORM  2001-KAISIEN-PTNYUINRRK-CHK-SEC
                    MOVE  WRK-KAISIEN-RRKNUM  TO  WRK-KAISIEN-RRKNUM-X
      *
                    MOVE  WRK-KAISIEN-FSANTEIYMD
                                              TO  WRK-KAISIEN-CHECKYMD
                    PERFORM  2001-KAISIEN-PTNYUINRRK-CHK-SEC
                    MOVE  WRK-KAISIEN-RRKNUM  TO  WRK-KAISIEN-RRKNUM-Y
      *
                    IF  (WRK-KAISIEN-RRKNUM-X  NOT = ZERO           )
                    AND (WRK-KAISIEN-RRKNUM-Y  NOT = ZERO           )
                    AND (WRK-KAISIEN-RRKNUM-X = WRK-KAISIEN-RRKNUM-Y)
                       CONTINUE
                    ELSE
                       MOVE   ZERO   TO   FLG-KAISIEN
                    END-IF
                  ELSE
                       MOVE   ZERO   TO   FLG-KAISIEN
                  END-IF
               END-IF
      *
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-KAISIEN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院履歴チェック
      *****************************************************************
       2001-KAISIEN-PTNYUINRRK-CHK-SEC          SECTION.
      *
           MOVE    ZERO                  TO  WRK-KAISIEN-RRKNUM
           INITIALIZE                        PTNYUINRRK-REC
           MOVE    RECE200-HOSPNUM       TO  PTNYUINRRK-HOSPNUM
           MOVE    RECE200-PTID          TO  PTNYUINRRK-PTID
           MOVE    WRK-KAISIEN-CHECKYMD  TO  PTNYUINRRK-NYUINYMD
           MOVE    WRK-KAISIEN-CHECKYMD  TO  PTNYUINRRK-TAIINYMD
           MOVE    PTNYUINRRK-REC        TO  MCPDATA-REC
           MOVE    "tbl_ptnyuinrrk"      TO  MCP-TABLE
           MOVE    "key11"               TO  MCP-PATHNAME
           PERFORM  900-DBSELECT-SEC
           IF      MCP-RC   =   ZERO
             MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
             MOVE    "key11"             TO  MCP-PATHNAME
             PERFORM  900-PTNYUINRRK-READ-SEC
             IF    FLG-PTNYUINRRK  =  ZERO
                MOVE  PTNYUINRRK-RRKNUM  TO  WRK-KAISIEN-RRKNUM
             END-IF
           END-IF
           MOVE    "tbl_ptnyuinrrk"      TO  MCP-TABLE
           MOVE    "key11"               TO  MCP-PATHNAME
           PERFORM  900-CLOSE-SEC
      *
           .
       2001-KAISIEN-PTNYUINRRK-CHK-EXT.
           EXIT.
      *
      *****************************************************************
      *    集団栄養食事指導料があるか判定
      *****************************************************************
       2001-SYUEIYO-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-SYUEIYO-COMMENT   =    "1"
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-SYUEIYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    人工内耳機器調整加算があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-JINNAI-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-JINNAI-COMMENT   NOT =   SPACE
             MOVE      ZERO                TO  FLG-JINNAI-COMMENT
             MOVE      SPACE               TO  WRK-JINNAI-YMD
             PERFORM   VARYING   IDX   FROM    1   BY  1
                        UNTIL   (IDX                 >  2)
                         OR     (FLG-JINNAI-COMMENT  =  1)
               INITIALIZE                      SANTEI-REC
               MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID        TO  SANTEI-PTID
               EVALUATE  RECE220-FLG-JINNAI-COMMENT
                 WHEN      "1"
                       MOVE  CONS-JINNAI1  TO  SANTEI-SRYCD
                 WHEN      "2"
                   EVALUATE  IDX
                     WHEN     1
                       MOVE  CONS-JINNAI2  TO  SANTEI-SRYCD
                     WHEN     2
                       MOVE  CONS-JINNAI1  TO  SANTEI-SRYCD
                   END-EVALUATE
               END-EVALUATE
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"      TO  MCP-TABLE
                 MOVE    "key3"            TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                             OR   ( FLG-JINNAI-COMMENT  =   1 )
                   IF   SANTEI-SRYYM  <  RECE200-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-JINNAI-YMD(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-JINNAI-YMD(7:2)
                     MOVE    1              TO  FLG-JINNAI-COMMENT
                   END-IF
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               EVALUATE  RECE220-FLG-JINNAI-COMMENT
                 WHEN      "1"
                   MOVE     2              TO  IDX
               END-EVALUATE
             END-PERFORM
      *
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             IF   RECE200-SRYYM  >= "202008"
               MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
             END-IF
             MOVE       99      TO     FLG-COMMENT
      *
             MOVE      ZERO     TO     IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             IF   RECE200-SRYYM  >= "202008"
              IF   WRK-JINNAI-YMD   NOT =  SPACE
                MOVE   17            TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                MOVE   WRK-JINNAI-YMD
                                     TO  WRK-RECECOM-YMD
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              ELSE
                MOVE   517           TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              END-IF
             ELSE
              IF   WRK-JINNAI-YMD   NOT =  SPACE
                ADD        1       TO     IDZ
                MOVE       19      TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "前回算定年月日　　　　　年　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
                MOVE       21      TO     IDX41
                MOVE       27      TO     IDX42
                MOVE       33      TO     IDX48
                MOVE       17      TO     IDX49
      *
                INITIALIZE                      STS-AREA-DAY
                INITIALIZE                      LNK-DAY2-AREA
                MOVE    "21"                TO  LNK-DAY2-IRAI
                MOVE    WRK-JINNAI-YMD      TO  LNK-DAY2-YMD
                CALL    "ORCSDAY"    USING      STS-AREA-DAY
                                                LNK-DAY2-AREA
                IF      STS-DAY-RC1  =  ZERO
                  MOVE  LNK-DAY2-EDTYMD1-Y  TO  WRK-TAIHI-XX
                  INITIALIZE                    ORCSKANACHKAREA
                  MOVE  "2"                 TO  KANACHK-SYORI
                  MOVE  WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
                  CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                  IF    KANACHK-RC  =  ZERO
                    MOVE  KANACHK-OUT-INPUT(1:4)
                               TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                  END-IF
      *
                  MOVE  LNK-DAY2-EDTYMD1-M  TO  WRK-TAIHI-XX
                  INITIALIZE                    ORCSKANACHKAREA
                  MOVE  "2"                 TO  KANACHK-SYORI
                  MOVE  WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
                  CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                  IF    KANACHK-RC  =  ZERO
                    MOVE  KANACHK-OUT-INPUT(1:4)
                               TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                  END-IF
      *
                  MOVE  LNK-DAY2-EDTYMD1-D  TO  WRK-TAIHI-XX
                  INITIALIZE                    ORCSKANACHKAREA
                  MOVE  "2"                 TO  KANACHK-SYORI
                  MOVE  WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
                  CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                  IF    KANACHK-RC  =  ZERO
                    MOVE  KANACHK-OUT-INPUT(1:4)
                               TO  WK-FREE-NAME2(IDZ)(IDX48:4)
                  END-IF
      *
                  MOVE  LNK-DAY2-EDTYMD2-G
                               TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                END-IF
              ELSE
                ADD        1       TO     IDZ
                MOVE       6       TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "（初回算定）"  TO     WK-FREE-NAME2(IDZ)
              END-IF
             END-IF
      *
             PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           END-IF
      *
           .
       2001-JINNAI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    心臓ペースメーカー指導管理料（ロ）があるか判定
      *    遠隔モニタリング加算があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SINPESUR-HANTEI-SEC          SECTION.
      *
           IF   ((RECE200-SRYYM                  <    "201804"  ) AND
                 (RECE220-FLG-SINPESUR-COMMENT   =    "1" OR "2"))
           OR   ((RECE200-SRYYM                 >=    "201804"  ) AND
                 (RECE220-FLG-SINPESUR-COMMENT   =    "1" OR "2") AND
                 (RECE220-FLG-SINPESU-COMMENT    =     SPACE    ))
           OR   ((RECE200-SRYYM                 >=    "201804"  ) AND
                 (RECE220-FLG-SINPESU-COMMENT    =    "A"       ) AND
                 (RECE220-FLG-SINPESUR-COMMENT   =    "A"       ))
           OR   ((RECE200-SRYYM                 >=    "201804"  ) AND
                 (RECE220-FLG-SINPESU-COMMENT    =    "B"       ) AND
                 (RECE220-FLG-SINPESUR-COMMENT   =    "B"       ) AND
                 (RECE220-FLG-YOUATU-COMMENT     =     SPACE    ))
             MOVE    ZERO                TO  FLG-SINPESUR-COMMENT
             MOVE    SPACE               TO  WRK-SINPESUR-YMD
             INITIALIZE                      SANTEI-REC
             MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID        TO  SANTEI-PTID
             EVALUATE  RECE220-FLG-SINPESUR-COMMENT
               WHEN     "1"
                 MOVE    CONS-SINPESUR1  TO  SANTEI-SRYCD
               WHEN     "2"
                 MOVE    CONS-SINPESUR2  TO  SANTEI-SRYCD
               WHEN     "A"
                 MOVE    CONS-ZAISAN     TO  SANTEI-SRYCD
               WHEN     "B"
                 MOVE    CONS-YOUATU2    TO  SANTEI-SRYCD
             END-EVALUATE
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI           =   1 )
                             OR   ( FLG-SINPESUR-COMMENT =   1 )
      *
                   IF   SANTEI-SRYYM  <  RECE200-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-SINPESUR-YMD(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-SINPESUR-YMD(7:2)
                     MOVE    1              TO  FLG-SINPESUR-COMMENT
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
      *
             IF   RECE220-FLG-SINPESUR-COMMENT  =  "A"
               MOVE    ZERO              TO  FLG-SINPESUR-COMMENT2
               MOVE    SPACE             TO  WRK-SINPESUR-YMD2
               INITIALIZE                    SANTEI-REC
               MOVE    RECE200-HOSPNUM   TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID      TO  SANTEI-PTID
               MOVE    CONS-ZAISAN2      TO  SANTEI-SRYCD
               MOVE    ZERO              TO  SANTEI-NYUGAIKBN
               MOVE    ZERO              TO  SANTEI-SRYKA
               MOVE    ZERO              TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC        TO  MCPDATA-REC
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC            =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI            =  1 )
                             OR   ( FLG-SINPESUR-COMMENT2 =  1 )
      *
                   IF   SANTEI-SRYYM  <  RECE200-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-SINPESUR-YMD2(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-SINPESUR-YMD2(7:2)
                     MOVE    1              TO  FLG-SINPESUR-COMMENT2
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               IF   WRK-SINPESUR-YMD2  NOT =  SPACE
                 IF  ( WRK-SINPESUR-YMD      =  SPACE          )
                 OR  ((WRK-SINPESUR-YMD  NOT =  SPACE         ) AND
                      (WRK-SINPESUR-YMD  <   WRK-SINPESUR-YMD2))
                   MOVE  WRK-SINPESUR-YMD2  TO  WRK-SINPESUR-YMD
                 END-IF
               END-IF
             END-IF
      *
             IF   WRK-SINPESUR-YMD   NOT =  SPACE
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                END-IF
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                IF   RECE200-SRYYM  >= "202008"
                 EVALUATE  RECE220-FLG-SINPESUR-COMMENT
                  WHEN     "2"
                     MOVE   20            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-SINPESUR-YMD
                                          TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  WHEN     "A"
                     MOVE   25            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-SINPESUR-YMD(1:6)
                                          TO  WRK-RECECOM-YMD(1:6)
                     MOVE   "00"          TO  WRK-RECECOM-YMD(7:2)
                     PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  WHEN     "B"
                     MOVE   27            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-SINPESUR-YMD(1:6)
                                          TO  WRK-RECECOM-YMD(1:6)
                     MOVE   "00"          TO  WRK-RECECOM-YMD(7:2)
                     PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 END-EVALUATE
                ELSE
                 ADD        1        TO     IDZ
                 EVALUATE  RECE220-FLG-SINPESUR-COMMENT
                  WHEN     "1"
                  WHEN     "2"
                     IF   RECE200-SRYYM >= "201905"
                       MOVE    15    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "前回算定年月　　　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    19    TO     IDX41
                       MOVE    25    TO     IDX42
                       MOVE    15    TO     IDX49
                     ELSE
                       MOVE    13    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "前回算定年月　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    15    TO     IDX41
                       MOVE    21    TO     IDX42
                     END-IF
                  WHEN     "A"
                  WHEN     "B"
                     IF   RECE200-SRYYM >= "201905"
                       MOVE    20    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "指導管理料前回算定年月　　　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    29    TO     IDX41
                       MOVE    35    TO     IDX42
                       MOVE    25    TO     IDX49
                     ELSE
                       MOVE    18    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "指導管理料前回算定年月　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    25    TO     IDX41
                       MOVE    31    TO     IDX42
                     END-IF
                 END-EVALUATE
      *
                 INITIALIZE                         STS-AREA-DAY
                 INITIALIZE                         LNK-DAY2-AREA
                 MOVE    "21"                   TO  LNK-DAY2-IRAI
                 MOVE    WRK-SINPESUR-YMD       TO  LNK-DAY2-YMD
                 CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                                LNK-DAY2-AREA
                 IF      STS-DAY-RC1            =   ZERO
                   MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                        TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                        TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                   END-IF
      *
                   IF   RECE200-SRYYM >= "201905"
                      MOVE    LNK-DAY2-EDTYMD2-G
                                        TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                   END-IF
                 END-IF
                END-IF
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-SINPESUR-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    がん患者指導管理料２・３があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-GANSIDO-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-GANSIDO-COMMENT   =    "1" OR "2"
      *
             MOVE   ZERO   TO  IDX27
             INITIALIZE    WRK-GANSIDO-YMD-AREA
             EVALUATE    RECE220-FLG-GANSIDO-COMMENT
               WHEN       "1"
                 MOVE      CONS-GANSIDO1   TO  WRK-SRYCD
               WHEN       "2"
                 MOVE      CONS-GANSIDO2   TO  WRK-SRYCD
             END-EVALUATE
             PERFORM  2001-GANSIDO-HENSYU-SEC
      *
             IF   RECE200-SRYYM  >= "202204"
               EVALUATE  RECE220-FLG-GANSIDO-COMMENT
                 WHEN     "1"
                   MOVE    CONS-GANSIDO3   TO  WRK-SRYCD
                 WHEN     "2"
                   MOVE    CONS-GANSIDO4   TO  WRK-SRYCD
               END-EVALUATE
               PERFORM  2001-GANSIDO-HENSYU-SEC
             END-IF
      *
             IF   WRK-GANSIDO-YMD(1) NOT =  SPACE
      *
                IF   RECE200-SRYYM  >= "202204"
                  PERFORM   VARYING  IDX26  FROM  1  BY  1
                             UNTIL  (IDX26                  >   10  )
                              OR    (WRK-GANSIDO-YMD(IDX26) =  SPACE)
                   COMPUTE  IDZ  =  IDX26  +  1
                   PERFORM  VARYING  IDX27  FROM  IDZ  BY  1
                             UNTIL  (IDX27                  >   10  )
                              OR    (WRK-GANSIDO-YMD(IDX27) =  SPACE)
                     IF WRK-GANSIDO-YMD(IDX26) < WRK-GANSIDO-YMD(IDX27)
                       MOVE  WRK-GANSIDO-YMD(IDX26)
                                              TO WRK-GANSIDO-DATA
                       MOVE  WRK-GANSIDO-YMD(IDX27)
                                              TO WRK-GANSIDO-YMD(IDX26)
                       MOVE  WRK-GANSIDO-DATA TO WRK-GANSIDO-YMD(IDX27)
                     END-IF
                   END-PERFORM
                  END-PERFORM
                END-IF
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                END-IF
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                PERFORM  VARYING  IDX26  FROM  10  BY  -1
                          UNTIL   IDX26   <     1
                 IF  WRK-GANSIDO-YMD(IDX26)  NOT =  SPACE
                  IF   RECE200-SRYYM  >= "202008"
                   EVALUATE  RECE220-FLG-GANSIDO-COMMENT
                     WHEN      "1"
                       MOVE   29            TO  IDX-JIDO
                       PERFORM  200111-RECECOMMENT-IDXGET-SEC
                       MOVE   WRK-GANSIDO-YMD(IDX26)
                                            TO  WRK-RECECOM-YMD
                       PERFORM  200111-RECECOMMENT-HENSYU-SEC
                     WHEN      "2"
                       MOVE   30            TO  IDX-JIDO
                       PERFORM  200111-RECECOMMENT-IDXGET-SEC
                       MOVE   WRK-GANSIDO-YMD(IDX26)
                                            TO  WRK-RECECOM-YMD
                       PERFORM  200111-RECECOMMENT-HENSYU-SEC
                   END-EVALUATE
                  ELSE
                   ADD         1       TO     IDZ
                   IF   WRK-GANSIDO-YMD(IDX26)(1:6) = RECE200-SRYYM
                    IF   RECE200-SRYYM >= "201905"
                      MOVE     17      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "当月算定日　　　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     17      TO     IDX41
                      MOVE     23      TO     IDX42
                      MOVE     29      TO     IDX48
                      MOVE     13      TO     IDX49
                    ELSE
                      MOVE     15      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "当月算定日　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     13      TO     IDX41
                      MOVE     19      TO     IDX42
                      MOVE     25      TO     IDX48
                    END-IF
                   ELSE
                    IF   RECE200-SRYYM >= "201905"
                      MOVE     17      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "過去算定日　　　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     17      TO     IDX41
                      MOVE     23      TO     IDX42
                      MOVE     29      TO     IDX48
                      MOVE     13      TO     IDX49
                    ELSE
                      MOVE     15      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "過去算定日　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     13      TO     IDX41
                      MOVE     19      TO     IDX42
                      MOVE     25      TO     IDX48
                    END-IF
                   END-IF
      *
                   INITIALIZE                         STS-AREA-DAY
                   INITIALIZE                         LNK-DAY2-AREA
                   MOVE    "21"                   TO  LNK-DAY2-IRAI
                   MOVE    WRK-GANSIDO-YMD(IDX26) TO  LNK-DAY2-YMD
                   CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                                  LNK-DAY2-AREA
                   IF      STS-DAY-RC1            =   ZERO
                     MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                     INITIALIZE                       ORCSKANACHKAREA
                     MOVE    "2"                  TO  KANACHK-SYORI
                     MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                     CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                        MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                     END-IF
      *
                     MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                     INITIALIZE                       ORCSKANACHKAREA
                     MOVE    "2"                  TO  KANACHK-SYORI
                     MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                     CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                        MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                     END-IF
      *
                     MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
                     INITIALIZE                       ORCSKANACHKAREA
                     MOVE    "2"                  TO  KANACHK-SYORI
                     MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                     CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                        MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX48:4)
                     END-IF
      *
                     IF   RECE200-SRYYM >= "201905"
                        MOVE    LNK-DAY2-EDTYMD2-G
                                   TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                     END-IF
                   END-IF
                  END-IF
                 END-IF
                END-PERFORM
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-GANSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       2001-GANSIDO-HENSYU-SEC          SECTION.
      *
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEI-PTID
           MOVE    WRK-SRYCD           TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL   FLG-SANTEI  =   1
      *
      ***>       IF   SANTEI-SRYYM  <= RECE200-SRYYM
                 IF   SANTEI-SRYYM  <  RECE200-SRYYM
                   PERFORM  VARYING  IDX26  FROM  31  BY  -1
                             UNTIL   IDX26   <     1
                     IF  (SANTEI-DAY(IDX26)  NOT =  ZERO)
                     AND (IDX27              <    10    )
                       ADD   1      TO  IDX27
                       MOVE  SANTEI-SRYYM
                                    TO  WRK-GANSIDO-YMD(IDX27)(1:6)
                       MOVE  IDX26  TO  WRK-GANSIDO-YMD(IDX27)(7:2)
                     END-IF
                   END-PERFORM
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       2001-GANSIDO-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    排尿自立指導料があるか判定
      *****************************************************************
       2001-HAIJRT-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-HAIJRT-COMMENT   =    "1"
             MOVE    SPACE               TO  WRK-HAIJRT-YMD
             INITIALIZE                      SANTEI-REC
             MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID        TO  SANTEI-PTID
             MOVE    RECE200-SRYYM       TO  SANTEI-SRYYM
             MOVE    CONS-HAIJRT         TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  WRK-MCP-TABLE
             MOVE    "key"               TO  WRK-MCP-PATHNAME
             PERFORM  900-SANTEI-INV-SEC
             IF       FLG-SANTEI        =   ZERO
                 MOVE SANTEI-FSANTEIYMD  TO  WRK-HAIJRT-YMD
             END-IF
      *
             IF   WRK-HAIJRT-YMD   NOT =  SPACE
      *
                MOVE    ZERO             TO  WRK-HAIJRT-KAISU
                INITIALIZE                   SANTEI-REC
                MOVE    RECE200-HOSPNUM  TO  SANTEI-HOSPNUM
                MOVE    RECE200-PTID     TO  SANTEI-PTID
                MOVE    CONS-HAIJRT      TO  SANTEI-SRYCD
                MOVE    ZERO             TO  SANTEI-NYUGAIKBN
                MOVE    ZERO             TO  SANTEI-SRYKA
                MOVE    ZERO             TO  SANTEI-HKNCOMBINUM
                MOVE    SANTEI-REC       TO  MCPDATA-REC
                MOVE    "tbl_santei"     TO  MCP-TABLE
                MOVE    "key3"           TO  MCP-PATHNAME
                PERFORM 900-DBSELECT-SEC
                IF      MCP-RC              =   ZERO
                  MOVE    "tbl_santei"      TO  MCP-TABLE
                  MOVE    "key3"            TO  MCP-PATHNAME
                  PERFORM  900-SANTEI-READ-SEC
                  PERFORM   UNTIL   FLG-SANTEI  =   1
                    IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                    AND  SANTEI-SRYYM  >=  WRK-HAIJRT-YMD(1:6)
                      MOVE  WRK-HAIJRT-YMD(7:2)  TO  IDX28
                      PERFORM  VARYING  IDX26  FROM  31  BY  -1
                                UNTIL   IDX26   <     1
                        IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                          IF  (SANTEI-SRYYM = WRK-HAIJRT-YMD(1:6))
                          AND (IDX26        < IDX28              )
                            CONTINUE
                          ELSE
                            ADD    1    TO   WRK-HAIJRT-KAISU
                          END-IF
                        END-IF
                      END-PERFORM
                    END-IF
                    MOVE    "tbl_santei"    TO  MCP-TABLE
                    MOVE    "key3"          TO  MCP-PATHNAME
                    PERFORM  900-SANTEI-READ-SEC
                  END-PERFORM
                END-IF
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM 900-CLOSE-SEC
      *
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                ADD        1       TO     IDZ
      *
                MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "初回算定　　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
      *
                MOVE    WRK-HAIJRT-YMD(5:2)   TO  DAY-IDX2
                MOVE    TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(11:4)
                MOVE    WRK-HAIJRT-YMD(7:2)   TO  DAY-IDX2
                MOVE    TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(17:4)
      *
                IF   WRK-HAIJRT-KAISU  NOT =  ZERO
                AND  WRK-HAIJRT-KAISU     <=   31
                  ADD        1       TO     IDZ
      *
                  MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE     "通算実施回数（　　回）"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE      WRK-HAIJRT-KAISU TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(15:4)
                END-IF
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-HAIJRT-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院時共同指導料２があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-TAIKYO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-TAIKYO-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     99      TO     FLG-COMMENT
                  MOVE     79      TO     IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                ELSE
                  MOVE     10      TO     FLG-COMMENT
                END-IF
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-TAIKYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    訪問看護指示料があるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-HOUSIJI-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-HOUSIJI-COMMENT   =    "1"
           AND    RECE220-FLG-HOUSKSN-COMMENT   =    SPACE
               MOVE      ZERO     TO     IDZ
               INITIALIZE                WRK-FREE-AREA2
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               MOVE       3       TO     FLG-COMMENT
               PERFORM   200111-SANTEI-DAY-SEC
               PERFORM   20011-FREE-COMMENT2-SEC
      *
               IF   RECE220-FLG-TEJHOU-COMMENT  =  "1"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 PERFORM   2001-TEJHOU-HENSYU-SEC
               END-IF
      *
               PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
           END-IF
      *
           .
       2001-HOUSIJI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    特別訪問看護指示加算があるか判定
      *  ＃202204コメント対応
      *****************************************************************
       2001-HOUSKSN-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-HOUSKSN-COMMENT   =    "1"
               MOVE      ZERO     TO     IDZ
               INITIALIZE                WRK-FREE-AREA2
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               MOVE       3       TO     FLG-COMMENT
               PERFORM   200111-SANTEI-DAY-SEC
               PERFORM   20011-FREE-COMMENT2-SEC
      *
               IF   RECE220-FLG-TEJHOU-COMMENT  =  "1"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 PERFORM   2001-TEJHOU-HENSYU-SEC
               END-IF
      *
               PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
           END-IF
      *
           .
       2001-HOUSKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    手順書加算（訪問看護指示料）があるか判定
      *  ＃202204コメント対応
      *****************************************************************
       2001-TEJHOU-HANTEI-SEC          SECTION.
      *
           IF   ((RECE220-FLG-HOUSIJI-COMMENT   =    SPACE) AND
                 (RECE220-FLG-HOUSKSN-COMMENT   =    SPACE) AND
                 (RECE220-FLG-TEJHOU-COMMENT    =    "1"  ))
           OR   ((RECE220-FLG-HOUSKSN-COMMENT   =    "2"  ) AND
                 (RECE220-FLG-TEJHOU-COMMENT    =    "1"  ))
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
             MOVE       99      TO     FLG-COMMENT
      *
             MOVE      ZERO     TO     IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             PERFORM   2001-TEJHOU-HENSYU-SEC
      *
             PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
           END-IF
      *
           .
       2001-TEJHOU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    手順書加算（訪問看護指示料）編集
      *  ＃202204コメント対応
      *****************************************************************
       2001-TEJHOU-HENSYU-SEC          SECTION.
      *
           MOVE    ZERO                TO  FLG-TEJHOU-COMMENT
           MOVE    SPACE               TO  WRK-TEJHOU-YMD
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID         TO  SANTEI-PTID
           MOVE    CONS-TEJHOU         TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                           OR   ( FLG-TEJHOU-COMMENT  =   1 )
      *
                 IF   SANTEI-SRYYM  <  RECE200-SRYYM
                   MOVE  SANTEI-SRYYM     TO  WRK-TEJHOU-YMD(1:6)
                   MOVE  SANTEI-MSANTEID  TO  WRK-TEJHOU-YMD(7:2)
                   MOVE    1              TO  FLG-TEJHOU-COMMENT
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           IF   WRK-TEJHOU-YMD   NOT =  SPACE
             MOVE     137              TO  IDX-JIDO
             PERFORM  200111-RECECOMMENT-IDXGET-SEC
             MOVE     WRK-TEJHOU-YMD   TO  WRK-RECECOM-YMD
             PERFORM  200111-RECECOMMENT-HENSYU-SEC
           ELSE
             MOVE     637              TO  IDX-JIDO
             PERFORM  200111-RECECOMMENT-IDXGET-SEC
             PERFORM  200111-RECECOMMENT-HENSYU-SEC
           END-IF
      *
           .
       2001-TEJHOU-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅血液透析頻回指導管理料があるか判定
      *    在宅血液透析指導管理料算定日の歴月で２月以内か判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-HINKAI-HANTEI-SEC          SECTION.
      *
           IF   RECE220-FLG-HINKAI-COMMENT   =    "1"
      *
             MOVE    ZERO    TO   WRK-DAY
             PERFORM  VARYING   IDX3   FROM  1  BY  1
                       UNTIL    IDX3  >   31
                 IF   RECE220-KAISU(1 IDX3)  NOT =  ZERO
                        MOVE  IDX3  TO  WRK-DAY
                        MOVE  31    TO  IDX3
                 END-IF
             END-PERFORM
      *
             MOVE     ZERO     TO     FLG-HINKAI-COMMENT
             MOVE     ZERO     TO     WRK-TOSEKIYMD
      *
      *      算定履歴検索
             INITIALIZE                      SANTEI-REC
             MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID        TO  SANTEI-PTID
             MOVE    CONS-TOSEKI         TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM   900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
                    MOVE    "tbl_santei"        TO  MCP-TABLE
                    MOVE    "key3"              TO  MCP-PATHNAME
                    PERFORM        900-SANTEI-READ-SEC
                    PERFORM   UNTIL  ( FLG-SANTEI         =   1 ) OR
                                     ( FLG-HINKAI-COMMENT =   1 )
      *
                      IF   SANTEI-SRYYM  <=  RECE200-SRYYM
      ***              MOVE   SANTEI-SRYYM     TO  WRK-FSANTEIYMD(1:6)
      ***              MOVE   SANTEI-MSANTEID  TO  WRK-FSANTEIYMD(7:2)
                       MOVE   SANTEI-FSANTEIYMD
                                               TO  WRK-FSANTEIYMD
      *
                       INITIALIZE                  STS-AREA-DAY
                       INITIALIZE                  LNK-DAY6-AREA
                       MOVE    "61"            TO  LNK-DAY6-IRAI
                       MOVE    WRK-FSANTEIYMD  TO  LNK-DAY6-KIJUN
                       MOVE    "2"             TO  LNK-DAY6-ZOGENPTN
                       MOVE     2              TO  LNK-DAY6-ZOGEN
                       CALL    "ORCSDAY"       USING   STS-AREA-DAY
                                                       LNK-DAY6-AREA
                       MOVE    LNK-DAY6-KEISAN TO  WRK-AFTER2
      *
                       MOVE    RECE200-SRYYM   TO  WRK-HINKAIYMD(1:6)
                       MOVE    WRK-DAY         TO  WRK-HINKAIYMD(7:2)
      *
                       IF     WRK-DAY      NOT  =  ZERO
                       AND    WRK-FSANTEIYMD   <=  WRK-HINKAIYMD
                         IF ((WRK-HINKAIYMD    <   WRK-AFTER2) AND
                             (RECE200-SRYYM    <= "201003"   ))
                         OR ( RECE200-SRYYM    >= "201004"    )
                             MOVE    1    TO   FLG-HINKAI-COMMENT
                             MOVE  WRK-FSANTEIYMD
                                          TO   WRK-TOSEKIYMD
                         END-IF
                       END-IF
                      END-IF
      * 
                      MOVE    "tbl_santei"     TO  MCP-TABLE
                      MOVE    "key3"           TO  MCP-PATHNAME
                      PERFORM        900-SANTEI-READ-SEC
                    END-PERFORM
             END-IF
      *
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
             IF      FLG-HINKAI-COMMENT    =      1
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 IF   RECE200-SRYYM  >= "202008"
                   MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 END-IF
                 MOVE       99      TO     FLG-COMMENT
                 PERFORM    20011-HINKAI-COMMENT-SEC
             END-IF
      *
           END-IF
      *
           .
       2001-HINKAI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅血液透析頻回指導管理料のコメント編集
      *****************************************************************
       20011-HINKAI-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *    コメントの挿入
           MOVE    RECE220-MEISAISU     TO  MAX-MEISAISU
      *
           IF   RECE200-SRYYM  >= "202008"
              MOVE   ZERO          TO   IDZ
              INITIALIZE           WRK-FREE-AREA2
              MOVE   34            TO  IDX-JIDO
              PERFORM  200111-RECECOMMENT-IDXGET-SEC
              MOVE   WRK-TOSEKIYMD TO  WRK-RECECOM-YMD
              PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE  WK-FREE-SRYCD2(1)
                           TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
              MOVE  ZERO   TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE  WK-FREE-YUKOKETA2(1)
                           TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  WK-FREE-NAME2(1)
                           TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
              MOVE  WK-FREE-INPUTCOMENT2(1)
                           TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
           ELSE
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE  "810000001"
                           TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
              MOVE  ZERO   TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE  16     TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "初回指導管理算定日　　　月　　日"
                           TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
              MOVE  WRK-TOSEKIYMD(5:2)   TO  DAY-IDX2
              MOVE  TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(21:4)
              MOVE  WRK-TOSEKIYMD(7:2)   TO  DAY-IDX2
              MOVE  TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(27:4)
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-HINKAI-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    往診・特別往診があるか判定
      *****************************************************************
       2001-OSIN-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-OSIN-COMMENT   =    "1"
               MOVE       6       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-OSIN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    介護職員等喀痰吸引等指示料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-KAISYOKU-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-KAISYOKU-COMMENT   =    "1"
             MOVE    ZERO                TO  FLG-KAISYOKU-COMMENT
             MOVE    SPACE               TO  WRK-KAISYOKU-YMD
             INITIALIZE                      SANTEI-REC
             MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID        TO  SANTEI-PTID
             MOVE    CONS-KAISYOKU       TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI           =   1 )
                             OR   ( FLG-KAISYOKU-COMMENT =   1 )
      *
                   IF   SANTEI-SRYYM  <  RECE200-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-KAISYOKU-YMD(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-KAISYOKU-YMD(7:2)
                     MOVE    1              TO  FLG-KAISYOKU-COMMENT
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
      *
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             IF   RECE200-SRYYM  >= "202008"
               MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
             END-IF
             MOVE       99      TO     FLG-COMMENT
      *
             MOVE      ZERO     TO     IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             IF   RECE200-SRYYM  >= "202008"
              IF   WRK-KAISYOKU-YMD   NOT =  SPACE
                MOVE   38            TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                MOVE   WRK-KAISYOKU-YMD
                                     TO  WRK-RECECOM-YMD
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              ELSE
                MOVE   538           TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              END-IF
             ELSE
              IF   WRK-KAISYOKU-YMD   NOT =  SPACE
                ADD          1       TO     IDZ
                IF   RECE200-SRYYM >= "201905"
                  MOVE       19      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE   "前回交付年月日　　　　　年　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE       21      TO     IDX41
                  MOVE       27      TO     IDX42
                  MOVE       33      TO     IDX48
                  MOVE       17      TO     IDX49
                ELSE
                  MOVE       17      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE   "前回交付年月日　　　年　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE       17      TO     IDX41
                  MOVE       23      TO     IDX42
                  MOVE       29      TO     IDX48
                END-IF
      *
                INITIALIZE                         STS-AREA-DAY
                INITIALIZE                         LNK-DAY2-AREA
                MOVE    "21"                   TO  LNK-DAY2-IRAI
                MOVE    WRK-KAISYOKU-YMD       TO  LNK-DAY2-YMD
                CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                               LNK-DAY2-AREA
                IF      STS-DAY-RC1            =   ZERO
                   MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX48:4)
                   END-IF
      *
                   IF   RECE200-SRYYM >= "201905"
                      MOVE    LNK-DAY2-EDTYMD2-G
                                   TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                   END-IF
                END-IF
              ELSE
                ADD        1       TO     IDZ
                MOVE       6       TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "（初回交付）"  TO     WK-FREE-NAME2(IDZ)
              END-IF
             END-IF
      *
             PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           END-IF
      *
           .
       2001-KAISYOKU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅持続陽圧呼吸療法指導管理料があるか判定
      *  ＃202202選択式コメント対応
      *****************************************************************
       2001-YOUATU-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-YOUATU-COMMENT   =    "1" OR "2"
             MOVE    SPACE                TO  WRK-YOUATU-FSANTEIYMD
             INITIALIZE                       SANTEI-REC
             MOVE    RECE200-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID         TO  SANTEI-PTID
             MOVE    RECE200-SRYYM        TO  SANTEI-SRYYM
             EVALUATE  RECE220-FLG-YOUATU-COMMENT
               WHEN      "1"
                 MOVE    CONS-YOUATU1     TO  SANTEI-SRYCD
               WHEN      "2"
                 MOVE    CONS-YOUATU2     TO  SANTEI-SRYCD
             END-EVALUATE
             MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                 TO  SANTEI-SRYKA
             MOVE    ZERO                 TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC           TO  MCPDATA-REC
             MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
             MOVE    "key"                TO  WRK-MCP-PATHNAME
             PERFORM 900-SANTEI-INV-SEC
             IF      FLG-SANTEI  =  ZERO
               MOVE  SANTEI-FSANTEIYMD    TO  WRK-YOUATU-FSANTEIYMD
             END-IF
      *
             MOVE    ZERO                 TO  FLG-YOUATU-COMMENT
             INITIALIZE                       SANTEI-REC
             MOVE    RECE200-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID         TO  SANTEI-PTID
             MOVE    CONS-YOUATU3         TO  SANTEI-SRYCD
             MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                 TO  SANTEI-SRYKA
             MOVE    ZERO                 TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC           TO  MCPDATA-REC
             MOVE    "tbl_santei"         TO  MCP-TABLE
             MOVE    "key3"               TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC  =  ZERO
               MOVE    "tbl_santei"       TO  MCP-TABLE
               MOVE    "key3"             TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM  UNTIL (FLG-SANTEI         =  1)
                         OR   (FLG-YOUATU-COMMENT =  1)
                 IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                   IF    SANTEI-FSANTEIYMD  NOT =  SPACE
                     MOVE  SANTEI-FSANTEIYMD
                                    TO  WRK-YOUATU-FSANTEIYMD
                   END-IF
                   MOVE     1       TO  FLG-YOUATU-COMMENT
                 END-IF
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM  900-CLOSE-SEC
      *
             MOVE         ZERO     TO     IDZ
             INITIALIZE                   WRK-FREE-AREA2
             IF   WRK-YOUATU-FSANTEIYMD   NOT =  SPACE
               INITIALIZE                 WRK-JIDO-SETCOM-AREA
               MOVE      "2"       TO     WRK-JIDO-SETCOMFLG
               MOVE       99       TO     FLG-COMMENT
      *
               EVALUATE  RECE220-FLG-YOUATU-COMMENT
                 WHEN      "1"
                   MOVE    115     TO     IDX-JIDO
                 WHEN      "2"
                   MOVE    116     TO     IDX-JIDO
               END-EVALUATE
               PERFORM    200111-RECECOMMENT-IDXGET-SEC
               MOVE       WRK-YOUATU-FSANTEIYMD
                                   TO     WRK-RECECOM-YMD
               PERFORM    200111-RECECOMMENT-HENSYU-SEC
             END-IF
      *
             IF   (RECE220-FLG-SINPESU-COMMENT    =    "B")
             AND  (RECE220-FLG-SINPESUR-COMMENT   =    "B")
               MOVE    ZERO                TO  FLG-SINPESUR-COMMENT
               MOVE    SPACE               TO  WRK-SINPESUR-YMD
               INITIALIZE                      SANTEI-REC
               MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID        TO  SANTEI-PTID
               MOVE    CONS-YOUATU2        TO  SANTEI-SRYCD
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"      TO  MCP-TABLE
                 MOVE    "key3"            TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI           =   1 )
                             OR   ( FLG-SINPESUR-COMMENT =   1 )
                   IF   SANTEI-SRYYM  <  RECE200-SRYYM
                     MOVE  SANTEI-SRYYM    TO  WRK-SINPESUR-YMD(1:6)
                     MOVE  SANTEI-MSANTEID TO  WRK-SINPESUR-YMD(7:2)
                     MOVE    1             TO  FLG-SINPESUR-COMMENT
                   END-IF
                   MOVE    "tbl_santei"    TO  MCP-TABLE
                   MOVE    "key3"          TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               IF   WRK-SINPESUR-YMD   NOT =  SPACE
                 INITIALIZE                 WRK-JIDO-SETCOM-AREA
                 MOVE      "2"       TO     WRK-JIDO-SETCOMFLG
                 MOVE       99       TO     FLG-COMMENT
      *
                 MOVE       27       TO     IDX-JIDO
                 PERFORM   200111-RECECOMMENT-IDXGET-SEC
                 MOVE      WRK-SINPESUR-YMD(1:6)
                                     TO     WRK-RECECOM-YMD(1:6)
                 MOVE      "00"      TO     WRK-RECECOM-YMD(7:2)
                 PERFORM   200111-RECECOMMENT-HENSYU-SEC
               END-IF
             END-IF
      *
             IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
             OR  WK-FREE-NAME2(1)   NOT =  SPACE
               PERFORM     200111-SRYACTINF-HENSYU-MAT-SEC
             END-IF
           END-IF
      *
           .
       2001-YOUATU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅患者共同診療料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-ZAIKYO-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-ZAIKYO-COMMENT   =    "1"
             MOVE   CONS-ZAIKYO   TO   WRK-CHECK-SRYCD
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
      *        在宅患者共同診療料開始日の剤検索
               MOVE       ZERO                  TO  WRK-ZAIKYO-KAISU
               MOVE       ZERO                  TO  FLG-ZAIKYOCOMARI
               PERFORM    20011-ZAIKYO-KENSAKU-SEC
               IF    FLG-ZAIKYOCOMARI  =  1
                  PERFORM  VARYING  IDX30  FROM  1  BY  1
                            UNTIL   IDX30   >   TBL-ZAIKYO-CHECK-MAX
                    INITIALIZE                      SANTEI-REC
                    MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
                    MOVE    RECE200-PTID        TO  SANTEI-PTID
                    MOVE    TBL-ZAIKYO-CHECK(IDX30)
                                                TO  SANTEI-SRYCD
                    MOVE    ZERO                TO  SANTEI-NYUGAIKBN
                    MOVE    ZERO                TO  SANTEI-SRYKA
                    MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
                    MOVE    SANTEI-REC          TO  MCPDATA-REC
                    MOVE    "tbl_santei"        TO  MCP-TABLE
                    MOVE    "key3"              TO  MCP-PATHNAME
                    PERFORM 900-DBSELECT-SEC
                    IF      MCP-RC              =   ZERO
                      MOVE    "tbl_santei"      TO  MCP-TABLE
                      MOVE    "key3"            TO  MCP-PATHNAME
                      PERFORM  900-SANTEI-READ-SEC
                      PERFORM   UNTIL   FLG-SANTEI  =   1
      *
                        IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                        AND  SANTEI-SRYYM  >=  WRK-ZAIKYO-YMD(1:6)
                          MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                          MOVE  WRK-ZAIKYO-YMD9(7:2) TO  IDX29
                          PERFORM  VARYING  IDX26  FROM  31  BY  -1
                                    UNTIL   IDX26   <     1
                            IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                              IF ((SANTEI-SRYYM =
                                          WRK-ZAIKYO-YMD(1:6) ) AND
                                  (IDX26        < IDX28       ))
                              OR ((SANTEI-SRYYM =
                                          WRK-ZAIKYO-YMD9(1:6)) AND
                                  (IDX26       >= IDX29       ))
                                CONTINUE
                              ELSE
                                ADD    1    TO   WRK-ZAIKYO-KAISU
                              END-IF
                            END-IF
                          END-PERFORM
                        END-IF
      *
                        MOVE    "tbl_santei"    TO  MCP-TABLE
                        MOVE    "key3"          TO  MCP-PATHNAME
                        PERFORM  900-SANTEI-READ-SEC
                      END-PERFORM
                    END-IF
                    MOVE    "tbl_santei"        TO  MCP-TABLE
                    MOVE    "key3"              TO  MCP-PATHNAME
                    PERFORM 900-CLOSE-SEC
                  END-PERFORM
               END-IF
      *
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               IF   RECE200-SRYYM  >= "202008"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
               END-IF
               MOVE       99      TO     FLG-COMMENT
      *
               MOVE      ZERO     TO     IDZ
               INITIALIZE                WRK-FREE-AREA2
      *
               IF   RECE200-SRYYM  >= "202008"
                  MOVE   39            TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   WRK-ZAIKYO-YMD
                                       TO  WRK-RECECOM-YMD
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                  IF    WRK-ZAIKYO-KAISU  NOT = ZERO
                    MOVE   539         TO  IDX-JIDO
                    PERFORM  200111-RECECOMMENT-IDXGET-SEC
                    MOVE   WRK-ZAIKYO-KAISU
                                       TO  WRK-RECECOM-NUM
                    PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  END-IF
               ELSE
                  ADD      1       TO     IDZ
                  MOVE     11      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE "初回算定　　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
                  MOVE  WRK-ZAIKYO-YMD(5:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(11:4)
                  MOVE  WRK-ZAIKYO-YMD(7:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(17:4)
      *
                  IF   (WRK-ZAIKYO-KAISU  NOT = ZERO)
                  AND  (WRK-ZAIKYO-KAISU     <=  31 )
                    ADD    1       TO  IDZ
                    MOVE   11      TO  WK-FREE-YUKOKETA2(IDZ)
                    MOVE "通算実施回数（　　回）"
                                   TO  WK-FREE-NAME2(IDZ)
                    MOVE  WRK-ZAIKYO-KAISU TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(15:4)
                  END-IF
               END-IF
      *
               PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-ZAIKYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       20011-ZAIKYO-CHECK-SEC          SECTION.
      *
           MOVE    RECE200-SRYYM       TO  WRK-ZAIKYO-YMD9(1:6)
           MOVE    "99"                TO  WRK-ZAIKYO-YMD9(7:2)
      *
           MOVE    ZERO                TO  FLG-ZAIKYO-COMMENT
           MOVE    SPACE               TO  WRK-ZAIKYO-YMD
           MOVE    ZERO                TO  FLG-RETRY
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEI-PTID
           MOVE    WRK-CHECK-SRYCD     TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                           OR   ( FLG-ZAIKYO-COMMENT  =   1 )
      *
                 IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                   MOVE  SANTEI-SRYYM     TO  WRK-ZAIKYO-YMD(1:6)
                   MOVE  SANTEI-MSANTEID  TO  WRK-ZAIKYO-YMD(7:2)
                   MOVE    1              TO  FLG-ZAIKYO-COMMENT
      *
                   IF   SANTEI-SRYYM  =  RECE200-SRYYM
                     MOVE   ZERO  TO  FLG-CHECK-MAE
                     MOVE   ZERO  TO  FLG-CHECK-ATO
                     MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                     PERFORM  VARYING  IDX26  FROM   1  BY  1
                               UNTIL   IDX26   >    31
                       IF  RECE220-KAISU(1 IDX26)  NOT =  ZERO
                         IF    IDX26  <  IDX28
                           MOVE    1   TO  FLG-CHECK-MAE
                         ELSE
                           MOVE    1   TO  FLG-CHECK-ATO
                         END-IF
                       END-IF
                     END-PERFORM
                     IF  ((FLG-CHECK-MAE = 1   ) AND
                          (FLG-CHECK-ATO = ZERO))
                     OR  ((FLG-CHECK-MAE = 1   ) AND
                          (FLG-CHECK-ATO = 1   ))
                       MOVE    WRK-ZAIKYO-YMD
                                       TO  WRK-ZAIKYO-YMD9
                       MOVE    SPACE   TO  WRK-ZAIKYO-YMD
                       MOVE    1       TO  FLG-RETRY
                     END-IF
                   END-IF
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           IF   FLG-RETRY =  1
             MOVE    ZERO                TO  FLG-ZAIKYO-COMMENT
             MOVE    SPACE               TO  WRK-ZAIKYO-YMD
             MOVE    ZERO                TO  FLG-RETRY
             INITIALIZE                      SANTEI-REC
             MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
             MOVE    RECE200-PTID        TO  SANTEI-PTID
             MOVE    WRK-CHECK-SRYCD     TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                           OR   ( FLG-ZAIKYO-COMMENT  =   1 )
      *
                 IF   SANTEI-SRYYM  <   RECE200-SRYYM
                   MOVE  SANTEI-SRYYM     TO  WRK-ZAIKYO-YMD(1:6)
                   MOVE  SANTEI-MSANTEID  TO  WRK-ZAIKYO-YMD(7:2)
                   MOVE    1              TO  FLG-ZAIKYO-COMMENT
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
           END-IF
      *
           .
       20011-ZAIKYO-CHECK-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       20011-ZAIKYO-CHECK2-SEC          SECTION.
      *
      *    算定履歴検索
           MOVE    SPACE               TO  WRK-ZAIKYO-YMD2
           INITIALIZE                      SANTEI-REC
           MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID        TO  SANTEI-PTID
           MOVE    RECE200-SRYYM       TO  SANTEI-SRYYM
           MOVE    WRK-CHECK-SRYCD     TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  WRK-MCP-TABLE
           MOVE    "key"               TO  WRK-MCP-PATHNAME
           PERFORM  900-SANTEI-INV-SEC
           IF       FLG-SANTEI        =   ZERO
             MOVE   SANTEI-SRYYM       TO  WRK-ZAIKYO-YMD2(1:6)
             MOVE   SANTEI-MSANTEID    TO  WRK-ZAIKYO-YMD2(7:2)
             IF     WRK-ZAIKYO-YMD     <=  WRK-ZAIKYO-YMD2
               MOVE   ZERO  TO  FLG-CHECK-MAE
               MOVE   ZERO  TO  FLG-CHECK-ATO
               MOVE   WRK-ZAIKYO-YMD2(7:2)  TO  IDX28
               PERFORM  VARYING  IDX26  FROM   1  BY  1
                         UNTIL   IDX26   >    31
                 IF  RECE220-KAISU(1 IDX26)  NOT =  ZERO
                   IF    IDX26  <=  IDX28
                     MOVE    1   TO  FLG-CHECK-MAE
                   ELSE
                     MOVE    1   TO  FLG-CHECK-ATO
                   END-IF
                 END-IF
               END-PERFORM
               IF    FLG-CHECK-MAE = ZERO
                 MOVE    SPACE   TO  WRK-ZAIKYO-YMD
                 MOVE    SPACE   TO  WRK-ZAIKYO-YMD2
               END-IF
             ELSE
                 MOVE    SPACE   TO  WRK-ZAIKYO-YMD2
             END-IF
           END-IF
      *
           .
       20011-ZAIKYO-CHECK2-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅患者共同診療料開始日の剤検索
      *****************************************************************
       20011-ZAIKYO-KENSAKU-SEC          SECTION.
      *
           MOVE    ZERO                  TO  FLG-ZAIKYO-OK
           MOVE    SPACE                 TO  WRK-ZAIKYO-NYUGAIKBN
           MOVE    SPACE                 TO  WRK-ZAIKYO-SRYKA
           MOVE    ZERO                  TO  WRK-ZAIKYO-ZAINUM
      *
           PERFORM   VARYING   IDX15    FROM   2   BY  -1
                      UNTIL   (IDX15          <    1)
                       OR     (FLG-ZAIKYO-OK  =    1)
             INITIALIZE                      SRYACT-REC
             MOVE    RECE200-HOSPNUM     TO  SRY-HOSPNUM
             MOVE    IDX15               TO  SRY-NYUGAIKBN
             MOVE    RECE200-PTID        TO  SRY-PTID
             MOVE    WRK-ZAIKYO-YMD(1:6) TO  SRY-SRYYM
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (1)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (2)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (3)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (4)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (5)
             MOVE    SRYACT-REC          TO  MCPDATA-REC
             MOVE    "tbl_sryact"        TO  MCP-TABLE
             MOVE    "key7"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
               MOVE    "tbl_sryact"      TO  MCP-TABLE
               MOVE    "key7"            TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT     =   1
                         OR     FLG-ZAIKYO-OK  =   1
                 INITIALIZE                  SRYACCT-REC
                 MOVE    SRY-HOSPNUM     TO  ACCT-HOSPNUM
                 MOVE    SRY-NYUGAIKBN   TO  ACCT-NYUGAIKBN
                 MOVE    SRY-PTID        TO  ACCT-PTID
                 MOVE    SRY-SRYKA       TO  ACCT-SRYKA
                 MOVE    SRY-SRYYM       TO  ACCT-SRYYM
                 MOVE    SRY-ZAINUM      TO  ACCT-ZAINUM
                 MOVE    SRYACCT-REC     TO  MCPDATA-REC
                 MOVE    "tbl_sryacct"   TO  MCP-TABLE
                 MOVE    "key31"         TO  MCP-PATHNAME
                 PERFORM 900-DBSELECT-SEC
                 IF      MCP-RC          =   ZERO
                    MOVE "tbl_sryacct"   TO  MCP-TABLE
                    MOVE "key31"         TO  MCP-PATHNAME
                    PERFORM 900-DBFETCH-SEC
                    IF      MCP-RC       =   ZERO
                      MOVE  MCPDATA-REC  TO  SRYACCT-REC
      *
                      MOVE  WRK-ZAIKYO-YMD(7:2)
                                         TO  DAY-IDX2
                      IF   ACCT-DAY(1 DAY-IDX2)  NOT =  ZERO
                        MOVE   1   TO  FLG-ZAIKYO-OK
                        MOVE   ACCT-NYUGAIKBN
                                   TO  WRK-ZAIKYO-NYUGAIKBN
                        MOVE   ACCT-SRYKA
                                   TO  WRK-ZAIKYO-SRYKA
                        MOVE   ACCT-ZAINUM
                                   TO  WRK-ZAIKYO-ZAINUM
                      END-IF
                    END-IF
                 END-IF
                 MOVE    "tbl_sryacct"   TO  MCP-TABLE
                 MOVE    "key31"         TO  MCP-PATHNAME
                 PERFORM   900-CLOSE-SEC
      *
                 MOVE    "tbl_sryact"    TO  MCP-TABLE
                 MOVE    "key7"          TO  MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_sryact"        TO  MCP-TABLE
             MOVE    "key7"              TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
           END-PERFORM
      *
      *++++
      *
           IF      WRK-ZAIKYO-ZAINUM    NOT =    ZERO
              INITIALIZE                         SRYACT-REC
              MOVE    RECE200-HOSPNUM        TO  SRY-HOSPNUM
              MOVE    WRK-ZAIKYO-NYUGAIKBN   TO  SRY-NYUGAIKBN
              MOVE    RECE200-PTID           TO  SRY-PTID
              MOVE    WRK-ZAIKYO-SRYKA       TO  SRY-SRYKA
              MOVE    WRK-ZAIKYO-YMD(1:6)    TO  SRY-SRYYM
              MOVE    WRK-ZAIKYO-ZAINUM      TO  SRY-ZAINUM
              MOVE    SRYACT-REC             TO  MCPDATA-REC
              MOVE    "tbl_sryact"           TO  MCP-TABLE
              MOVE    "key2"                 TO  MCP-PATHNAME
              PERFORM 900-DBSELECT-SEC
              IF      MCP-RC                 =   ZERO
                 MOVE    "tbl_sryact"        TO  MCP-TABLE
                 MOVE    "key2"              TO  MCP-PATHNAME
                 PERFORM  900-SRYACT-READ-SEC
                 PERFORM  UNTIL  (FLG-SRYACT       =  1)
                           OR    (FLG-ZAIKYOCOMARI =  1)
                   PERFORM  VARYING  IDX12  FROM  1  BY  1
                             UNTIL  (IDX12             >    5   )
                              OR    (SRY-SRYCD(IDX12)  =   SPACE)
                              OR    (FLG-ZAIKYOCOMARI  =    1   )
                      IF  SRY-SRYCD(IDX12)  =  "840000086"
                                            OR "842100043"
                         MOVE    1    TO   FLG-ZAIKYOCOMARI
                      END-IF
                   END-PERFORM
                   MOVE    "tbl_sryact"      TO  MCP-TABLE
                   MOVE    "key2"            TO  MCP-PATHNAME
                   PERFORM   900-SRYACT-READ-SEC
                 END-PERFORM
              END-IF
              MOVE    "tbl_sryact"           TO  MCP-TABLE
              MOVE    "key2"                 TO  MCP-PATHNAME
              PERFORM 900-CLOSE-SEC
           END-IF
      *
           .
       20011-ZAIKYO-KENSAKU-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅半固形栄養経管栄養法指導管理料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-ZAIHANKO-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-ZAIHANKO-COMMENT   NOT =  SPACE
               MOVE    SPACE                TO  WRK-ZAIHANKO-FSANTEIYMD
               INITIALIZE                       SANTEI-REC
               MOVE    RECE200-HOSPNUM      TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID         TO  SANTEI-PTID
               MOVE    RECE200-SRYYM        TO  SANTEI-SRYYM
               EVALUATE  RECE220-FLG-ZAIHANKO-COMMENT
                 WHEN      "9"
                   MOVE  CONS-ZAIHANKO      TO  SANTEI-SRYCD
               END-EVALUATE
               MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                 TO  SANTEI-SRYKA
               MOVE    ZERO                 TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC           TO  MCPDATA-REC
               MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
               MOVE    "key"                TO  WRK-MCP-PATHNAME
               PERFORM  900-SANTEI-INV-SEC
               IF       FLG-SANTEI        =   ZERO
                  MOVE  SANTEI-FSANTEIYMD   TO  WRK-ZAIHANKO-FSANTEIYMD
               END-IF
      *
               IF   WRK-ZAIHANKO-FSANTEIYMD   NOT =  SPACE
      *
                  INITIALIZE                WRK-JIDO-SETCOM-AREA
                  IF   RECE200-SRYYM  >= "202008"
                    MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                  END-IF
                  MOVE       99      TO     FLG-COMMENT
      *
                  MOVE      ZERO     TO     IDZ
                  INITIALIZE                WRK-FREE-AREA2
      *
                  IF   RECE200-SRYYM  >= "202008"
                    EVALUATE  RECE220-FLG-ZAIHANKO-COMMENT
                      WHEN     "9"
                        MOVE   57            TO  IDX-JIDO
                        PERFORM  200111-RECECOMMENT-IDXGET-SEC
                        MOVE   WRK-ZAIHANKO-FSANTEIYMD
                                             TO  WRK-RECECOM-YMD
                        PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    END-EVALUATE
                  ELSE
                    ADD       1       TO     IDZ
                    MOVE      11      TO     WK-FREE-YUKOKETA2(IDZ)
                    MOVE  "初回算定　　　月　　日"
                                      TO     WK-FREE-NAME2(IDZ)
                    MOVE  WRK-ZAIHANKO-FSANTEIYMD(5:2)   TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(11:4)
                    MOVE  WRK-ZAIHANKO-FSANTEIYMD(7:2)   TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(17:4)
                  END-IF
      *
                  PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
               END-IF
           END-IF
      *
           .
       2001-ZAIHANKO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    外来在宅共同指導料があるか判定
      *  ＃202204選択式コメント対応
      *****************************************************************
       2001-GAIZAI-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-GAIZAI-COMMENT   =    "1"
                INITIALIZE              WRK-JIDO-SETCOM-AREA
                MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                MOVE     99      TO     FLG-COMMENT
                MOVE     138     TO     IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                PERFORM  20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-GAIZAI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅抗菌薬吸入療法用ネブライザ加算があるか判定
      *  ＃202204選択式コメント対応
      *****************************************************************
       2001-KOUYAK-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-KOUYAK-COMMENT  =  "1" OR "2"
      *
             IF   RECE220-FLG-KOUYAK-COMMENT  =  "2"
               MOVE    ZERO              TO  FLG-KOUYAK-COMMENT
               MOVE    SPACE             TO  WRK-KOUYAK-FSANTEIYMD
               INITIALIZE                    SANTEI-REC
               MOVE    RECE200-HOSPNUM   TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID      TO  SANTEI-PTID
               MOVE    CONS-KOUYAK       TO  SANTEI-SRYCD
               MOVE    ZERO              TO  SANTEI-NYUGAIKBN
               MOVE    ZERO              TO  SANTEI-SRYKA
               MOVE    ZERO              TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC        TO  MCPDATA-REC
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI         =   1 )
                             OR   ( FLG-KOUYAK-COMMENT =   1 )
                   IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                     MOVE    SANTEI-FSANTEIYMD
                                         TO  WRK-KOUYAK-FSANTEIYMD
                     MOVE      1         TO  FLG-KOUYAK-COMMENT
                   END-IF
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
             END-IF
      *
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             MOVE      "2"        TO   WRK-JIDO-SETCOMFLG
             MOVE       99        TO   FLG-COMMENT
      *
             MOVE      ZERO       TO   IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             EVALUATE  RECE220-FLG-KOUYAK-COMMENT
               WHEN      "1"
                 MOVE       139   TO   IDX-JIDO
                 PERFORM    200111-RECECOMMENT-IDXGET-SEC
                 PERFORM    200111-RECECOMMENT-HENSYU-SEC
               WHEN      "2"
                 IF    WRK-KOUYAK-FSANTEIYMD   NOT =  SPACE
                   MOVE     140   TO   IDX-JIDO
                   PERFORM  200111-RECECOMMENT-IDXGET-SEC
                   MOVE     WRK-KOUYAK-FSANTEIYMD
                                  TO  WRK-RECECOM-YMD
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 END-IF
             END-EVALUATE
      *
             PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           END-IF
      *
           .
       2001-KOUYAK-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    磁気による膀胱等刺激法があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-BOKOHO-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-BOKOHO-COMMENT   =    "1"
             MOVE   CONS-BOKOHO1   TO   WRK-CHECK-SRYCD
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
               MOVE    ZERO                TO  IDX27
               INITIALIZE                      WRK-BOKOHO-YMD2-AREA
               MOVE    ZERO                TO  WRK-ZAIKYO-KAISU
               INITIALIZE                      SANTEI-REC
               MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
               MOVE    RECE200-PTID        TO  SANTEI-PTID
               MOVE    CONS-BOKOHO2        TO  SANTEI-SRYCD
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL   FLG-SANTEI  =   1
      *
                   IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                   AND  SANTEI-SRYYM  >=  WRK-ZAIKYO-YMD(1:6)
                     MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                     MOVE  WRK-ZAIKYO-YMD9(7:2) TO  IDX29
                     PERFORM  VARYING  IDX26  FROM  31  BY  -1
                               UNTIL   IDX26   <     1
                      IF   RECE200-SRYYM  >= "202008"
                       IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                         IF ((SANTEI-SRYYM = WRK-ZAIKYO-YMD(1:6) ) AND
                             (IDX26        < IDX28               ))
                         OR ((SANTEI-SRYYM = WRK-ZAIKYO-YMD9(1:6)) AND
                             (IDX26       >= IDX29               ))
                            CONTINUE
                          ELSE
                           ADD   1      TO  WRK-ZAIKYO-KAISU
                         END-IF
                       END-IF
                      ELSE
                       IF  (SANTEI-DAY(IDX26)  NOT =  ZERO)
                       AND (IDX27              <    30    )
                         IF ((SANTEI-SRYYM = WRK-ZAIKYO-YMD(1:6) ) AND
                             (IDX26        < IDX28               ))
                         OR ((SANTEI-SRYYM = WRK-ZAIKYO-YMD9(1:6)) AND
                             (IDX26       >= IDX29               ))
      *                  初回実施日は通算実施日として記載しない
                         OR ((SANTEI-SRYYM = WRK-ZAIKYO-YMD(1:6) ) AND
                             (IDX26        = IDX28               ))
                           CONTINUE
                         ELSE
                           ADD   1      TO  IDX27
                           MOVE  SANTEI-SRYYM
                                        TO  WRK-BOKOHO-YMD2(IDX27)(1:6)
                           MOVE  IDX26  TO  WRK-BOKOHO-YMD2(IDX27)(7:2)
                         END-IF
                       END-IF
                      END-IF
                     END-PERFORM
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               IF  ((RECE200-SRYYM     >= "202008"   ) AND
                    (WRK-ZAIKYO-KAISU      NOT = ZERO))
               OR  ( RECE200-SRYYM     <  "202008"    )
                 INITIALIZE                WRK-JIDO-SETCOM-AREA
                 IF   RECE200-SRYYM  >= "202008"
                   MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 END-IF
                 MOVE       99      TO     FLG-COMMENT
      *
                 MOVE      ZERO     TO     IDZ
                 INITIALIZE                WRK-FREE-AREA2
      *
                 IF   RECE200-SRYYM  >= "202008"
                   MOVE   60            TO  IDX-JIDO
                   PERFORM  200111-RECECOMMENT-IDXGET-SEC
                   MOVE   WRK-ZAIKYO-YMD
                                        TO  WRK-RECECOM-YMD
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                   MOVE   560           TO  IDX-JIDO
                   PERFORM  200111-RECECOMMENT-IDXGET-SEC
                   MOVE   WRK-ZAIKYO-KAISU
                                        TO  WRK-RECECOM-NUM
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 ELSE
                   ADD        1       TO     IDZ
                   MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                   MOVE   "初回実施　　　月　　日"
                                      TO     WK-FREE-NAME2(IDZ)
                   MOVE    WRK-ZAIKYO-YMD(5:2)   TO  DAY-IDX2
                   MOVE    TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(11:4)
                   MOVE    WRK-ZAIKYO-YMD(7:2)   TO  DAY-IDX2
                   MOVE    TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(17:4)
      *
                   IF   WRK-BOKOHO-YMD2(1) NOT =  SPACE
                     MOVE         1       TO     IDX27
                     PERFORM  VARYING  IDX26  FROM  30  BY  -1
                               UNTIL   IDX26   <     1
                      IF  WRK-BOKOHO-YMD2(IDX26)  NOT =  SPACE
                       ADD        1     TO     IDZ
      *
                       ADD        1     TO     IDX27
                       IF    IDX27   <  10
                         MOVE     11    TO     WK-FREE-YUKOKETA2(IDZ)
                         MOVE   "　回目　　　　月　　日"
                                        TO     WK-FREE-NAME2(IDZ)
                         MOVE    IDX27  TO     DAY-IDX2
                         MOVE    TBL-DAY(DAY-IDX2)(3:2)
                                        TO     WK-FREE-NAME2(IDZ)(1:2)
                       ELSE
                         MOVE     11    TO     WK-FREE-YUKOKETA2(IDZ)
                         MOVE   "　　回目　　　月　　日"
                                        TO     WK-FREE-NAME2(IDZ)
                         MOVE    IDX27  TO     DAY-IDX2
                         MOVE    TBL-DAY(DAY-IDX2)
                                        TO     WK-FREE-NAME2(IDZ)(1:4)
                       END-IF
                       MOVE    WRK-BOKOHO-YMD2(IDX26)(5:2) TO  DAY-IDX2
                       MOVE    TBL-DAY(DAY-IDX2)
                                        TO     WK-FREE-NAME2(IDZ)(11:4)
                       MOVE    WRK-BOKOHO-YMD2(IDX26)(7:2) TO  DAY-IDX2
                       MOVE    TBL-DAY(DAY-IDX2)
                                        TO     WK-FREE-NAME2(IDZ)(17:4)
                      END-IF
                     END-PERFORM
                   END-IF
                 END-IF
      *
                 PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
               END-IF
             END-IF
           END-IF
      *
           .
       2001-BOKOHO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    高気圧酸素治療があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-KIATU-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-KIATU-COMMENT    NOT =  SPACE
             MOVE   CONS-KIATU3   TO   WRK-CHECK-SRYCD
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             MOVE       SPACE               TO  WRK-SJIYMD
             MOVE       ZERO                TO  WRK-ZAIKYO-KAISU
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
                INITIALIZE                      SANTEI-REC
                MOVE    RECE200-HOSPNUM     TO  SANTEI-HOSPNUM
                MOVE    RECE200-PTID        TO  SANTEI-PTID
                EVALUATE  RECE220-FLG-KIATU-COMMENT
                  WHEN      "1"
                    MOVE    CONS-KIATU      TO  SANTEI-SRYCD
                  WHEN      "2"
                    MOVE    CONS-KIATU2     TO  SANTEI-SRYCD
                END-EVALUATE
                MOVE    ZERO                TO  SANTEI-NYUGAIKBN
                MOVE    ZERO                TO  SANTEI-SRYKA
                MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
                MOVE    SANTEI-REC          TO  MCPDATA-REC
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM 900-DBSELECT-SEC
                IF      MCP-RC              =   ZERO
                  MOVE    "tbl_santei"      TO  MCP-TABLE
                  MOVE    "key3"            TO  MCP-PATHNAME
                  PERFORM  900-SANTEI-READ-SEC
                  PERFORM   UNTIL   FLG-SANTEI  =   1
      *
                    IF   SANTEI-SRYYM  <=  RECE200-SRYYM
                    AND  SANTEI-SRYYM  >=  WRK-ZAIKYO-YMD(1:6)
                      MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                      MOVE  WRK-ZAIKYO-YMD9(7:2) TO  IDX29
                      PERFORM  VARYING  IDX26  FROM  31  BY  -1
                                UNTIL   IDX26   <     1
                        IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                          IF ((SANTEI-SRYYM =
                                      WRK-ZAIKYO-YMD(1:6) ) AND
                              (IDX26        < IDX28       ))
                          OR ((SANTEI-SRYYM =
                                      WRK-ZAIKYO-YMD9(1:6)) AND
                              (IDX26       >= IDX29       ))
                            CONTINUE
                          ELSE
                            ADD   1       TO  WRK-ZAIKYO-KAISU
                            MOVE  SANTEI-SRYYM
                                          TO  WRK-SJIYMD(1:6)
                            MOVE  IDX26   TO  WRK-SJIYMD(7:2)
                          END-IF
                        END-IF
                      END-PERFORM
                    END-IF
      *
                    MOVE    "tbl_santei"    TO  MCP-TABLE
                    MOVE    "key3"          TO  MCP-PATHNAME
                    PERFORM  900-SANTEI-READ-SEC
                  END-PERFORM
                END-IF
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM 900-CLOSE-SEC
             END-IF
      *
             IF  ((RECE200-SRYYM     >= "202008") AND
                  (WRK-SJIYMD        NOT = SPACE) AND
                  (WRK-ZAIKYO-KAISU  NOT =  ZERO))
             OR  ((RECE200-SRYYM     <  "202008") AND
                  (WRK-SJIYMD        NOT = SPACE) AND
                  (WRK-ZAIKYO-KAISU  NOT =  ZERO) AND
                  (WRK-ZAIKYO-KAISU     <=   31 ))
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                END-IF
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                IF   RECE200-SRYYM  >= "202008"
                  EVALUATE  RECE220-FLG-KIATU-COMMENT
                    WHEN      "1"
                      MOVE   61            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-SJIYMD    TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      MOVE   561           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-KAISU
                                           TO  WRK-RECECOM-NUM
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      MOVE  1061           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    WHEN      "2"
                      MOVE   62            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-SJIYMD    TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      MOVE   562           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-KAISU
                                           TO  WRK-RECECOM-NUM
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  END-EVALUATE
                ELSE
                  IF    RECE220-FLG-KIATU-COMMENT  =  "1"
                    ADD        1       TO   IDZ
                    MOVE       9       TO   WK-FREE-YUKOKETA2(IDZ)
                    MOVE   "発症　　　月　　日"
                                       TO   WK-FREE-NAME2(IDZ)
                    MOVE    WRK-ZAIKYO-YMD(5:2)  TO  DAY-IDX2
                    MOVE    TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(7:4)
                    MOVE    WRK-ZAIKYO-YMD(7:2)  TO  DAY-IDX2
                    MOVE    TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(13:4)
                  END-IF
      *
                  ADD          1       TO   IDZ
                  MOVE         11      TO   WK-FREE-YUKOKETA2(IDZ)
                  MOVE     "初回実施　　　月　　日"
                                       TO   WK-FREE-NAME2(IDZ)
                  MOVE      WRK-SJIYMD(5:2)   TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(11:4)
                  MOVE      WRK-SJIYMD(7:2)   TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(17:4)
      *
                  ADD          1       TO   IDZ
                  MOVE         11      TO   WK-FREE-YUKOKETA2(IDZ)
                  MOVE     "通算実施回数（　　回）"
                                       TO   WK-FREE-NAME2(IDZ)
                  MOVE      WRK-ZAIKYO-KAISU  TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(15:4)
                END-IF
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-KIATU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    人工腎臓等のコメントがあるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-JINZOUETC-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-JINZOU-COMMENT   =    "1"
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
           END-IF
      *
           .
       2001-JINZOUETC-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    局所陰圧閉鎖処置のコメントがあるか判定
      *  ＃202008選択式コメント対応
      *  （202009で自動記載廃止）
      *  （再度202204から自動記載）
      *****************************************************************
       2001-KYOKUIN-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-KYOKUIN-COMMENT   =    "1" OR "2"
             IF     RECE200-SRYYM  >= "202008"
                 EVALUATE  RECE220-FLG-KYOKUIN-COMMENT
                   WHEN     "1"
                     INITIALIZE            WRK-JIDO-SETCOM-AREA
                     MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
                     MOVE       99      TO     FLG-COMMENT
                     MOVE       80      TO     IDX-JIDO
                     PERFORM    200111-RECECOMMENT-IDXGET-SEC
                     PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
                   WHEN     "2"
                     INITIALIZE            WRK-JIDO-SETCOM-AREA
                     MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
                     MOVE       99      TO     FLG-COMMENT
                     MOVE       142     TO     IDX-JIDO
                     PERFORM    200111-RECECOMMENT-IDXGET-SEC
                     PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
                 END-EVALUATE
             ELSE
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
             END-IF
           END-IF
      *
           .
       2001-KYOKUIN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日のコメントがあるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-SHUJUTSU-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-SHUJUTU-COMMENT   =    SPACE
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                MOVE       1       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
           ELSE
                PERFORM    2099-RECE220-TENSOU-SEC
           END-IF
      *
           .
       2001-SHUJUTSU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    麻酔日のコメントがあるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-MASUI-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-MASUI-COMMENT   =    SPACE
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                MOVE       8       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
           ELSE
                PERFORM    2099-RECE220-TENSOU-SEC
           END-IF
      *
           .
       2001-MASUI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    （検選）のコメントがあるか判定
      *****************************************************************
       2001-KENSEN-HANTEI-SEC          SECTION.
      *
           IF     RECE220-SAFLG   =    "2"
               MOVE       99      TO     FLG-COMMENT
               PERFORM    20011-KENSENTOU-COMMENT-SEC
           END-IF
      *
           .
       2001-KENSEN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    （検選）等のコメント編集
      *****************************************************************
       20011-KENSENTOU-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-RECE230-TAIHI-SEC
      *
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           PERFORM
               UNTIL  ( FLG-RECE230           =   1               )
               OR     ( RECE220-KEY1      NOT =   RECE230-KEY1    )
               OR     ( RECE220-ZAINUM    NOT =   RECE230-ZAINUM  )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   5     )
                         OR      ( RECE230-SRYCD(IDX) =   SPACE )
                 ADD    1             TO      IDX-RECE230
                 MOVE   RECE230-SRYACT-TBL(IDX)
                       TO   WRK-RECE230XX-SRYACT-TBL(IDX-RECE230 1)
      *++++++
                 IF    IDX-RECE230  =  RECE220-MEISAISU
      *
                   IF  WRK-RECE230XX-SRYCD(IDX-RECE230 1)(1:1)
                                                = "8"
                   OR  WRK-RECE230XX-SRYCD(IDX-RECE230 1)(1:3)
                                                = "008"
      *
                     COMPUTE   IDV  =
                      (WRK-RECE230XX-YUKOKETA(IDX-RECE230 1) * 2) + 1
      *
                     MOVE    1    TO   IDV2
                     IF  WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)
                                                        NOT = SPACE
                       PERFORM  VARYING  IDV3  FROM  140  BY  -1
                                 UNTIL   IDV3    <     1
                         IF  WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)
                                              (IDV3:1)  NOT = SPACE
                           COMPUTE  IDV2 = IDV2 + IDV3
                           MOVE     1   TO IDV3
                         END-IF
                       END-PERFORM
                     END-IF
      *
                     IF   IDV2  <= 131
                       MOVE    "　×"   TO
                       WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)(IDV2:4)
                     END-IF
                     IF   IDV   <= 291
                       MOVE    "　×"   TO
                       WRK-RECE230XX-NAME(IDX-RECE230 1)(IDV:4)
                     END-IF
      *
                     COMPUTE   IDV  =  IDV  +  4
                     COMPUTE   IDV2 =  IDV2 +  4
      *
                     MOVE    RECE220-ZAIKAISU   TO   DAY-IDX4
                     PERFORM 20011-KAISU-HENSYU2-SEC
                     IF   IDV2  <= 135
                       MOVE    WRK-HENSYU-KAISU4  TO
                       WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)(IDV2:6)
                     END-IF
                     IF   IDV   <= 295
                       MOVE    WRK-HENSYU-KAISU4  TO
                       WRK-RECE230XX-NAME(IDX-RECE230 1)(IDV:6)
                       COMPUTE WRK-RECE230XX-YUKOKETA(IDX-RECE230 1) =
                               WRK-RECE230XX-YUKOKETA(IDX-RECE230 1) +
                               5
                     END-IF
      *
                   END-IF
      *
                 END-IF
      *++++++
               END-PERFORM
      *
               PERFORM 990-RECE230-NEXT-SEC
      *
           END-PERFORM
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
                    INITIALIZE                        RECE2309-REC
                    MOVE    WRK-RECE230-KEY       TO  RECE2309-KEY
                    ADD     1                     TO  WRK-RENNUM
                    MOVE    WRK-RENNUM            TO  RECE2309-RENNUM
                    MOVE    WRK-RECE230-PTNUM     TO  RECE2309-PTNUM
                    MOVE    WRK-RECE230-SRYKA     TO  RECE2309-SRYKA
                    MOVE    WRK-RECE230-SRYKBN    TO  RECE2309-SRYKBN
                    MOVE    WRK-RECE230-SRYSYUKBN TO  RECE2309-SRYSYUKBN
                    MOVE    WRK-RECE230-JIHIMONEY TO  RECE2309-JIHIMONEY
                    PERFORM  VARYING   IDX   FROM   1   BY   1
                             UNTIL   (IDX       >    5)   OR
                                     (FLG-WRKRECE230   =   1)
                       ADD         1             TO    IDX-RECE230
                       IF (WRK-RECE230XX-SRYCD(IDX-RECE230 1) = SPACE)
                       OR (IDX-RECE230                        >  100 )
                           MOVE    1             TO    FLG-WRKRECE230
                       ELSE
                           MOVE  WRK-RECE230XX-SRYACT-TBL(IDX-RECE230 1)
                                            TO  RECE2309-SRYACT-TBL(IDX)
                           ADD   1          TO  WRK-CNT-MEISAI
                       END-IF
                    END-PERFORM
                    IF   RECE2309-SRYCD(1)  NOT =  SPACE
                       WRITE   RECE2309-REC
                       ADD     1            TO   CNT-RECE2309
                    END-IF
           END-PERFORM
      *
           MOVE    RECE220-REC       TO      RECE2209-REC
           MOVE    WRK-CNT-MEISAI    TO      RECE2209-MEISAISU
           WRITE   RECE2209-REC
           ADD     1                 TO      CNT-RECE2209
      *
           .
       20011-KENSENTOU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    回数編集
      *****************************************************************
       20011-KAISU-HENSYU-SEC          SECTION.
      *
           MOVE    SPACE                TO  WRK-HENSYU-KAISU
           MOVE    SPACE                TO  WRK-HENSYU-KAISU2
      *
           MOVE    DAY-IDX2             TO  WRK-HENSYU-KAISU
           IF      WRK-HENSYU-KAISU(1:1) =  "0"
               MOVE      SPACE          TO  WRK-HENSYU-KAISU(1:1)
           END-IF
      *
           INITIALIZE                       ORCSKANACHKAREA
           MOVE    "2"                  TO  KANACHK-SYORI
           MOVE    WRK-HENSYU-KAISU     TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
           IF      KANACHK-RC      =   ZERO
                MOVE    KANACHK-OUT-INPUT(1:4)
                                        TO  WRK-HENSYU-KAISU2
           END-IF
      *
           .
       20011-KAISU-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    回数編集２
      *****************************************************************
       20011-KAISU-HENSYU2-SEC          SECTION.
      *
           MOVE    SPACE                TO  WRK-HENSYU-KAISU3
           MOVE    SPACE                TO  WRK-HENSYU-KAISU4
      *
           MOVE    DAY-IDX4             TO  WRK-HENSYU-KAISU3
           IF      WRK-HENSYU-KAISU3(1:1) =  "0"
               MOVE      SPACE          TO  WRK-HENSYU-KAISU3(1:1)
           END-IF
           IF      WRK-HENSYU-KAISU3(2:1) =  "0"
               MOVE      SPACE          TO  WRK-HENSYU-KAISU3(2:1)
           END-IF
      *
           INITIALIZE                       ORCSKANACHKAREA
           MOVE    "2"                  TO  KANACHK-SYORI
           MOVE    WRK-HENSYU-KAISU3    TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
           IF      KANACHK-RC      =   ZERO
                MOVE    KANACHK-OUT-INPUT(1:6)
                                        TO  WRK-HENSYU-KAISU4
           END-IF
      *
           .
       20011-KAISU-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    検査（ＢＮＰ、ＮＴ−ｐｒｏＢＮＰ、ＨＡＮＰ）があるか判定
      *  ＃202010選択式コメント対応
      *****************************************************************
       2001-KENSA-HANTEI-SEC          SECTION.
      *
           IF  ((RECE200-SRYYM  >= "201804"       ) AND
                (RECE220-FLG-KENSA-COMMENT  =  "1") AND
                (CNT-KENSA                 >=   2 ))
           OR  ((RECE200-SRYYM  <= "201803"       ) AND
                (RECE220-FLG-KENSA-COMMENT  =  "1"))
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE       7       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-KENSA-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    時間外緊急院内検査加算・外来迅速検体検査加算があるか判定
      *  ＃202007コメント対応「840000099」+「引き続き入院」
      *****************************************************************
       2001-KENKSN-HANTEI-SEC          SECTION.
      *
           MOVE   ZERO  TO   FLG-OK2
           IF     RECE220-FLG-KENKSN-COMMENT  =  "1"
               PERFORM  20011-NYUINRRK-KENSAKU-SEC
           END-IF
      *
           IF   RECE200-SRYYM  >=  "202007"
             IF   RECE220-FLG-KENKSN2-COMMENT =  "1"
             OR   FLG-OK2  =  1
               INITIALIZE          WRK-JIDO-SETCOM-AREA
               IF     RECE220-FLG-KENKSN2-COMMENT =  "1"
               AND    FLG-OK2                     =  ZERO
                 MOVE    "3"    TO     WRK-JIDO-SETCOMFLG
               ELSE
                 IF   RECE220-FLG-KENKSN2-COMMENT =  "1"
                 AND  FLG-OK2                     =   1
                   MOVE  "4"    TO     WRK-JIDO-SETCOMFLG
                 ELSE
                   MOVE  "5"    TO     WRK-JIDO-SETCOMFLG
                 END-IF
               END-IF
               MOVE     99      TO     FLG-COMMENT
               PERFORM  20011-SHUJUTSU-ETC2-COMMENT-SEC
             END-IF
           ELSE
             IF   FLG-OK2  =  1
                  INITIALIZE          WRK-JIDO-SETCOM-AREA
                  MOVE       99      TO     FLG-COMMENT
      *
                  PERFORM  200111-RECE230-TAIHI-SEC
      *
      *           ＲＥＣＥ０５ファイルの内容をテーブルに退避
                  MOVE    ZERO                 TO  IDX-RECE230
                  MOVE    SPACE                TO  WRK-RECE230XX-REC
                  INITIALIZE                       WRK-RECE230XX-REC
      *
                  MOVE    RECE220-MEISAISU     TO  MAX-MEISAISU
      *           「引き続き入院」
                  MOVE    "820100129"          TO  WRK-TENSU-SRYCD
                  MOVE    RECE200-SRYYM        TO  WRK-TENSU-SRYYM
                  PERFORM 900-TENSU-TBL-SEC
      *
                  COMPUTE MAX-MEISAISU = MAX-MEISAISU + 1
                  MOVE TNS-SRYCD
                            TO WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                  MOVE ZERO TO WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
                  MOVE TNS-YUKOKETA
                            TO WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                  MOVE TNS-NAME
                            TO WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                               WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
      *
                  PERFORM 200111-SRYACTINF-HENSYU-SEC
             END-IF
           END-IF
      *
           .
       2001-KENKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院履歴検索
      *****************************************************************
       20011-NYUINRRK-KENSAKU-SEC          SECTION.
      *
           PERFORM  VARYING  IDX44  FROM  1  BY  1
                     UNTIL  (IDX44    >  31)
                      OR    (FLG-OK2  =   1)
             IF   RECE220-KAISU(1 IDX44)  NOT =  ZERO
               INITIALIZE                      PTNYUINRRK-REC
               MOVE    RECE200-HOSPNUM     TO  PTNYUINRRK-HOSPNUM
               MOVE    RECE200-PTID        TO  PTNYUINRRK-PTID
               MOVE    RECE200-SRYYM       TO  PTNYUINRRK-NYUINYMD(1:6)
               MOVE    IDX44               TO  PTNYUINRRK-NYUINYMD(7:2)
               MOVE    PTNYUINRRK-REC      TO  MCPDATA-REC
               MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
               MOVE    "key39"             TO  MCP-PATHNAME
               PERFORM  900-DBSELECT-SEC
               IF      MCP-RC   =   ZERO
                 MOVE    "tbl_ptnyuinrrk"  TO  MCP-TABLE
                 MOVE    "key39"           TO  MCP-PATHNAME
                 PERFORM  900-PTNYUINRRK-READ-SEC
                 IF    FLG-PTNYUINRRK  =  ZERO
                    MOVE    1              TO  FLG-OK2
                 END-IF
               END-IF
               MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
               MOVE    "key39"             TO  MCP-PATHNAME
               PERFORM  900-CLOSE-SEC
             END-IF
           END-PERFORM
      *
           .
       20011-NYUINRRK-KENSAKU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＣＴ・ＭＲＩがあるか判定
      *****************************************************************
       2001-CTMRI-HANTEI-SEC          SECTION.
      *
           IF    ( RECE220-FLG-CTMRI-COMMENT   =    "1"  )
           OR    ((RECE220-FLG-CTMRI-COMMENT   =   SPACE) AND
                  (RECE220-SENTAKUBUIFLG   NOT =   SPACE))
             IF    RECE220-FLG-CTMRI-COMMENT   =    "1"
                MOVE       2       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
             ELSE
                MOVE       99      TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC3-COMMENT-SEC
             END-IF
           END-IF
      *
           .
       2001-CTMRI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    時間外緊急院内画像診断加算があるか判定
      *  ＃202007コメント対応「840000099」+「引き続き入院」
      *****************************************************************
       2001-KINGAZ-HANTEI-SEC          SECTION.
      *
           MOVE   ZERO  TO   FLG-OK2
           IF     RECE220-FLG-KINGAZ-COMMENT  =  "1"
               PERFORM  20011-NYUINRRK-KENSAKU-SEC
           END-IF
      *
           IF   RECE200-SRYYM  >=  "202007"
             IF   RECE220-FLG-KINGAZ2-COMMENT =  "1"
             OR   FLG-OK2  =  1
               INITIALIZE          WRK-JIDO-SETCOM-AREA
               IF     RECE220-FLG-KINGAZ2-COMMENT =  "1"
               AND    FLG-OK2                     =  ZERO
                 MOVE    "3"    TO     WRK-JIDO-SETCOMFLG
               ELSE
                 IF   RECE220-FLG-KINGAZ2-COMMENT =  "1"
                 AND  FLG-OK2                     =   1
                   MOVE  "4"    TO     WRK-JIDO-SETCOMFLG
                 ELSE
                   MOVE  "5"    TO     WRK-JIDO-SETCOMFLG
                 END-IF
               END-IF
               MOVE     99      TO     FLG-COMMENT
               PERFORM  20011-SHUJUTSU-ETC2-COMMENT-SEC
             END-IF
           ELSE
             IF   FLG-OK2  =  1
                  INITIALIZE          WRK-JIDO-SETCOM-AREA
                  MOVE       99      TO     FLG-COMMENT
      *
                  PERFORM  200111-RECE230-TAIHI-SEC
      *
      *           ＲＥＣＥ０５ファイルの内容をテーブルに退避
                  MOVE    ZERO                 TO  IDX-RECE230
                  MOVE    SPACE                TO  WRK-RECE230XX-REC
                  INITIALIZE                       WRK-RECE230XX-REC
      *
                  MOVE    RECE220-MEISAISU     TO  MAX-MEISAISU
      *           「引き続き入院」
                  MOVE    "820100129"          TO  WRK-TENSU-SRYCD
                  MOVE    RECE200-SRYYM        TO  WRK-TENSU-SRYYM
                  PERFORM 900-TENSU-TBL-SEC
      *
                  COMPUTE MAX-MEISAISU = MAX-MEISAISU + 1
                  MOVE TNS-SRYCD
                            TO WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                  MOVE ZERO TO WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
                  MOVE TNS-YUKOKETA
                            TO WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                  MOVE TNS-NAME
                            TO WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                               WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
      *
                  PERFORM 200111-SRYACTINF-HENSYU-SEC
             END-IF
           END-IF
      *
           .
       2001-KINGAZ-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科退院前訪問指導料があるか判定
      *****************************************************************
       2001-HOUMONSIDO-SEI-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-HOUSEI-COMMENT   =    "1"
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-HOUMONSIDO-SEI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院時服薬指導加算を算定時の前月薬剤管理指導料のコメント編集
      *****************************************************************
       20011-TAIIN-COMMENT-SEC          SECTION.
      *
           MOVE       RECE220-REC      TO  RECE2209-REC
           EVALUATE   FLG-HANTEI
             WHEN       1
                ADD     1              TO  RECE2209-MEISAISU
             WHEN       2
                ADD     2              TO  RECE2209-MEISAISU
           END-EVALUATE
           WRITE      RECE2209-REC
           ADD     1                   TO  CNT-RECE2209
      *
           INITIALIZE                      RECE230-REC
           MOVE    RECE220-KEY1        TO  RECE230-KEY1
           MOVE    RECE220-ZAINUM      TO  RECE230-ZAINUM
           START   RECE230-FILE
                 KEY IS    >=   RECE230-KEY
                 INVALID
                     MOVE    1         TO  FLG-RECE230
                 NOT INVALID
                     PERFORM 990-RECE230-NEXT-SEC
           END-START
      *
           MOVE    RECE230-REC         TO  RECE2309-REC
           EVALUATE   FLG-HANTEI
             WHEN       1
               MOVE    RECE230-SRYACT-TBL(1) TO  RECE2309-SRYACT-TBL(1)
               MOVE    RECE230-SRYACT-TBL(2) TO  RECE2309-SRYACT-TBL(3)
               MOVE    RECE230-SRYACT-TBL(3) TO  RECE2309-SRYACT-TBL(4)
               MOVE    RECE230-SRYACT-TBL(4) TO  RECE2309-SRYACT-TBL(5)
      *
               MOVE    SPACE                TO  RECE2309-SRYACT-TBL(2)
               INITIALIZE                       RECE2309-SRYACT-TBL(2)
               MOVE    "810000001"          TO  RECE2309-SRYCD(2)
               MOVE    ZERO                 TO  RECE2309-SRYSURYO(2)
               PERFORM  200111-SANTEI-DAY-SEC
               PERFORM  200111-TAIIN-COMMENT-HENSYU-SEC
             WHEN       2
               MOVE    RECE230-SRYACT-TBL(1) TO  RECE2309-SRYACT-TBL(1)
               MOVE    RECE230-SRYACT-TBL(2) TO  RECE2309-SRYACT-TBL(4)
               MOVE    RECE230-SRYACT-TBL(3) TO  RECE2309-SRYACT-TBL(5)
      *
               MOVE    SPACE                TO  RECE2309-SRYACT-TBL(2)
               INITIALIZE                       RECE2309-SRYACT-TBL(2)
               MOVE    "810000001"          TO  RECE2309-SRYCD(2)
               MOVE    ZERO                 TO  RECE2309-SRYSURYO(2)
               PERFORM  200111-SANTEI-DAY-SEC
               PERFORM  200111-TAIIN-COMMENT-HENSYU-SEC
      *
               MOVE    SPACE                TO  RECE2309-SRYACT-TBL(3)
               INITIALIZE                       RECE2309-SRYACT-TBL(3)
               MOVE    "810000001"          TO  RECE2309-SRYCD(3)
               MOVE    ZERO                 TO  RECE2309-SRYSURYO(3)
               MOVE    16                   TO  RECE2309-YUKOKETA(3)
               MOVE    "薬剤管理指導料算定　　　月　　日"
                                            TO  RECE2309-NAME(3)
               MOVE     WRK-TUKI-YAKUKAN    TO  DAY-IDX
               MOVE     TBL-DAY(DAY-IDX)    TO  RECE2309-NAME(3)(21:4)
               MOVE     WRK-DAY-YAKUKAN     TO  DAY-IDX
               MOVE     TBL-DAY(DAY-IDX)    TO  RECE2309-NAME(3)(27:4)
           END-EVALUATE
           WRITE    RECE2309-REC
           ADD      1                   TO  CNT-RECE2309
      *
           .
       20011-TAIIN-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定日編集
      *****************************************************************
       200111-TAIIN-COMMENT-HENSYU-SEC          SECTION.
      *
           MOVE     TB-SANTEI-DAY(1)    TO  DAY-IDX
           IF       DAY-IDX  <  10
             MOVE    5                  TO  RECE2309-YUKOKETA(2)
             MOVE    "算定　　日"       TO  RECE2309-NAME(2)(1:10)
             MOVE   TBL-DAY(DAY-IDX)    TO  RECE2309-NAME(2)(5:4)
             MOVE   11                  TO  IDX17
           ELSE
             MOVE    6                  TO  RECE2309-YUKOKETA(2)
             MOVE    "算定　　　日"     TO  RECE2309-NAME(2)(1:12)
             MOVE   TBL-DAY(DAY-IDX)    TO  RECE2309-NAME(2)(7:4)
             MOVE   13                  TO  IDX17
           END-IF
           IF       TB-SANTEI-DAY(2)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(2)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE2309-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE2309-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE2309-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE2309-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
           IF       TB-SANTEI-DAY(3)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(3)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE2309-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE2309-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE2309-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE2309-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
           IF       TB-SANTEI-DAY(4)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(4)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE2309-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE2309-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE2309-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE2309-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
           IF       TB-SANTEI-DAY(5)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(5)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE2309-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE2309-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE2309-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE2309-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE2309-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
      *
           .
       200111-TAIIN-COMMENT-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日等のコメント編集（差込：上）
      *****************************************************************
       20011-SHUJUTSU-ETC-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-SANTEI-DAY-SEC
      *
           MOVE       ZERO       TO   IDZ                               
           INITIALIZE            WRK-FREE-AREA2                         
      *
           PERFORM  20011-FREE-COMMENT2-SEC                              
      *
           PERFORM  200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                ADD    1     TO  IDX-RECE230
                MOVE   "810000001"
                             TO  WRK-RECE230XX-SRYCD(IDX-RECE230 1)
                MOVE   ZERO  TO  WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
           END-PERFORM 
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-SHUJUTSU-ETC-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日等のコメント編集２（差込：下）
      *****************************************************************
       20011-SHUJUTSU-ETC2-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-SANTEI-DAY-SEC
      *
           MOVE       ZERO       TO   IDZ                               
           INITIALIZE            WRK-FREE-AREA2                         
      *
           IF  ((RECE200-SRYYM      >=  "202008"         ) AND
                (WRK-JIDO-SETCOMFLG  =  "2"              ))
           OR  ((RECE200-SRYYM      >=  "202007"         ) AND
                (WRK-JIDO-SETCOMFLG  =  "3" OR "4" OR "5"))
             PERFORM  VARYING  IDX  FROM  1  BY  1
                       UNTIL  (IDX                 >    31)
                         OR   (TB-SANTEI-DAY(IDX)  =  ZERO)
               EVALUATE  WRK-JIDO-SETCOMFLG
                 WHEN      "2"
                   MOVE  RECE200-SRYYM      TO  WRK-RECECOM-YMD(1:6)
                   MOVE  TB-SANTEI-DAY(IDX) TO  WRK-RECECOM-YMD(7:2)
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 WHEN      "3"
                 WHEN      "4"
                   INITIALIZE                   WRK-RECECOM-AREA
                   MOVE  RECE200-SRYYM      TO  WRK-RECECOM-YMD(1:6)
                   MOVE  TB-SANTEI-DAY(IDX) TO  WRK-RECECOM-YMD(7:2)
                   PERFORM  200111-RECECOMMENT-HENSYU3-SEC
               END-EVALUATE
             END-PERFORM
           ELSE
             PERFORM  20011-FREE-COMMENT2-SEC
           END-IF
      *
           IF   (RECE200-SRYYM      >=  "202007"  )
           AND  (WRK-JIDO-SETCOMFLG  =  "4" OR "5")
                   PERFORM  200111-RECECOMMENT-HENSYU4-SEC
           END-IF
      *
           PERFORM  200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           MOVE    RECE220-MEISAISU     TO  MAX-MEISAISU
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
                IF  WK-FREE-SRYCD2(IDX) = SPACE
                  MOVE "810000001"
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                ELSE
                  MOVE WK-FREE-SRYCD2(IDX)
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                END-IF
                MOVE   ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                MOVE   WK-FREE-INPUTCOMENT2(IDX)
                          TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
           END-PERFORM 
      *
           IF    FLG-KAISIEN  =  1
            IF   RECE200-SRYYM  >= "202008"
              MOVE   ZERO          TO  IDZ
              INITIALIZE           WRK-FREE-AREA2
              MOVE   78            TO  IDX-JIDO
              PERFORM  200111-RECECOMMENT-IDXGET-SEC
              MOVE   WRK-KAISIEN-FSANTEIYMD
                                   TO  WRK-RECECOM-YMD
              PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE  WK-FREE-SRYCD2(1)
                            TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
              MOVE  ZERO    TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE  WK-FREE-YUKOKETA2(1)
                            TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  WK-FREE-NAME2(1)
                            TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
              MOVE  WK-FREE-INPUTCOMENT2(1)
                         TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
              MOVE  ZERO    TO  FLG-KAISIEN
              MOVE  "2"     TO  WRK-JIDO-SETCOMFLG
            ELSE
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE   "810000001"
                            TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
              MOVE   ZERO   TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE   12     TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE   "初回算定日　　　月　　日"
                            TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
              MOVE   WRK-KAISIEN-FSANTEIYMD(5:2)   TO  DAY-IDX2
              MOVE   TBL-DAY(DAY-IDX2)
                       TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(13:4)
              MOVE   WRK-KAISIEN-FSANTEIYMD(7:2)   TO  DAY-IDX2
              MOVE   TBL-DAY(DAY-IDX2)
                       TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(19:4)
              MOVE   ZERO   TO  FLG-KAISIEN
            END-IF
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-SHUJUTSU-ETC2-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日等のコメント編集（差込：上）
      *    ※剤先頭に部位コメントを差し込むために＠明細追加する
      *****************************************************************
       20011-SHUJUTSU-ETC3-COMMENT-SEC          SECTION.
      *
           PERFORM  200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           PERFORM  VARYING  IDX50  FROM  1  BY  1
                     UNTIL  (IDX50 >   10                 )
                      OR    (IDX50 > RECE220-SENTAKUBUICNT)
             ADD   1           TO IDX-RECE230
             MOVE  "810000001" TO WRK-RECE230XX-SRYCD(IDX-RECE230 1)
             MOVE  ZERO        TO WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
             MOVE  ZERO        TO WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
             MOVE  SPACE       TO WRK-RECE230XX-NAME(IDX-RECE230 1)
             MOVE  "1"         TO WRK-RECE230XX-RECEPTFLG(IDX-RECE230 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-SHUJUTSU-ETC3-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    包括診療分のコメント編集（差込：上）
      *****************************************************************
       20011-HOKATU-COMMENT-SEC          SECTION.
      *
           PERFORM  200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           ADD    1             TO IDX-RECE230
           MOVE  "810000001"    TO WRK-RECE230XX-SRYCD(IDX-RECE230 1)
           MOVE   ZERO          TO WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
      *
           IF    RECE220-ZAIKBN  =  3 OR 4
             EVALUATE  RECE220-JISANYAKKBN
              WHEN     "1"
               MOVE  19    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療・自院処方分）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "2"
               MOVE  19    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療・他院処方分）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "3"
               MOVE  20    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療外・自院処方分）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "4"
               MOVE  20    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療外・他院処方分）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "5"
               MOVE  24    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療・自院処方分・数量不明）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "6"
               MOVE  24    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療・他院処方分・数量不明）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "7"
               MOVE  25    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療外・自院処方分・数量不明）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
              WHEN     "8"
               MOVE  25    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【持参薬】（入院契機治療外・他院処方分・数量不明）"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
             END-EVALUATE
           ELSE
               MOVE   6    TO  WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
               MOVE "【包括診療】"
                           TO  WRK-RECE230XX-NAME(IDX-RECE230 1)
           END-IF
      *
           IF    (RECE220-FLG-CTMRI-COMMENT   =   SPACE)
           AND   (RECE220-SENTAKUBUIFLG   NOT =   SPACE)
            PERFORM  VARYING  IDX50  FROM  1  BY  1
                      UNTIL  (IDX50 >    9                 )
                       OR    (IDX50 > RECE220-SENTAKUBUICNT)
             ADD   1           TO IDX-RECE230
             MOVE  "810000001" TO WRK-RECE230XX-SRYCD(IDX-RECE230 1)
             MOVE  ZERO        TO WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
             MOVE  ZERO        TO WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
             MOVE  SPACE       TO WRK-RECE230XX-NAME(IDX-RECE230 1)
             MOVE  "1"         TO WRK-RECE230XX-RECEPTFLG(IDX-RECE230 1)
            END-PERFORM
           END-IF
      *
           PERFORM  200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-HOKATU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索
      *****************************************************************
       20011-CYOJKSN-KAISHIDAY-SEC          SECTION.
      *
           MOVE   SPACE   TO  WRK-CYOJKSN-YMD-XXX
                              WRK-CYOJKSN-COM-XXX
                              WRK-CYOJKSN-COM2-XXX
           MOVE   SPACE   TO  WRK-CYOJKSN-YMD-YYY
                              WRK-CYOJKSN-COM-YYY
                              WRK-CYOJKSN-COM2-YYY
      *
           IF     RECE200-CYOJKSNFLG   =   "X" OR "Z"
      *
             MOVE     "key21"     TO   WRK-SRYACCT-PATHNAME
             MOVE      1          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY4-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-XXX(1)
                                  TO   WRK-CYOJKSN-YMD-XXX
             ELSE
               IF  WRK-CYOJKSN-KAISHIDAY-XXX(2)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-XXX(2)
                                  TO   WRK-CYOJKSN-YMD-XXX
               END-IF
             END-IF
      *
      ****   IF     FLG-CHECK-MAE  =  1
      ****       MOVE   SPACE   TO  WRK-CYOJKSN-YMD-XXX
      ****   END-IF
      *
      *      算定開始日コメントがあるか検索
      *
             MOVE     "key22"     TO   WRK-SRYACCT-PATHNAME
             MOVE      2          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY4-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)  NOT = SPACE
             AND   WRK-CYOJKSN-KAISHIDAY-XXX(2)  NOT = SPACE
               IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)(1:6) =
                           WRK-CYOJKSN-KAISHIDAY-XXX(2)(1:6)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(1)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(1)
                                  TO   WRK-CYOJKSN-COM2-XXX
               ELSE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(2)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(2)
                                  TO   WRK-CYOJKSN-COM2-XXX
               END-IF
             ELSE
               IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(1)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(1)
                                  TO   WRK-CYOJKSN-COM2-XXX
               ELSE
                 IF  WRK-CYOJKSN-KAISHIDAY-XXX(2)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(2)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(2)
                                  TO   WRK-CYOJKSN-COM2-XXX
                 END-IF
               END-IF
             END-IF
      *
           END-IF
      *
           IF     RECE200-CYOJKSNFLG   =   "Y" OR "Z"
      *
             MOVE     "key21"     TO   WRK-SRYACCT-PATHNAME
             MOVE      1          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY5-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-YYY(1)
                                  TO   WRK-CYOJKSN-YMD-YYY
             ELSE
               IF  WRK-CYOJKSN-KAISHIDAY-YYY(2)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-YYY(2)
                                  TO   WRK-CYOJKSN-YMD-YYY
               END-IF
             END-IF
      *
      ****   IF     FLG-CHECK-MAE  =  1
      ****       MOVE   SPACE   TO  WRK-CYOJKSN-YMD-YYY
      ****   END-IF
      *
      *      算定開始日コメントがあるか検索
      *
             MOVE     "key22"     TO   WRK-SRYACCT-PATHNAME
             MOVE      2          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY5-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)  NOT = SPACE
             AND   WRK-CYOJKSN-KAISHIDAY-YYY(2)  NOT = SPACE
               IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)(1:6) =
                           WRK-CYOJKSN-KAISHIDAY-YYY(2)(1:6)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(1)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(1)
                                  TO   WRK-CYOJKSN-COM2-YYY
               ELSE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(2)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(2)
                                  TO   WRK-CYOJKSN-COM2-YYY
               END-IF
             ELSE
               IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(1)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(1)
                                  TO   WRK-CYOJKSN-COM2-YYY
               ELSE
                 IF  WRK-CYOJKSN-KAISHIDAY-YYY(2)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(2)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(2)
                                  TO   WRK-CYOJKSN-COM2-YYY
                 END-IF
               END-IF
             END-IF
      *
           END-IF
      *
           .
       20011-CYOJKSN-KAISHIDAY-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索２
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY2-SEC          SECTION.
      *
           INITIALIZE                   SRYACCT-REC
           MOVE    SRY-HOSPNUM      TO  ACCT-HOSPNUM
           MOVE    SRY-NYUGAIKBN    TO  ACCT-NYUGAIKBN
           MOVE    SRY-PTID         TO  ACCT-PTID
           MOVE    SRY-SRYKA        TO  ACCT-SRYKA
           MOVE    SRY-SRYYM        TO  ACCT-SRYYM
           MOVE    SRY-ZAINUM       TO  ACCT-ZAINUM
           MOVE    SRYACCT-REC      TO  MCPDATA-REC
           MOVE    "tbl_sryacct"    TO  MCP-TABLE
           MOVE    "key31"          TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC           =   ZERO
              MOVE "tbl_sryacct"    TO  MCP-TABLE
              MOVE "key31"          TO  MCP-PATHNAME
              PERFORM 900-DBFETCH-SEC
              IF      MCP-RC        =   ZERO
                MOVE  MCPDATA-REC   TO  SRYACCT-REC
                IF (WRK-CYOJKSN-TAIHIYM = SPACE     )
                OR (WRK-CYOJKSN-TAIHIYM = ACCT-SRYYM)
                 IF  ( ACCT-SRYYM   >  RECE200-SRYYM )
                 OR  ((FLG-CYOJKSN  =   2      ) AND
                      (ACCT-SRYYM   <  "201404")     )
                  CONTINUE
                 ELSE
                  MOVE    RECE200-NYUINYMD(7:2) TO  IDX28
                  PERFORM  VARYING  IDX26  FROM  1  BY  1
                            UNTIL   IDX26   >   31
                    IF   ACCT-DAY(1 IDX26)  NOT =  ZERO
                      IF  (ACCT-SRYYM = RECE200-NYUINYMD(1:6))
                      AND (IDX26      <  IDX28               )
                          MOVE   1           TO  FLG-CHECK-MAE
                      ELSE
                        EVALUATE  FLG-CYOJKSN
                          WHEN       1
                            IF   WRK-CYOJKSN-TAIHIYM = SPACE
                              MOVE  ACCT-SRYYM  TO  WRK-CYOJKSN-TAIHIYM
                              MOVE  IDX26       TO  WRK-CYOJKSN-TAIHIDD
                              MOVE  31          TO  IDX26
                            ELSE
                              IF   IDX26  <  WRK-CYOJKSN-TAIHIDD
                                MOVE   IDX26    TO  WRK-CYOJKSN-TAIHIDD
                                MOVE   31       TO  IDX26
                              END-IF
                            END-IF
                          WHEN       2
                            IF   WRK-CYOJKSN-TAIHIYM = SPACE
                               MOVE ZERO   TO FLG-CYOJKSNCOMARI
                               MOVE SPACE  TO WRK-CYOJKSN-INPUTCOMENT
                               MOVE SPACE  TO WRK-CYOJKSN-NAME
                               PERFORM 200111-CYOJKSN-KAISHIDAY3-SEC
                               IF   FLG-CYOJKSNCOMARI  =  1
                                 MOVE  WRK-CYOJKSN-INPUTCOMENT
                                           TO WRK-CYOJKSN-INPUTCOMENT2
                                 MOVE  WRK-CYOJKSN-NAME
                                           TO WRK-CYOJKSN-NAME2
      *
                                 MOVE ACCT-SRYYM TO WRK-CYOJKSN-TAIHIYM
                                 MOVE IDX26      TO WRK-CYOJKSN-TAIHIDD
                               END-IF
                               MOVE   31         TO IDX26
                            ELSE
                             IF   IDX26  <  WRK-CYOJKSN-TAIHIDD
                               MOVE ZERO   TO FLG-CYOJKSNCOMARI
                               MOVE SPACE  TO WRK-CYOJKSN-INPUTCOMENT
                               MOVE SPACE  TO WRK-CYOJKSN-NAME
                               PERFORM 200111-CYOJKSN-KAISHIDAY3-SEC
                               IF   FLG-CYOJKSNCOMARI  =  1
                                 MOVE  WRK-CYOJKSN-INPUTCOMENT
                                           TO WRK-CYOJKSN-INPUTCOMENT2
                                 MOVE  WRK-CYOJKSN-NAME
                                           TO WRK-CYOJKSN-NAME2
      *
                                 MOVE IDX26      TO WRK-CYOJKSN-TAIHIDD
                               END-IF
                               MOVE   31         TO IDX26
                             END-IF
                            END-IF
                        END-EVALUATE
                      END-IF
                    END-IF
                  END-PERFORM
                 END-IF
                ELSE
                  MOVE    1         TO  FLG-CYOJKSN-OK
                END-IF
              END-IF
           END-IF
           MOVE    "tbl_sryacct"    TO  MCP-TABLE
           MOVE    "key31"          TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       200111-CYOJKSN-KAISHIDAY2-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索３
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY3-SEC          SECTION.
      *
           INITIALIZE                         SRYACT-REC
           MOVE    ACCT-HOSPNUM           TO  SRY-HOSPNUM
           MOVE    ACCT-NYUGAIKBN         TO  SRY-NYUGAIKBN
           MOVE    ACCT-PTID              TO  SRY-PTID
           MOVE    ACCT-SRYKA             TO  SRY-SRYKA
           MOVE    ACCT-SRYYM             TO  SRY-SRYYM
           MOVE    ACCT-ZAINUM            TO  SRY-ZAINUM
           MOVE    SRYACT-REC             TO  MCPDATA-REC
           MOVE    "tbl_sryact"           TO  MCP-TABLE
           MOVE    "key2"                 TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC                 =   ZERO
              MOVE    "tbl_sryact"        TO  MCP-TABLE
              MOVE    "key2"              TO  MCP-PATHNAME
              PERFORM  900-SRYACT-READ-SEC
              PERFORM  UNTIL  (FLG-SRYACT        =  1)
                        OR    (FLG-CYOJKSNCOMARI =  1)
                PERFORM  VARYING  IDX12  FROM  1  BY  1
                          UNTIL  (IDX12             >    5   )
                           OR    (SRY-SRYCD(IDX12)  =   SPACE)
                           OR    (FLG-CYOJKSNCOMARI =    1   )
                   IF  SRY-SRYCD(IDX12)  =  "840000056" OR "840000556"
                                        OR  "850100020" OR "850100021"
                      MOVE    1    TO   FLG-CYOJKSNCOMARI
                      IF   SRY-INPUTNUM(IDX12)  NOT =  ZERO
                        INITIALIZE                    PTCOM-REC
                        MOVE  SRY-HOSPNUM         TO  PTCOM-HOSPNUM
                        MOVE  SRY-PTID            TO  PTCOM-PTID
                        MOVE  SRY-ZAINUM          TO  PTCOM-ZAINUM
                        MOVE  SRY-SRYCD(IDX12)    TO  PTCOM-SRYCD
                        MOVE  SRY-INPUTNUM(IDX12) TO  PTCOM-RENNUM
                        PERFORM 900-PTCOM-READ-SEC
                        IF    RECE200-SRYYM  >=  "202008"
                          IF  PTCOM-INPUTCHI1  NOT =  SPACE
                            INITIALIZE              ORCSKANACHKAREA
                            MOVE    "2"             TO  KANACHK-SYORI 
                            STRING  PTCOM-INPUTCHI1 DELIMITED  BY  SPACE
                                    PTCOM-INPUTCHI2 DELIMITED  BY  SPACE
                                    PTCOM-INPUTCHI3 DELIMITED  BY  SPACE
                                    PTCOM-INPUTCHI4 DELIMITED  BY  SPACE
                                    INTO   KANACHK-MAE-INPUT
                            END-STRING
                            CALL    "ORCSKANACHK"   USING
                                                        ORCSKANACHKAREA
                            IF      KANACHK-RC  =  ZERO
                              EVALUATE  SRY-SRYCD(IDX12)
                                WHEN    "840000056"
                                WHEN    "840000556"
                                  IF  SRY-SRYCD(IDX12) = "840000056"
                                    MOVE "４"
                                       TO WRK-CYOJKSN-INPUTCOMENT(1:2)
                                  ELSE
                                    MOVE "５"
                                       TO WRK-CYOJKSN-INPUTCOMENT(1:2)
                                  END-IF
                                  MOVE KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                       TO WRK-CYOJKSN-INPUTCOMENT(3:)
                                  MOVE PTCOM-INPUTCOMENT(11:)
                                       TO WRK-CYOJKSN-NAME
                                WHEN    "850100020"
                                  MOVE KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                       TO WRK-CYOJKSN-INPUTCOMENT
                                  MOVE PTCOM-INPUTCOMENT(47:)
                                       TO WRK-CYOJKSN-NAME
                                WHEN    "850100021"
                                  MOVE KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                       TO WRK-CYOJKSN-INPUTCOMENT
                                  MOVE PTCOM-INPUTCOMENT(49:)
                                       TO WRK-CYOJKSN-NAME
                              END-EVALUATE
                            END-IF
                          ELSE
                            MOVE SPACE TO WRK-CYOJKSN-INPUTCOMENT
                            MOVE SPACE TO WRK-CYOJKSN-NAME
                          END-IF
                        ELSE
                            MOVE PTCOM-INPUTCOMENT
                                       TO WRK-CYOJKSN-INPUTCOMENT
                        END-IF
                      END-IF
                   END-IF
                END-PERFORM
                MOVE    "tbl_sryact"      TO  MCP-TABLE
                MOVE    "key2"            TO  MCP-PATHNAME
                PERFORM   900-SRYACT-READ-SEC
              END-PERFORM
           END-IF
           MOVE    "tbl_sryact"           TO  MCP-TABLE
           MOVE    "key2"                 TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       200111-CYOJKSN-KAISHIDAY3-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索４
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY4-SEC          SECTION.
      *
           INITIALIZE         WRK-CYOJKSN-KAISHIDAY-XXX-AREA
      *
           MOVE      ZERO                 TO  FLG-CHECK-MAE
      *
           PERFORM  VARYING  IDX30  FROM  1  BY  1
                     UNTIL   IDX30   >   TBL-CYOJKSN-CHECK-XXX-MAX
      *
             MOVE    ZERO                 TO  FLG-CYOJKSN-OK
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIYM
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIDD
             MOVE    SPACE                TO  WRK-CYOJKSN-INPUTCOMENT2
             MOVE    SPACE                TO  WRK-CYOJKSN-NAME2
      *
             INITIALIZE                       SRYACT-REC
             MOVE    RECE200-HOSPNUM      TO  SRY-HOSPNUM
             MOVE    RECE200-NYUGAIKBN    TO  SRY-NYUGAIKBN
             MOVE    RECE200-PTID         TO  SRY-PTID
             MOVE    RECE200-NYUINYMD(1:6)
                                          TO  SRY-SRYYM
             MOVE    TBL-CYOJKSN-CHECK-XXX(IDX30)
                                          TO  SRY-SRYCD (1)
                                              SRY-SRYCD (2)
                                              SRY-SRYCD (3)
                                              SRY-SRYCD (4)
                                              SRY-SRYCD (5)
             MOVE    SRYACT-REC           TO  MCPDATA-REC
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC               =   ZERO
               MOVE    "tbl_sryact"       TO  MCP-TABLE
               MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT      =   1
                         OR     FLG-CYOJKSN-OK  =   1
      *
                 PERFORM  200111-CYOJKSN-KAISHIDAY2-SEC
      *
                 MOVE    "tbl_sryact"     TO  MCP-TABLE
                 MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
             IF   WRK-CYOJKSN-TAIHIYM  NOT = SPACE
             AND  WRK-CYOJKSN-TAIHIDD  NOT = SPACE
               MOVE  WRK-CYOJKSN-TAIHIYM
                           TO WRK-CYOJKSN-KAISHIDAY-XXX(IDX30)(1:6)
               MOVE  WRK-CYOJKSN-TAIHIDD
                           TO WRK-CYOJKSN-KAISHIDAY-XXX(IDX30)(7:2)
               MOVE  WRK-CYOJKSN-INPUTCOMENT2
                           TO WRK-CYOJKSN-INPUTCOMENT-XXX(IDX30)
               MOVE  WRK-CYOJKSN-NAME2
                           TO WRK-CYOJKSN-NAME-XXX(IDX30)
             END-IF
      *
           END-PERFORM
      *
           .
       200111-CYOJKSN-KAISHIDAY4-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索５
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY5-SEC          SECTION.
      *
           INITIALIZE         WRK-CYOJKSN-KAISHIDAY-YYY-AREA
      *
           MOVE      ZERO                 TO  FLG-CHECK-MAE
      *
           PERFORM  VARYING  IDX30  FROM  1  BY  1
                     UNTIL   IDX30   >   TBL-CYOJKSN-CHECK-YYY-MAX
      *
             MOVE    ZERO                 TO  FLG-CYOJKSN-OK
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIYM
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIDD
             MOVE    SPACE                TO  WRK-CYOJKSN-INPUTCOMENT2
             MOVE    SPACE                TO  WRK-CYOJKSN-NAME2
      *
             INITIALIZE                       SRYACT-REC
             MOVE    RECE200-HOSPNUM      TO  SRY-HOSPNUM
             MOVE    RECE200-NYUGAIKBN    TO  SRY-NYUGAIKBN
             MOVE    RECE200-PTID         TO  SRY-PTID
             MOVE    RECE200-NYUINYMD(1:6)
                                          TO  SRY-SRYYM
             MOVE    TBL-CYOJKSN-CHECK-YYY(IDX30)
                                          TO  SRY-SRYCD (1)
                                              SRY-SRYCD (2)
                                              SRY-SRYCD (3)
                                              SRY-SRYCD (4)
                                              SRY-SRYCD (5)
             MOVE    SRYACT-REC           TO  MCPDATA-REC
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC               =   ZERO
               MOVE    "tbl_sryact"       TO  MCP-TABLE
               MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT      =   1
                         OR     FLG-CYOJKSN-OK  =   1
      *
                 PERFORM  200111-CYOJKSN-KAISHIDAY2-SEC
      *
                 MOVE    "tbl_sryact"     TO  MCP-TABLE
                 MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
             IF   WRK-CYOJKSN-TAIHIYM  NOT = SPACE
             AND  WRK-CYOJKSN-TAIHIDD  NOT = SPACE
               MOVE  WRK-CYOJKSN-TAIHIYM
                           TO WRK-CYOJKSN-KAISHIDAY-YYY(IDX30)(1:6)
               MOVE  WRK-CYOJKSN-TAIHIDD
                           TO WRK-CYOJKSN-KAISHIDAY-YYY(IDX30)(7:2)
               MOVE  WRK-CYOJKSN-INPUTCOMENT2
                           TO WRK-CYOJKSN-INPUTCOMENT-YYY(IDX30)
               MOVE  WRK-CYOJKSN-NAME2
                           TO WRK-CYOJKSN-NAME-YYY(IDX30)
             END-IF
      *
           END-PERFORM
      *
           .
       200111-CYOJKSN-KAISHIDAY5-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定日の確定
      *****************************************************************
       200111-SANTEI-DAY-SEC          SECTION.
      *
           INITIALIZE                TBL-SANTEI-DAY
      *
           MOVE    ZERO           TO  DAY-IDX
           PERFORM    VARYING    IDX  FROM   1   BY   1
                      UNTIL     (IDX      >   31)  OR
                                (DAY-IDX  >   31)
                IF    RECE220-KAISU(1 IDX)  NOT =  ZERO
                      ADD   1     TO  DAY-IDX
                      MOVE  IDX   TO  TB-SANTEI-DAY(DAY-IDX)
                END-IF
           END-PERFORM
      *
           .
       200111-SANTEI-DAY-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日等の日付の編集
      *****************************************************************
       20011-FREE-COMMENT2-SEC          SECTION.                         
      *
           ADD      1          TO    IDZ
      *
           EVALUATE   FLG-COMMENT
              WHEN    1
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "手術"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    2
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "実施"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    3
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "算定"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    4
                 IF   RECE200-SRYYM >= "201905"
                   MOVE     22         TO    WRK-KETA
                                             WRK-KETA-TAIHI
                   MOVE     11         TO    WRK-KETA2
                   MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                   MOVE    "交付　　　　　年　　月"
                                 TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
                   MOVE     11         TO     IDX41
                   MOVE     17         TO     IDX42
                   MOVE      7         TO     IDX49
                 ELSE
                   MOVE     18         TO    WRK-KETA
                                             WRK-KETA-TAIHI
                   MOVE     9          TO    WRK-KETA2
                   MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                   MOVE    "交付　　　年　　月"
                                 TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
                   MOVE      7         TO     IDX41
                   MOVE     13         TO     IDX42
                 END-IF
      *
                 INITIALIZE                      STS-AREA-DAY
                 INITIALIZE                      LNK-DAY2-AREA
                 MOVE    "21"                TO  LNK-DAY2-IRAI
                 MOVE    RECE200-SRYYM       TO  WRK-HENYMD(1:6)
                 MOVE    "01"                TO  WRK-HENYMD(7:2)
                 MOVE    WRK-HENYMD          TO  LNK-DAY2-YMD
                 CALL    "ORCSDAY"   USING   STS-AREA-DAY
                                             LNK-DAY2-AREA
                 IF  STS-DAY-RC1             =   ZERO
                   MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                   END-IF
      *
                   IF   RECE200-SRYYM >= "201905"
                      MOVE    LNK-DAY2-EDTYMD2-G
                                   TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                   END-IF
                 END-IF
              WHEN    6
                 MOVE     0          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     0          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
              WHEN    7
                 MOVE     8          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     4          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "検査実施"
                             TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    8
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "麻酔"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    10
                 MOVE     6          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     3          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "指導日"
                                 TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
           END-EVALUATE
      *
           MOVE      ZERO          TO  FLG-FIRST
      *
           PERFORM   VARYING   IDX    FROM   1   BY   1
                          UNTIL   (IDX                 >    31)
                           OR     (TB-SANTEI-DAY(IDX)  =  ZERO)
      *
                 IF  FLG-FIRST  =  ZERO
                    IF  TB-SANTEI-DAY(IDX)     <  10 
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                       MOVE    "　"
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                       MOVE    TBL-DAY(IDY)(3:2)     
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                       MOVE    "日"
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                    ELSE
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       IF   FLG-COMMENT   =   4 OR 6
                         ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                         COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                         MOVE    TBL-DAY(IDY)     
                             TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
                       ELSE
                         ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                         COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                         MOVE    "　"
                             TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                         ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                         COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                         MOVE    TBL-DAY(IDY)     
                             TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
                       END-IF
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                       MOVE    "日"
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                    END-IF
                    MOVE      1              TO  FLG-FIRST
                 ELSE
                    IF  TB-SANTEI-DAY(IDX)     <  10 
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    "、"
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       ELSE
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "、"
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                       END-IF
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  24 OR 25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    TBL-DAY(IDY)(3:2)     
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2) 
                       ELSE
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    TBL-DAY(IDY)(3:2)     
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2) 
                       END-IF
                    ELSE
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    "、"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       ELSE
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "、"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       END-IF
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  23 OR 24 OR 25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    TBL-DAY(IDY)     
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       ELSE
                          ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    TBL-DAY(IDY)     
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       END-IF
                    END-IF
                 END-IF
      *
           END-PERFORM
           .
       20011-FREE-COMMENT2-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日等の日付の編集（改行）
      *****************************************************************
       200111-FREE-COMMENT2-KAIGYO-SEC          SECTION.                  
      *
           ADD      1              TO  IDZ
      *
           MOVE    WRK-KETA-TAIHI  TO  WRK-KETA
           MOVE    WRK-KETA2       TO  WK-FREE-YUKOKETA2(IDZ)
           MOVE    ALL "　"        TO  WK-FREE-NAME2(IDZ)(1:WRK-KETA)
      *
           .
       200111-FREE-COMMENT2-KAIGYO-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリのコメント編集
      *****************************************************************
       2001-RIHA-COMMENT-SEC          SECTION.
      *
             PERFORM   200111-RECE230-TAIHI-SEC
      *
      *      ＲＥＣＥ０５ファイルの内容をテーブルに退避
             MOVE    ZERO                 TO  IDX-RECE230
             MOVE    SPACE                TO  WRK-RECE230XX-REC
             INITIALIZE                       WRK-RECE230XX-REC
      *      リハビリコメントの挿入
             COMPUTE  MAX-MEISAISU        =   RECE220-MEISAISU  +  1
      *
             MOVE    "810000001"
                            TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
             MOVE    ZERO   TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
             MOVE    7      TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE    "実施日数　　日"
                            TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
             MOVE    ZERO                 TO  CNT-RIHA
             PERFORM  VARYING   IDX  FROM  1  BY  1
                       UNTIL    IDX   >   31
                 IF   RECE220-KAISU(1 IDX)  NOT = ZERO
                        ADD      1        TO  CNT-RIHA
                 END-IF
             END-PERFORM
             IF      CNT-RIHA             NOT =    ZERO
               MOVE    CNT-RIHA             TO  DAY-IDX
               MOVE    TBL-DAY(DAY-IDX)
                           TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(9:4)
             END-IF
      *
             PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       2001-RIHA-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ医学管理料のコメント編集
      *****************************************************************
       2001-RIHAIGAKU-COMMENT-SEC          SECTION.
      *
           EVALUATE      RECE220-RIHABIRI-COMMENT
              WHEN           "2"
                  MOVE   CONS-SINDAI-IGAKU1   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-SINDAI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "3"
                  MOVE   CONS-SINDAI-IGAKU2   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-SINDAI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "4"
                  MOVE   CONS-KOKYUKI-IGAKU1  TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-KOKYUKI-DUMMY   TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "5"
                  MOVE   CONS-KOKYUKI-IGAKU2  TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-KOKYUKI-DUMMY   TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "6"
                  MOVE   CONS-NOUKE-IGAKU1    TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-NOUKE-DUMMY     TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "7"
                  MOVE   CONS-NOUKE-IGAKU2    TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-NOUKE-DUMMY     TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "8"
                  MOVE   CONS-UNDOKI-IGAKU1   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-UNDOKI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "9"
                  MOVE   CONS-UNDOKI-IGAKU2   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-UNDOKI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
           END-EVALUATE
      ***
           MOVE          SPACE          TO  WRK-RIHAIGAKU-FSANTEIYMD
      *    医学管理：算定履歴検索
           INITIALIZE                       SANTEI-REC
           MOVE    RECE200-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID         TO  SANTEI-PTID
           MOVE    RECE200-SRYYM        TO  SANTEI-SRYYM
           MOVE    WRK-RIHAIGAKU-SRYCD  TO  SANTEI-SRYCD
           MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                 TO  SANTEI-SRYKA
           MOVE    RECE200-HKNCOMBI     TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC           TO  MCPDATA-REC
           MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
           MOVE    "key"                TO  WRK-MCP-PATHNAME
           PERFORM  900-SANTEI-INV-SEC
           IF       FLG-SANTEI        =   ZERO
                MOVE  SANTEI-FSANTEIYMD TO  WRK-RIHAIGAKU-FSANTEIYMD
           END-IF
      ***
           INITIALIZE      WRK-RIHAIGAKU-SANTEI-AREA
      *    リハ実施ダミー：算定履歴検索
           INITIALIZE                       SANTEI-REC
           MOVE    RECE200-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE200-PTID         TO  SANTEI-PTID
           MOVE    RECE200-SRYYM        TO  SANTEI-SRYYM
           MOVE    WRK-RIHAIGAKU-SRYCD2 TO  SANTEI-SRYCD
           MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                 TO  SANTEI-SRYKA
           MOVE    RECE200-HKNCOMBI     TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC           TO  MCPDATA-REC
           MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
           MOVE    "key"                TO  WRK-MCP-PATHNAME
           PERFORM  900-SANTEI-INV-SEC
           IF       FLG-SANTEI        =   ZERO
               PERFORM  VARYING  IDX  FROM  1  BY  1
                         UNTIL   IDX    >  31
                 IF   SANTEI-DAY(IDX)   NOT =  ZERO
                    MOVE  "1"  TO  WRK-RIHAIGAKU-SANTEI-FLG
                    MOVE  SANTEI-DAY(IDX)
                               TO  WRK-RIHAIGAKU-SANTEI-DAY(IDX)
                 END-IF
               END-PERFORM
           END-IF
      *
      ***
      *
           PERFORM  200111-RECE230-TAIHI-SEC
      *
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           COMPUTE  MAX-MEISAISU        =   RECE220-MEISAISU  +  1
      *
           MOVE    "810000001"
                         TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
           MOVE    ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
           MOVE    9     TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
           MOVE    "開始　　　月　　日"
                         TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
           IF      WRK-RIHAIGAKU-FSANTEIYMD  NOT = SPACE
             MOVE    WRK-RIHAIGAKU-FSANTEIYMD(5:2)   TO  DAY-IDX2
             MOVE    TBL-DAY(DAY-IDX2)
                         TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(7:4)
             MOVE    WRK-RIHAIGAKU-FSANTEIYMD(7:2)   TO  DAY-IDX2
             MOVE    TBL-DAY(DAY-IDX2)
                         TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(13:4)
           END-IF
      *
           IF      WRK-RIHAIGAKU-SANTEI-FLG  NOT = SPACE
             PERFORM    20011-RIHAIGAKU-DUMMY-COM-SEC
           ELSE
             PERFORM    200111-SRYACTINF-HENSYU-SEC
           END-IF
      *
           .
       2001-RIHAIGAKU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ医学管理料のコメント編集（リハ実施日）
      *****************************************************************
       20011-RIHAIGAKU-DUMMY-COM-SEC          SECTION.
      *
           INITIALIZE             TBL-SANTEI-DAY
      *
           MOVE     ZERO      TO   DAY-IDX
           PERFORM  VARYING  IDX  FROM   1   BY   1
                     UNTIL   IDX    >   31
             IF  WRK-RIHAIGAKU-SANTEI-DAY(IDX)  NOT = ZERO
                 ADD    1     TO   DAY-IDX
                 MOVE   IDX   TO   TB-SANTEI-DAY(DAY-IDX)
             END-IF
           END-PERFORM
      *
           MOVE     ZERO      TO   IDZ
           INITIALIZE         WRK-FREE-AREA2
      *
           MOVE     2         TO   FLG-COMMENT
           PERFORM  20011-FREE-COMMENT2-SEC
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
                MOVE   "810000001"
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                MOVE   ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-RIHAIGAKU-DUMMY-COM-EXT.
           EXIT.
      *
      *****************************************************************
      *    （リハ選）のコメントがあるか判定
      *****************************************************************
       2001-RIHASEN-HANTEI-SEC          SECTION.
      *
           IF     RECE220-SAFLG   =    "2"
               MOVE       99      TO     FLG-COMMENT
               PERFORM    20011-KENSENTOU-COMMENT-SEC
           END-IF
      *
           .
       2001-RIHASEN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科ショート・ケア・精神科デイ・ケアがあるか判定
      *  ＃202004選択式コメント対応
      *  ＃202011選択式コメント対応
      *****************************************************************
       2001-SEIKEA-HANTEI-SEC          SECTION.
      *
           IF    ((RECE220-FLG-SEIKEA-COMMENT   =    "1") OR
                  (RECE220-FLG-SEIKEA2-COMMENT  =    "1"))
           AND   ( RECE220-FLG-SCPRO-COMMENT    =  SPACE )
             IF    RECE200-SRYYM  >=  "202011"
               MOVE      ZERO       TO     IDZ
               INITIALIZE                  WRK-FREE-AREA2
               IF   RECE220-FLG-SEIKEA2-COMMENT  =    "1"
                 PERFORM   2001-SEIKEA-HENSYU-SEC
               END-IF
               IF   RECE220-FLG-SEIKEA-COMMENT   =    "1"
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
                 OR  WK-FREE-NAME2(1)   NOT =  SPACE
                   MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 END-IF
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM   200111-SANTEI-DAY-SEC
                 PERFORM   20011-FREE-COMMENT2-SEC
               END-IF
               IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
               OR  WK-FREE-NAME2(1)   NOT =  SPACE
                 PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
               END-IF
             ELSE
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
             END-IF
           END-IF
      *
           .
       2001-SEIKEA-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科ショート・ケア・精神科デイ・ケア（初回年月日編集）
      *  ＃202011選択式コメント対応
      *****************************************************************
       2001-SEIKEA-HENSYU-SEC          SECTION.
      *
           MOVE  CONS-SEIKEA  TO  WRK-CHECK-SRYCD
           PERFORM       20011-ZAIKYO-CHECK-SEC
      *
           IF   WRK-ZAIKYO-YMD   NOT =  SPACE
              INITIALIZE                WRK-JIDO-SETCOM-AREA
              MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
      *
              MOVE       99      TO     FLG-COMMENT
      *
              MOVE     114       TO     IDX-JIDO
              PERFORM  200111-RECECOMMENT-IDXGET-SEC
              MOVE     WRK-ZAIKYO-YMD
                                 TO     WRK-RECECOM-YMD
              PERFORM  200111-RECECOMMENT-HENSYU-SEC
           END-IF
      *
           .
       2001-SEIKEA-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    疾患別等専門プログラム加算があるか判定
      *    経頭蓋磁気刺激療法があるか判定
      *    心不全に対する遠赤外線温熱療法があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SCPRO-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-SCPRO-COMMENT   NOT =  SPACE
             MOVE         ZERO     TO     IDZ
             INITIALIZE                   WRK-FREE-AREA2
      *      ＃202011選択式コメント対応
             IF     RECE200-SRYYM  <  "202004"
               IF   RECE220-FLG-SEIKEA-COMMENT  =  "1"
                 INITIALIZE                WRK-JIDO-SETCOM-AREA
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM   200111-SANTEI-DAY-SEC
                 PERFORM   20011-FREE-COMMENT2-SEC
               END-IF
             ELSE
               IF     RECE200-SRYYM  >= "202011"
                 IF   RECE220-FLG-SEIKEA2-COMMENT =  "1"
                   PERFORM   2001-SEIKEA-HENSYU-SEC
                 END-IF
               END-IF
             END-IF
      *
             EVALUATE  RECE220-FLG-SCPRO-COMMENT
               WHEN      "2"
                 MOVE  CONS-SCPRO  TO     WRK-CHECK-SRYCD
               WHEN      "4"
                 MOVE  CONS-JIKSGK TO     WRK-CHECK-SRYCD
               WHEN      "5"
                 MOVE  CONS-ONNETU TO     WRK-CHECK-SRYCD
             END-EVALUATE
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             IF   RECE220-FLG-SCPRO-COMMENT   =  "4"
             AND  WRK-ZAIKYO-YMD          NOT =  SPACE
               MOVE    CONS-JIKSGK-E TO  WRK-CHECK-SRYCD
               PERFORM     20011-ZAIKYO-CHECK2-SEC
             END-IF
      *
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE200-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                END-IF
      *
                MOVE       99      TO     FLG-COMMENT
      *
                IF   RECE200-SRYYM  >= "202008"
                  EVALUATE  RECE220-FLG-SCPRO-COMMENT
                    WHEN      "2"
                      MOVE   65            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    WHEN      "4"
                      MOVE   67            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    WHEN      "5"
                      MOVE   81            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  END-EVALUATE
                  IF  WRK-ZAIKYO-YMD2   NOT =  SPACE
                      MOVE   567           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD2
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  END-IF
                ELSE
                  ADD      1       TO     IDZ
                  MOVE     12      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE "治療開始日　　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
                  MOVE  WRK-ZAIKYO-YMD(5:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO     WK-FREE-NAME2(IDZ)(13:4)
                  MOVE  WRK-ZAIKYO-YMD(7:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO     WK-FREE-NAME2(IDZ)(19:4)
      *
                  IF   WRK-ZAIKYO-YMD2   NOT =  SPACE
                    ADD      1       TO     IDZ
                    MOVE     12      TO     WK-FREE-YUKOKETA2(IDZ)
                    MOVE "治療終了日　　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                    MOVE  WRK-ZAIKYO-YMD2(5:2)  TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(13:4)
                    MOVE  WRK-ZAIKYO-YMD2(7:2)  TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(19:4)
                  END-IF
                END-IF
             END-IF
      *
      *      ＃202011選択式コメント対応
             IF   RECE200-SRYYM  >= "202004"
               IF   RECE220-FLG-SEIKEA-COMMENT  =  "1"
                 INITIALIZE                WRK-JIDO-SETCOM-AREA
                 IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
                 OR  WK-FREE-NAME2(1)   NOT =  SPACE
                     MOVE  "2"      TO     WRK-JIDO-SETCOMFLG
                 END-IF
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM   200111-SANTEI-DAY-SEC
                 PERFORM   20011-FREE-COMMENT2-SEC
               END-IF
             END-IF
      *
             IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
             OR  WK-FREE-NAME2(1)   NOT =  SPACE
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-SCPRO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    外泊日のコメント編集
      *    精神科隔離病室管理加算（入院料加算）のコメント編集
      *****************************************************************
       2001-NYU-COMMENT-SEC          SECTION.
      *
           INITIALIZE  WRK-JIDO-SETCOM-AREA
      *
           PERFORM     20011-NYU-DAY-SEC
      *
           PERFORM     200111-RECE230-TAIHI-SEC
      *
           MOVE     ZERO    TO    FLG-NG
           IF   (RECE220-ZAISKBKBN =  "2"                          )
           AND  (FLG-RECE230       =  ZERO                         )
           AND  (WRK-RECE230-SRYCD(1) =  "190108890" OR "190142190"
                                      OR "190108790" OR "190142090"
                                      OR "190109090"
                                      OR "190142290" OR "190141590"
                                      OR "190153190" OR "190153390"
                                      OR "190153290" OR "190153090"
                                      OR "190182990"
                                      OR "190213790" OR "190214290"
                                      OR "190213890" OR "190214090"
                                      OR "190214390" OR "190213990"
                                      OR "190214190"
                                      OR "190200970" OR "190214470"
                                      OR "190205270" OR "190205370"
                                      OR "190205470" OR "190205870"
                                      OR "190212670" OR "190836370")
              MOVE    1     TO    FLG-NG
           END-IF
           IF   (RECE220-ZAISKBKBN  =  "2"                         )
           AND  (FLG-RECE230        =  ZERO                        )
           AND  (WRK-RECE230-SRYCD(2) =  "190107290" OR "190107390"
                                      OR "190107490" OR "190107590")
              MOVE  ZERO    TO    FLG-NG
           END-IF
           IF   (RECE220-ZAISKBKBN  =  "2"                         )
           AND  (FLG-RECE230        =  ZERO                        )
           AND  (WRK-RECE230-SRYCD(2) =  "190161470" OR "190161570"
                                      OR "190161870" OR "190162070"
                                      OR "190161670" OR "190161770"
                                      OR "190161970" OR "190162170"
                                      OR "190198570" OR "190198670")
              MOVE  ZERO    TO    FLG-NG
           END-IF
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           MOVE    RECE220-MEISAISU      TO  MAX-MEISAISU
      *
           IF    FLG-NG  =  ZERO
      *      算定日コメントの挿入
             PERFORM  VARYING      IDX    FROM  1   BY   1
                      UNTIL       (IDX    >     31)      OR
                                  (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
      ***      MOVE    TBL-NYU-DAY-CD(IDX)
               MOVE    "810000001"
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
               MOVE    ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
               IF    TBL-NYU-DAY-CD(IDX)  =  CONS-SANTEI-COMMENT1
                 MOVE    3   TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "　　日"
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 MOVE    TBL-NYU-DAY-ST(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(1:4)
               ELSE
                 MOVE    7   TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "　　日〜　　日"
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 MOVE    TBL-NYU-DAY-ST(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(1:4)
                 MOVE    TBL-NYU-DAY-ED(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(9:4)
               END-IF
             END-PERFORM
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       2001-NYU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    外泊日の確定
      *    精神科隔離病室管理加算日（入院料加算）の確定
      *****************************************************************
       20011-NYU-DAY-SEC          SECTION.
      *
           INITIALIZE                TBL-NYU-DAY
      *
           MOVE    ZERO          TO  DAY-IDX
           MOVE    ZERO          TO  FLG-NYU-RENZOKU
      *
           PERFORM    VARYING    IDX  FROM   1   BY   1
                      UNTIL     (IDX      >   31)  OR
                                (DAY-IDX  >   31)
                IF    RECE220-KAISU(1 IDX)   =  ZERO
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                ELSE
                  IF  (RECE220-ZAISKBKBN        =  "2")
                  AND (FLG-RYOCOM               =   1 )
                  AND (TBL-RYOCOM-NYUINKBN(IDX) =  "1")
                  AND (RECE200-SRYYM      >=  "201004")
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                  ELSE
                      IF    FLG-NYU-RENZOKU  =  ZERO
                         ADD   1     TO  DAY-IDX
                         MOVE  IDX   TO  TBL-NYU-DAY-ST(DAY-IDX)
                      END-IF
                      MOVE  IDX      TO  TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  1        TO  FLG-NYU-RENZOKU
                  END-IF
                END-IF
           END-PERFORM
      *
           PERFORM    VARYING    DAY-IDX  FROM   1   BY   1
                      UNTIL  (DAY-IDX                  >   31)  OR
                             (TBL-NYU-DAY-ST(DAY-IDX)  = ZERO)
                IF    TBL-NYU-DAY-ST(DAY-IDX) 
                                    =   TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  CONS-SANTEI-COMMENT1
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                ELSE
                      MOVE  CONS-SANTEI-COMMENT2
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                END-IF
           END-PERFORM
      *
           .
       20011-NYU-DAY-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日コメント編集
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-NYU-COMMENT2-SEC          SECTION.
      *
           INITIALIZE  WRK-JIDO-SETCOM-AREA
      *
           MOVE    SPACE                  TO  WRK-CYOJKSN-YMD
                                              WRK-CYOJKSN-INPUTCOMENT
                                              WRK-CYOJKSN-NAME
           EVALUATE  RECE220-FLG-CYOJKSN-COMMENT
             WHEN      "1"
             WHEN      "3"
               MOVE  WRK-CYOJKSN-YMD-XXX  TO  WRK-CYOJKSN-YMD
               MOVE  WRK-CYOJKSN-COM-XXX  TO  WRK-CYOJKSN-INPUTCOMENT
               MOVE  WRK-CYOJKSN-COM2-XXX TO  WRK-CYOJKSN-NAME
             WHEN      "2"
             WHEN      "4"
               MOVE  WRK-CYOJKSN-YMD-YYY  TO  WRK-CYOJKSN-YMD
               MOVE  WRK-CYOJKSN-COM-YYY  TO  WRK-CYOJKSN-INPUTCOMENT
               MOVE  WRK-CYOJKSN-COM2-YYY TO  WRK-CYOJKSN-NAME
           END-EVALUATE
      *
           PERFORM     200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           MOVE    RECE220-MEISAISU     TO  MAX-MEISAISU
      *
           IF      RECE200-SRYYM >= "202008"
             IF    WRK-CYOJKSN-YMD  NOT =  SPACE
               MOVE      ZERO           TO  IDZ
               INITIALIZE                   WRK-FREE-AREA2
               EVALUATE  RECE220-FLG-CYOJKSN-COMMENT
                 WHEN      "1"
                 WHEN      "3"
                   MOVE   84  TO  IDX-JIDO
                 WHEN      "2"
                 WHEN      "4"
                   MOVE   85  TO  IDX-JIDO
               END-EVALUATE
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-CYOJKSN-YMD  TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               MOVE     WK-FREE-SRYCD2(IDZ)
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
               MOVE     ZERO TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
               MOVE     WK-FREE-YUKOKETA2(IDZ)
                             TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
               MOVE     WK-FREE-NAME2(IDZ)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
               MOVE     WK-FREE-INPUTCOMENT2(IDZ)
                          TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
      *
               IF    WRK-CYOJKSN-INPUTCOMENT  NOT =  SPACE
                 MOVE  SPACE
                          TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 MOVE  SPACE
                          TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
                 MOVE  WK-FREE-SRYCD2(IDZ)
                                     TO  WRK-TENSU-SRYCD
                 MOVE  RECE200-SRYYM TO  WRK-TENSU-SRYYM
                 PERFORM 900-TENSU-TBL-SEC
                 STRING    TNS-NAME  DELIMITED   BY  SPACE
                           "；"      DELIMITED   BY  SIZE
                           WRK-CYOJKSN-NAME
                                     DELIMITED   BY  SPACE
                             INTO    WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 END-STRING
                 MOVE  WRK-CYOJKSN-INPUTCOMENT
                          TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
               END-IF
             END-IF
           ELSE
             IF    WRK-CYOJKSN-YMD  NOT =  SPACE
      *        算定日コメントの挿入
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               MOVE   "810000001"
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
               MOVE    ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
               IF   RECE200-SRYYM >= "201905"
                 MOVE  16    TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE  "算定開始　　　　　年　　月　　日"
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 MOVE  15    TO  IDX41
                 MOVE  21    TO  IDX42
                 MOVE  27    TO  IDX48
                 MOVE  11    TO  IDX49
               ELSE
                 MOVE  14    TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE  "算定開始　　　年　　月　　日"
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 MOVE  11    TO  IDX41
                 MOVE  17    TO  IDX42
                 MOVE  23    TO  IDX48
               END-IF
      *
               INITIALIZE                         STS-AREA-DAY
               INITIALIZE                         LNK-DAY2-AREA
               MOVE    "21"                   TO  LNK-DAY2-IRAI
               MOVE    WRK-CYOJKSN-YMD        TO  LNK-DAY2-YMD
               CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                              LNK-DAY2-AREA
               IF      STS-DAY-RC1            =   ZERO
                  MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                  INITIALIZE                       ORCSKANACHKAREA
                  MOVE    "2"                  TO  KANACHK-SYORI
                  MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                  CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                  IF      KANACHK-RC      =   ZERO
                     MOVE    KANACHK-OUT-INPUT(1:4)
                      TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(IDX41:4)
                  END-IF
      *
                  MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                  INITIALIZE                       ORCSKANACHKAREA
                  MOVE    "2"                  TO  KANACHK-SYORI
                  MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                  CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                  IF      KANACHK-RC      =   ZERO
                     MOVE    KANACHK-OUT-INPUT(1:4)
                      TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(IDX42:4)
                  END-IF
      *
                  MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
                  INITIALIZE                       ORCSKANACHKAREA
                  MOVE    "2"                  TO  KANACHK-SYORI
                  MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                  CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                  IF      KANACHK-RC      =   ZERO
                     MOVE    KANACHK-OUT-INPUT(1:4)
                      TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(IDX48:4)
                  END-IF
      *
                  IF   RECE200-SRYYM >= "201905"
                     MOVE    LNK-DAY2-EDTYMD2-G
                      TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)(IDX49:4)
                  END-IF
               END-IF
      *
               IF    WRK-CYOJKSN-INPUTCOMENT  NOT =  SPACE
                 MOVE  SPACE TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 IF    WRK-CYOJKSN-INPUTCOMENT(15:2) = "年"
                   MOVE  14  TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT(1:28)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 ELSE
                   MOVE  16  TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT(1:32)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                 END-IF
               END-IF
             END-IF
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       2001-NYU-COMMENT2-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科隔離病室管理加算（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-KAKURI-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-KAKURI-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF         
      *
           .
       2001-KAKURI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    栄養サポートチーム加算（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-EISAPO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-EISAPO-COMMENT    =    "1" OR "2"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-EISAPO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    呼吸ケアチーム加算（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-KOKKEA-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-KOKKEA-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-KOKKEA-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    重症者加算（精神療養病棟入院料）（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-JYUSYO-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-JYUSYO-COMMENT    =
                                         "1" OR "2" OR "3" OR "4"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-JYUSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科リエゾンチーム加算があるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-SEIRIE-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-SEIRIE-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-SEIRIE-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    病棟薬剤業務実施加算があるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-BYOYAK-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-BYOYAK-COMMENT    =    "1" OR "2" OR "3"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-BYOYAK-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    があるか判定（診療行為入力）
      *****************************************************************
       2001-CYOJKSN-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-CYOJKSN-COMMENT
                                      =    "1" OR "2" OR "3" OR "4"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT2-SEC
           END-IF
      *
           .
       2001-CYOJKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    排尿自立支援加算があるか判定（診療行為入力）
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-HAIJSK-HANTEI-SEC          SECTION.
      *
           IF     RECE220-FLG-HAIJSK-COMMENT   =    "1"
      *
             MOVE  SPACE              TO  WRK-HAIJSK-FSANTEIYM
             MOVE  ZERO               TO  WRK-HAIJSK-KAISU
      *
             INITIALIZE                   ORCSRECESRCHKAREA
             MOVE  "1"                TO  LNK-RECESRCHK-SYORI
             MOVE  RECE200-PTID       TO  LNK-RECESRCHK-PTID
             MOVE  RECE200-SRYYM      TO  LNK-RECESRCHK-SRYYM
             MOVE  RECE200-NYUGAIKBN  TO  LNK-RECESRCHK-NYUGAIKBN
             IF    RECE200-NYUINYMD   <   "20200401"
               MOVE  "20200401"       TO  LNK-RECESRCHK-SRYYMD(1)
             ELSE
               MOVE  RECE200-NYUINYMD TO  LNK-RECESRCHK-SRYYMD(1)
             END-IF
             IF    RECE200-HAIJSKYMD  <   LNK-RECESRCHK-SRYYMD(1)
               MOVE  RECE200-HAIJSKYMD  TO  LNK-RECESRCHK-SRYYMD(2)
             END-IF
             CALL  "ORCSRECESRCHK"   USING  SPA-AREA
                                            ORCSRECESRCHKAREA
             IF    LNK-RECESRCHK-RC  =  ZERO
                MOVE  LNK-RECESRCHK-FSANTEIYMD
                                           TO  WRK-HAIJSK-FSANTEIYM
                MOVE  LNK-RECESRCHK-KAISU  TO  WRK-HAIJSK-KAISU
             END-IF
      *
             IF   (WRK-HAIJSK-FSANTEIYM  NOT = SPACE)
             AND  (WRK-HAIJSK-KAISU      NOT = ZERO )
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                IF   RECE200-SRYYM  >= "202008"
                  MOVE   88          TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   WRK-HAIJSK-FSANTEIYM
                                     TO  WRK-RECECOM-YMD
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                  MOVE   588         TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   WRK-HAIJSK-KAISU
                                     TO  WRK-RECECOM-NUM
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
                ELSE
                  ADD        1       TO     IDZ
      *
                  MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE   "初回算定　　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE    WRK-HAIJSK-FSANTEIYM(5:2)  TO  DAY-IDX2
                  MOVE    TBL-DAY(DAY-IDX2)
                                     TO  WK-FREE-NAME2(IDZ)(11:4)
                  MOVE    WRK-HAIJSK-FSANTEIYM(7:2)  TO  DAY-IDX2
                  MOVE    TBL-DAY(DAY-IDX2)
                                     TO  WK-FREE-NAME2(IDZ)(17:4)
                  IF    WRK-HAIJSK-KAISU  <=  31
                    ADD      1       TO     IDZ
      *
                    MOVE     11      TO     WK-FREE-YUKOKETA2(IDZ)
                    MOVE   "通算実施回数（　　回）"
                                     TO     WK-FREE-NAME2(IDZ)
                    MOVE    WRK-HAIJSK-KAISU  TO  DAY-IDX2
                    MOVE    TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(15:4)
                  END-IF
                END-IF
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
      *
           END-IF
      *
           .
       2001-HAIJSK-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院料加算があるか判定（診療行為入力）
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-NYUKSN-HANTEI-SEC          SECTION.
      *
           IF      RECE220-FLG-NYUKSN-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-NYUKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト０４転送処理
      *****************************************************************
       2099-RECE220-TENSOU-SEC     SECTION.
      *
           MOVE       RECE220-REC   TO   RECE2209-REC
           WRITE      RECE2209-REC
           ADD        1             TO   CNT-RECE2209
           PERFORM    20991-RECE230-TENSOU-SEC
      *
           .
       2099-RECE220-TENSOU-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト０５転送処理
      *****************************************************************
       20991-RECE230-TENSOU-SEC     SECTION.
      *
           INITIALIZE                      RECE230-REC
           MOVE    RECE220-KEY1        TO  RECE230-KEY1
           MOVE    RECE220-ZAINUM      TO  RECE230-ZAINUM
           START   RECE230-FILE
               KEY IS    >=   RECE230-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE230
               NOT INVALID
                   PERFORM 990-RECE230-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE230           =   1              )
               OR     ( RECE220-KEY1      NOT =   RECE230-KEY1   )
               OR     ( RECE220-ZAINUM    NOT =   RECE230-ZAINUM )
      *
               MOVE    RECE230-REC       TO  RECE2309-REC
               WRITE   RECE2309-REC
               ADD     1                 TO  CNT-RECE2309
      *
               PERFORM 990-RECE230-NEXT-SEC
      *
           END-PERFORM
      *
           .
       20991-RECE230-TENSOU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　退避処理
      *****************************************************************
       200111-RECE230-TAIHI-SEC     SECTION.
      *
           INITIALIZE                      RECE230-REC
           MOVE    RECE220-KEY1        TO  RECE230-KEY1
           MOVE    RECE220-ZAINUM      TO  RECE230-ZAINUM
           START   RECE230-FILE
                 KEY IS    >=   RECE230-KEY
                 INVALID
                     MOVE    1           TO  FLG-RECE230
                 NOT INVALID
                     PERFORM 990-RECE230-NEXT-SEC
                     MOVE    RECE230-REC  TO  WRK-RECE230-REC
           END-START
      *
           .
       200111-RECE230-TAIHI-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       200111-SRYACTINF-HENSYU-SEC     SECTION.
      *
           PERFORM
               UNTIL  ( FLG-RECE230           =   1               )
               OR     ( RECE220-KEY1      NOT =   RECE230-KEY1    )
               OR     ( RECE220-ZAINUM    NOT =   RECE230-ZAINUM  )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   5     )
                         OR      ( RECE230-SRYCD(IDX) =   SPACE )
                    ADD    1             TO      IDX-RECE230
                    MOVE   RECE230-SRYACT-TBL(IDX)
                           TO   WRK-RECE230XX-SRYACT-TBL(IDX-RECE230 1)
                    IF  (RECE220-JIHOKBN  NOT =  SPACE)
                    AND (RECE220-ZAIKBN       =   4   )
                       MOVE  ZERO
                           TO   WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
                    END-IF
               END-PERFORM
      *
               PERFORM 990-RECE230-NEXT-SEC
      *
           END-PERFORM
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
                    INITIALIZE                        RECE2309-REC
                    MOVE    WRK-RECE230-KEY       TO  RECE2309-KEY
                    ADD     1                     TO  WRK-RENNUM
                    MOVE    WRK-RENNUM            TO  RECE2309-RENNUM
                    MOVE    WRK-RECE230-PTNUM     TO  RECE2309-PTNUM
                    MOVE    WRK-RECE230-SRYKA     TO  RECE2309-SRYKA
                    MOVE    WRK-RECE230-SRYKBN    TO  RECE2309-SRYKBN
                    MOVE    WRK-RECE230-SRYSYUKBN TO  RECE2309-SRYSYUKBN
                    MOVE    WRK-RECE230-JIHIMONEY TO  RECE2309-JIHIMONEY
                    PERFORM  VARYING   IDX   FROM   1   BY   1
                             UNTIL   (IDX       >    5)   OR
                                     (FLG-WRKRECE230   =   1)
                       ADD         1             TO    IDX-RECE230
                       IF (WRK-RECE230XX-SRYCD(IDX-RECE230 1) = SPACE)
                       OR (IDX-RECE230                        >  100 )
                           MOVE    1             TO    FLG-WRKRECE230
                       ELSE
                           MOVE  WRK-RECE230XX-SRYACT-TBL(IDX-RECE230 1)
                                            TO  RECE2309-SRYACT-TBL(IDX)
                           ADD   1          TO  WRK-CNT-MEISAI
                       END-IF
                    END-PERFORM
                    IF   RECE2309-SRYCD(1)  NOT =  SPACE
                       WRITE   RECE2309-REC
                       ADD     1            TO   CNT-RECE2309
                    END-IF
           END-PERFORM
      *
           MOVE    RECE220-REC       TO      RECE2209-REC
           MOVE    WRK-CNT-MEISAI    TO      RECE2209-MEISAISU
           EVALUATE  WRK-JIDO-SETCOMFLG
             WHEN      "2"
               MOVE      "1"         TO      RECE2209-SENTAKUCOMFLG
           END-EVALUATE
           IF  (RECE220-JIHOKBN  NOT =  SPACE)
           AND (RECE220-ZAIKBN       =   4   )
             MOVE  ZERO              TO      RECE2209-ZAITEN
             MOVE  ZERO              TO      RECE2209-SYUTEN1
             MOVE  ZERO              TO      RECE2209-SYUTEN2
             MOVE  ZERO              TO      RECE2209-YKZTEN
             MOVE  ZERO              TO      RECE2209-KIZAITEN
             MOVE  ZERO              TO      RECE2209-HOKATU-ZAITEN
             MOVE  ZERO              TO      RECE2209-HOKATU-SYUTEN1
             MOVE  ZERO              TO      RECE2209-HOKATU-SYUTEN2
             MOVE  ZERO              TO      RECE2209-HOKATU-YKZTEN
             MOVE  ZERO              TO      RECE2209-HOKATU-KIZAITEN
           END-IF
           WRITE   RECE2209-REC
           ADD     1                 TO      CNT-RECE2209
      *
           .
       200111-SRYACTINF-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　ＳＲＹＡＣＴＩＮＦ編集処理　まとめ
      *****************************************************************
       200111-SRYACTINF-HENSYU-MAT-SEC     SECTION.
      *
           PERFORM    200111-RECE230-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
      *
           MOVE    RECE220-MEISAISU      TO  MAX-MEISAISU
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                      UNTIL   (IDX                >   50   )
                        OR    (WK-FREE-NAME2(IDX) =   SPACE)
                COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
                IF  WK-FREE-SRYCD2(IDX) = SPACE
                  MOVE "810000001"
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                ELSE
                  MOVE WK-FREE-SRYCD2(IDX)
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                END-IF
                MOVE   ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
                MOVE   WK-FREE-INPUTCOMENT2(IDX)
                          TO  WRK-RECE230XX-INPUTCOMENT(MAX-MEISAISU 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       200111-SRYACTINF-HENSYU-MAT-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU-SEC     SECTION.
      *
           INITIALIZE                  ORCSRECECOMMENTAREA
           MOVE  WRK-RECECOM-AREA   TO ORCSRECECOMMENT-IN-AREA
           CALL  "ORCSRECECOMMENT"  USING  ORCSRECECOMMENTAREA
                                           SPA-AREA
           IF    LNK-RECECOMMENT-RC  =  ZERO
             ADD   1                         TO IDZ
             MOVE  LNK-RECECOMMENT-SRYCD     TO WK-FREE-SRYCD2(IDZ)
             MOVE  LNK-RECECOMMENT-NAME      TO WK-FREE-NAME2(IDZ)
             MOVE  LNK-RECECOMMENT-YUKOKETA  TO WK-FREE-YUKOKETA2(IDZ)
             MOVE  LNK-RECECOMMENT-INPUTCOMMENT
                                         TO  WK-FREE-INPUTCOMENT2(IDZ)
           END-IF
      *
           .
       200111-RECECOMMENT-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU2-SEC     SECTION.
      *
           INITIALIZE                  ORCSRECECOMMENTAREA
           MOVE  WRK-RECECOM-AREA   TO ORCSRECECOMMENT-IN-AREA
           CALL  "ORCSRECECOMMENT"  USING  ORCSRECECOMMENTAREA
                                           SPA-AREA
           IF    LNK-RECECOMMENT-RC  =  ZERO
             ADD   1         TO IDX-RECE230
             MOVE  LNK-RECECOMMENT-SRYCD
                             TO WRK-RECE230XX-SRYCD(IDX-RECE230 1)
             MOVE  ZERO      TO WRK-RECE230XX-SRYSURYO(IDX-RECE230 1)
             MOVE  LNK-RECECOMMENT-NAME
                             TO WRK-RECE230XX-NAME(IDX-RECE230 1)
             MOVE  LNK-RECECOMMENT-YUKOKETA
                             TO WRK-RECE230XX-YUKOKETA(IDX-RECE230 1)
             MOVE  LNK-RECECOMMENT-INPUTCOMMENT
                             TO WRK-RECE230XX-INPUTCOMENT(IDX-RECE230 1)
           END-IF
      *
           .
       200111-RECECOMMENT-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU3-SEC     SECTION.
      *
           ADD    1               TO IDZ
           MOVE  "840000099"      TO WK-FREE-SRYCD2(IDZ)
           MOVE  "検査日　　　日" TO WK-FREE-NAME2(IDZ)
           MOVE   7               TO WK-FREE-YUKOKETA2(IDZ)
      *
           INITIALIZE                         STS-AREA-DAY
           INITIALIZE                         LNK-DAY2-AREA
           MOVE    "21"                   TO  LNK-DAY2-IRAI
           MOVE    WRK-RECECOM-YMD        TO  LNK-DAY2-YMD
           CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                          LNK-DAY2-AREA
           IF      STS-DAY-RC1            =   ZERO
              MOVE    LNK-DAY2-EDTYMD1-D  TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                 TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                                  TO WK-FREE-NAME2(IDZ)(9:4)
                                     WK-FREE-INPUTCOMENT2(IDZ)(1:4)
              END-IF
              PERFORM  VARYING  IDX53  FROM  1  BY  2
                        UNTIL   IDX53    >   4
                 IF  WK-FREE-INPUTCOMENT2(IDZ)(IDX53:2) = "　"
                     MOVE  "０"   TO WK-FREE-INPUTCOMENT2(IDZ)(IDX53:2)
                 END-IF
              END-PERFORM
           END-IF
      *
           .
       200111-RECECOMMENT-HENSYU3-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU4-SEC     SECTION.
      *
      *    「引き続き入院」
           MOVE  "820100129"    TO  WRK-TENSU-SRYCD
           MOVE  RECE200-SRYYM  TO  WRK-TENSU-SRYYM
           PERFORM 900-TENSU-TBL-SEC
      *
           ADD    1             TO  IDZ
           MOVE  TNS-SRYCD      TO  WK-FREE-SRYCD2(IDZ)
           MOVE  TNS-NAME       TO  WK-FREE-NAME2(IDZ)
                                    WK-FREE-INPUTCOMENT2(IDZ)
           MOVE  TNS-YUKOKETA   TO  WK-FREE-YUKOKETA2(IDZ)
      *
           .
       200111-RECECOMMENT-HENSYU4-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-IDXGET-SEC     SECTION.
      *
           EVALUATE   IDX-JIDO
             WHEN        1
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100002"   TO   WRK-RCW-SRYCD
             WHEN        5
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100089"   TO   WRK-RCW-SRYCD
             WHEN        6
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100090"   TO   WRK-RCW-SRYCD
             WHEN       17
      *******WHEN       18
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850190043"   TO   WRK-RCW-SRYCD
             WHEN      517
      *******WHEN      518
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190043"   TO   WRK-RCW-SRYCD
             WHEN       20
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100054"   TO   WRK-RCW-SRYCD
             WHEN       25
                MOVE   "2"           TO   WRK-RCW-KBN
                MOVE   "850100140"   TO   WRK-RCW-SRYCD
             WHEN       27
                MOVE   "2"           TO   WRK-RCW-KBN
                MOVE   "850100145"   TO   WRK-RCW-SRYCD
             WHEN       29
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100060"   TO   WRK-RCW-SRYCD
             WHEN       30
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100061"   TO   WRK-RCW-SRYCD
             WHEN       34
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100137"   TO   WRK-RCW-SRYCD
             WHEN       38
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850190006"   TO   WRK-RCW-SRYCD
             WHEN      538
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190006"   TO   WRK-RCW-SRYCD
             WHEN       39
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100129"   TO   WRK-RCW-SRYCD
             WHEN      539
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100043"   TO   WRK-RCW-SRYCD
             WHEN       57
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100142"   TO   WRK-RCW-SRYCD
             WHEN       60
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100286"   TO   WRK-RCW-SRYCD
             WHEN      560
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100061"   TO   WRK-RCW-SRYCD
             WHEN       61
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100272"   TO   WRK-RCW-SRYCD
             WHEN      561
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100056"   TO   WRK-RCW-SRYCD
             WHEN     1061
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100273"   TO   WRK-RCW-SRYCD
             WHEN       62
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100272"   TO   WRK-RCW-SRYCD
             WHEN      562
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100056"   TO   WRK-RCW-SRYCD
             WHEN       65
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100249"   TO   WRK-RCW-SRYCD
             WHEN       67
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100235"   TO   WRK-RCW-SRYCD
             WHEN      567
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100236"   TO   WRK-RCW-SRYCD
             WHEN       68
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100209"   TO   WRK-RCW-SRYCD
             WHEN      568
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100208"   TO   WRK-RCW-SRYCD
             WHEN       69
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100227"   TO   WRK-RCW-SRYCD
             WHEN      569
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100220"   TO   WRK-RCW-SRYCD
             WHEN       70
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100218"   TO   WRK-RCW-SRYCD
             WHEN      570
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100211"   TO   WRK-RCW-SRYCD
             WHEN     1070
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100389"   TO   WRK-RCW-SRYCD
             WHEN     1570
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100390"   TO   WRK-RCW-SRYCD
             WHEN     2070
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100439"   TO   WRK-RCW-SRYCD
             WHEN       71
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100224"   TO   WRK-RCW-SRYCD
             WHEN      571
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100217"   TO   WRK-RCW-SRYCD
             WHEN     1071
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100391"   TO   WRK-RCW-SRYCD
             WHEN     1571
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100392"   TO   WRK-RCW-SRYCD
             WHEN     2071
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100440"   TO   WRK-RCW-SRYCD
             WHEN       72
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100230"   TO   WRK-RCW-SRYCD
             WHEN      572
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100224"   TO   WRK-RCW-SRYCD
             WHEN       73
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100221"   TO   WRK-RCW-SRYCD
             WHEN      573
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100214"   TO   WRK-RCW-SRYCD
             WHEN       74
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100215"   TO   WRK-RCW-SRYCD
             WHEN      574
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100216"   TO   WRK-RCW-SRYCD
             WHEN     1074
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100217"   TO   WRK-RCW-SRYCD
             WHEN     1574
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100799"   TO   WRK-RCW-SRYCD
             WHEN       75
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100212"   TO   WRK-RCW-SRYCD
             WHEN      575
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100213"   TO   WRK-RCW-SRYCD
             WHEN     1075
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100214"   TO   WRK-RCW-SRYCD
             WHEN     1575
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100531"   TO   WRK-RCW-SRYCD
             WHEN       77
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100084"   TO   WRK-RCW-SRYCD
             WHEN       78
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100073"   TO   WRK-RCW-SRYCD
             WHEN       79
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100071"   TO   WRK-RCW-SRYCD
             WHEN       80
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100269"   TO   WRK-RCW-SRYCD
             WHEN       81
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100282"   TO   WRK-RCW-SRYCD
             WHEN       84
      *******WHEN       86
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100020"   TO   WRK-RCW-SRYCD
             WHEN       85
      *******WHEN       87
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100021"   TO   WRK-RCW-SRYCD
             WHEN       88
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100027"   TO   WRK-RCW-SRYCD
             WHEN      588
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100022"   TO   WRK-RCW-SRYCD
             WHEN      114
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100246"   TO   WRK-RCW-SRYCD
             WHEN      115
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100143"   TO   WRK-RCW-SRYCD
             WHEN      116
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100143"   TO   WRK-RCW-SRYCD
             WHEN      137
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100418"   TO   WRK-RCW-SRYCD
             WHEN      637
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190052"   TO   WRK-RCW-SRYCD
             WHEN      138
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100490"   TO   WRK-RCW-SRYCD
             WHEN      139
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190053"   TO   WRK-RCW-SRYCD
             WHEN      140
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100419"   TO   WRK-RCW-SRYCD
             WHEN      142
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100442"   TO   WRK-RCW-SRYCD
      *
             WHEN     OTHER
                MOVE   SPACE         TO   WRK-RCW-KBN
                MOVE   SPACE         TO   WRK-RCW-SRYCD
           END-EVALUATE
           MOVE        RECE200-SRYYM TO   WRK-RCW-SRYYMD(1:6)
           MOVE        "01"          TO   WRK-RCW-SRYYMD(7:2)
      *
           INITIALIZE                     WRK-RECECOM-AREA
           MOVE   WRK-RCW-KBN        TO   WRK-RECECOM-KBN
           MOVE   WRK-RCW-SRYCD      TO   WRK-RECECOM-SRYCD
           MOVE   WRK-RCW-SRYYMD     TO   WRK-RECECOM-SRYYMD
      *
           .
       200111-RECECOMMENT-IDXGET-EXT.
           EXIT.
      *
      *****************************************************************
      *    差込編集２
      *****************************************************************
       250-SASHIKOMI2-SEC     SECTION.
      *
      *    パラメータ６４９ファイルより編集
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
           MOVE    ZERO                TO  RECE2209-ZAINUM
      *
           START   RECE2209-FILE
               KEY IS    >=   RECE2209-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE2209
               NOT INVALID
                   PERFORM 990-RECE2209-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE2209          =   1             )
               OR     ( RECE200-KEY       NOT =   RECE2209-KEY1 )
      *
               EVALUATE  RECE2209-SRYKBN
                 WHEN      "90"
                 WHEN      "92"
                    IF    FLG-RYOCOM  =  ZERO
                       PERFORM       2599-RECE2209-TENSOU-SEC
                    ELSE
                       EVALUATE  RECE2209-ZAISKBKBN
                         WHEN     "1"
                         WHEN     "2"
                           PERFORM   2502-RYOCOM-HANTEI-SEC
                         WHEN   OTHER
                           PERFORM   2599-RECE2209-TENSOU-SEC
                       END-EVALUATE
                    END-IF
                 WHEN      OTHER
                    MOVE   ZERO   TO  FLG-COMMENT
      *             （酸素計算式のコメントのセット）
                    IF   FLG-COMMENT  =  ZERO
                        PERFORM   2501-SANSO-HANTEI-SEC
                    END-IF
                    IF   FLG-COMMENT  =  ZERO
                        PERFORM   2599-RECE2209-TENSOU-SEC
                    END-IF
               END-EVALUATE
      *
               PERFORM 990-RECE2209-NEXT-SEC
      *
           END-PERFORM
      *
           .
       250-SASHIKOMI2-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素があるか判定
      *****************************************************************
       2501-SANSO-HANTEI-SEC          SECTION.
      *
           IF     RECE2209-FLG-SANSO-COMMENT   =    "1"
               MOVE       99      TO     FLG-COMMENT
      *
               PERFORM    25011-SANSO-TAIHI-SEC
      *
               PERFORM    25011-SANSO-COMMENT-SEC
      *
           END-IF
      *
           .
       2501-SANSO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素の数量・単価退避
      *****************************************************************
       25011-SANSO-TAIHI-SEC          SECTION.
      *
           MOVE       ZERO    TO     IDX4
           INITIALIZE                TBL-SANSO-INF
      *
           INITIALIZE                       RECE2309-REC
           MOVE    RECE2209-KEY1        TO  RECE2309-KEY1
           MOVE    RECE2209-ZAINUM      TO  RECE2309-ZAINUM
           START   RECE2309-FILE
               KEY IS    >=   RECE2309-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE2309
               NOT INVALID
                   PERFORM 990-RECE2309-NEXT-SEC
           END-START
           PERFORM
               UNTIL ( FLG-RECE2309           =  1               )
               OR    ( RECE2209-KEY1      NOT =  RECE2309-KEY1   )
               OR    ( RECE2209-ZAINUM    NOT =  RECE2309-ZAINUM )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                          UNTIL  ( IDX                 >   5     )
                           OR    ( RECE2309-SRYCD(IDX) =   SPACE )
      *
                  SET     TBL-SANSO    TO     1
                  SEARCH      TBL-SANSO-OCC   VARYING   TBL-SANSO
                       AT  END
                           MOVE    ZERO    TO   FLG-SANSO-OK
                       WHEN   RECE2309-SRYCD(IDX) = TBL-SANSO-SRYCD
                                                       (TBL-SANSO)
                           MOVE    1       TO   FLG-SANSO-OK
                  END-SEARCH
                  IF      FLG-SANSO-OK        =    1
                     ADD      1              TO  IDX4
                     MOVE  RECE2309-TEN(IDX) TO  TBL-SANSO-TEN(IDX4)
                     MOVE  RECE2309-SRYSURYO(IDX)
                                             TO  TBL-SANSO-SRYSURYO
                                                              (IDX4)
                  END-IF
                  IF    RECE2309-SRYCD(IDX) = "770030070"
                     IF   TBL-KASAN-SRYSURYO  =  ZERO
                        MOVE   RECE2309-SRYSURYO(IDX)
                                     TO  TBL-KASAN-SRYSURYO
                     ELSE
                        COMPUTE   TBL-KASAN-SRYSURYO  =  
                                  TBL-KASAN-SRYSURYO  *  
                                  RECE2309-SRYSURYO(IDX)   
                     END-IF
                  END-IF
      *
               END-PERFORM 
      *
               PERFORM 990-RECE2309-NEXT-SEC
      *
           END-PERFORM
      *
           .
       25011-SANSO-TAIHI-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素のコメント編集（差込：下）
      *****************************************************************
       25011-SANSO-COMMENT-SEC          SECTION.
      *
           MOVE       ZERO       TO   IDZ                               
           INITIALIZE            WRK-FREE-AREA2                         
           INITIALIZE            WRK-FREE-AREA3
      *
           PERFORM  250111-SANSO-FREE-COMMENT-SEC
      *
           PERFORM  250111-RECE2309-TAIHI-SEC
      *
      *    ＲＥＣＥ６５９ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX-REC
           INITIALIZE                       WRK-RECE230XX-REC
           MOVE    ZERO                 TO  WRK-JYUNBAN
                                            WRK-GYOSUU
                                            WRK-GYOSUU2
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
      *
                ADD       1      TO     WRK-GYOSUU
      *
           END-PERFORM 
      *
           PERFORM    250111-SRYACTINF2-HENSYU-SEC
      *
           .
       25011-SANSO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素計算式編集
      *****************************************************************
       250111-SANSO-FREE-COMMENT-SEC          SECTION.
      *
           MOVE     1          TO    WRK-KETA
           MOVE    ZERO        TO    WRK-KEISAN4
      *
           PERFORM   VARYING   IDX    FROM   1   BY   1
                      UNTIL   (IDX                 >    10)
                       OR     (TBL-SANSO-TEN(IDX)  =  ZERO)
      *
             IF   IDX  >  1
                MOVE    "＋"   TO  WK-FREE-NAME3(WRK-KETA:2)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  2
             END-IF
      *
             MOVE    "（"   TO  WK-FREE-NAME3(WRK-KETA:2)
             COMPUTE  WRK-KETA   =  WRK-KETA   +  2
      *単価
             MOVE     TBL-SANSO-TEN(IDX)   TO   WRK-KEISAN
             COMPUTE  WRK-KEISAN2  = (TBL-SANSO-TEN(IDX) -  WRK-KEISAN)
                                   *   1000
      *
             PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
             MOVE    "円×" TO  WK-FREE-NAME3(WRK-KETA:4)
             COMPUTE  WRK-KETA   =  WRK-KETA   +  4
      *数量
             MOVE     TBL-SANSO-SRYSURYO(IDX)  TO  WRK-KEISAN
             COMPUTE  WRK-KEISAN2  
                             = (TBL-SANSO-SRYSURYO(IDX) -  WRK-KEISAN)
                             *   1000
      *
             PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
             IF    TBL-KASAN-SRYSURYO  =  ZERO
                MOVE    "Ｌ×１．３）" TO  WK-FREE-NAME3(WRK-KETA:12)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  12
      *
      ***       COMPUTE  WRK-KEISAN3   =   WRK-KEISAN3  +
      ***         (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3)
                COMPUTE  WRK-KEISAN3   =
                  (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3)
                                                                + 0.5
                COMPUTE  WRK-KEISAN4  = WRK-KEISAN4 + WRK-KEISAN3
             ELSE
                MOVE    "Ｌ×１．３×" TO  WK-FREE-NAME3(WRK-KETA:12)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  12
      *
                MOVE     TBL-KASAN-SRYSURYO  TO  WRK-KEISAN
                COMPUTE  WRK-KEISAN2  
                             = (TBL-KASAN-SRYSURYO -  WRK-KEISAN)
                             *   1000
      *
                PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
                MOVE    "）" TO  WK-FREE-NAME3(WRK-KETA:2)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  2
      *
      ***       COMPUTE  WRK-KEISAN3   =   WRK-KEISAN3  +
      ***         (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3
      ***                             * TBL-KASAN-SRYSURYO)
                COMPUTE  WRK-KEISAN3   =
                  (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3
                                      * TBL-KASAN-SRYSURYO)     + 0.5
                COMPUTE  WRK-KEISAN4  = WRK-KEISAN4 + WRK-KEISAN3
             END-IF
      *
           END-PERFORM
      *
           IF   IDX  =  2
              MOVE    "÷１０＝"  TO  WK-FREE-NAME3(WRK-KETA:8)
              COMPUTE  WRK-KETA   =  WRK-KETA   +  8
      *
      ***     COMPUTE  WRK-KEISAN =   WRK-KEISAN3  +  0.5
      ***     COMPUTE  WRK-KEISAN =  (WRK-KEISAN   /  10)  +  0.5
              COMPUTE  WRK-KEISAN =  (WRK-KEISAN4  /  10)  +  0.5
              MOVE     ZERO       TO   WRK-KEISAN2
      *
              PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
              MOVE    "点"   TO  WK-FREE-NAME3(WRK-KETA:2)
              COMPUTE  WRK-KETA   =  WRK-KETA   +  2
           ELSE
              IF   IDX  >  2
                  MOVE   WK-FREE-NAME3  TO  WK-FREE-NAME3-TAIHI
                  MOVE    "（"    TO   WK-FREE-NAME3(1:2)
                  MOVE   WK-FREE-NAME3-TAIHI
                                  TO   WK-FREE-NAME3(3:)
                  COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                  MOVE    "）÷１０＝"  TO  WK-FREE-NAME3(WRK-KETA:10)
                  COMPUTE  WRK-KETA   =  WRK-KETA   +  10
      *
      ***         COMPUTE  WRK-KEISAN =   WRK-KEISAN3  +  0.5
      ***         COMPUTE  WRK-KEISAN =  (WRK-KEISAN   /  10)  +  0.5
                  COMPUTE  WRK-KEISAN =  (WRK-KEISAN4  /  10)  +  0.5
                  MOVE     ZERO       TO   WRK-KEISAN2
      *
                  PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
                  MOVE    "点"   TO  WK-FREE-NAME3(WRK-KETA:2)
                  COMPUTE  WRK-KETA   =  WRK-KETA   +  2
              END-IF
           END-IF
      *
           IF     WRK-KETA    >   1
               PERFORM   VARYING   IDX4    FROM   1   BY   50
                          UNTIL   (IDX4     >    1000)
                            OR    (WK-FREE-NAME3(IDX4:1) = SPACE)
                   ADD     1      TO    IDZ
                   MOVE    ZERO   TO    WRK-KETA2
                   PERFORM   VARYING   IDX5    FROM   1   BY   2
                              UNTIL   (IDX5     >    50)
                      IF   WK-FREE-NAME3(IDX5:2)    = SPACE
                          MOVE   IDX5   TO   WRK-KETA2
                          MOVE   50     TO   IDX5
                      END-IF
                   END-PERFORM
                   IF   WRK-KETA2 =  ZERO
                        MOVE   25   TO  WK-FREE-YUKOKETA2(IDZ)
                   ELSE
                        COMPUTE   WK-FREE-YUKOKETA2(IDZ)  =
                                       ( WRK-KETA2 - 1 )  /  2
                   END-IF
                   MOVE   WK-FREE-NAME3(IDX4:50)
                                   TO    WK-FREE-NAME2(IDZ)
               END-PERFORM
           END-IF
      *
           .
       250111-SANSO-FREE-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素計算式・数値編集
      *****************************************************************
       2501111-SANSO-FREE-COM-NUM-SEC          SECTION.          
      *
           IF    WRK-KEISAN  NOT  =  ZERO
               PERFORM   VARYING   IDX4    FROM   1   BY   1
                          UNTIL   (IDX4               >    9)
                     IF   WRK-KEISAN(IDX4:1) =   "0"
                        CONTINUE
                     ELSE
                        MOVE  IDX4   TO  IDX5
                        MOVE   9     TO  IDX4
                     END-IF
               END-PERFORM
               MOVE  SPACE             TO  WRK-KEISAN-TAIHI
               MOVE  WRK-KEISAN(IDX5:) TO  WRK-KEISAN-TAIHI
               INITIALIZE                  ORCSKANACHKAREA
               MOVE    "2"             TO  KANACHK-SYORI
               MOVE  WRK-KEISAN-TAIHI  TO  KANACHK-MAE-INPUT
               CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
               IF      KANACHK-RC      =   ZERO
                   MOVE    KANACHK-OUT-INPUT(1:KANACHK-MAX)
                               TO  WK-FREE-NAME3(WRK-KETA:KANACHK-MAX)
                   COMPUTE  WRK-KETA   =  WRK-KETA   +  KANACHK-MAX
               END-IF
           END-IF
      *
           IF    WRK-KEISAN2  NOT  =  ZERO
                PERFORM   VARYING   IDX4    FROM   3   BY  -1
                           UNTIL   (IDX4               <    1)
                      IF   WRK-KEISAN2(IDX4:1) =   "0"
                         CONTINUE
                      ELSE
                         MOVE  IDX4   TO  IDX5
                         MOVE   1     TO  IDX4
                      END-IF
                END-PERFORM
                MOVE  SPACE               TO  WRK-KEISAN-TAIHI
                MOVE  WRK-KEISAN2(1:IDX5) TO  WRK-KEISAN-TAIHI
      *
                IF    WRK-KEISAN  NOT  =  ZERO
                   MOVE    "．"     TO  WK-FREE-NAME3(WRK-KETA:2)
                   COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                ELSE
                   MOVE    "０．"   TO  WK-FREE-NAME3(WRK-KETA:4)
                   COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                END-IF
      *
                INITIALIZE                  ORCSKANACHKAREA
                MOVE    "2"             TO  KANACHK-SYORI
                MOVE  WRK-KEISAN-TAIHI  TO  KANACHK-MAE-INPUT
                CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                IF      KANACHK-RC      =   ZERO
                    MOVE    KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                TO  WK-FREE-NAME3(WRK-KETA:KANACHK-MAX)
                    COMPUTE  WRK-KETA   =  WRK-KETA   +  KANACHK-MAX
                END-IF
           END-IF
      *
           IF    WRK-KEISAN    =  ZERO
           AND   WRK-KEISAN2   =  ZERO
               MOVE    "０"   TO  WK-FREE-NAME3(WRK-KETA:2)
               COMPUTE  WRK-KETA   =  WRK-KETA   +  2
           END-IF
      *
           .
       2501111-SANSO-FREE-COM-NUM-EXT.
           EXIT.
      *
      *****************************************************************
      *    ６５９　退避処理
      *****************************************************************
       250111-RECE2309-TAIHI-SEC     SECTION.
      *
           INITIALIZE                       RECE2309-REC
           MOVE    RECE2209-KEY1        TO  RECE2309-KEY1
           MOVE    RECE2209-ZAINUM      TO  RECE2309-ZAINUM
           START   RECE2309-FILE
                 KEY IS    >=   RECE2309-KEY
                 INVALID
                     MOVE    1          TO  FLG-RECE2309
                 NOT INVALID
                     PERFORM 990-RECE2309-NEXT-SEC
                     MOVE  RECE2309-REC TO  WRK-RECE230-REC
           END-START
      *
           .
       250111-RECE2309-TAIHI-EXT.
           EXIT.
      *
      *****************************************************************
      *    ６５９　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       250111-SRYACTINF2-HENSYU-SEC     SECTION.
      *
           PERFORM
               UNTIL  ( FLG-RECE2309           =   1               )
               OR     ( RECE2209-KEY1      NOT =   RECE2309-KEY1   )
               OR     ( RECE2209-ZAINUM    NOT =   RECE2309-ZAINUM )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                 >   5     )
                         OR      ( RECE2309-SRYCD(IDX) =   SPACE )
                    ADD    1             TO      IDX-RECE230
                    MOVE   RECE2309-SRYACT-TBL(IDX)
                             TO  WRK-RECE230XX-SRYACT-TBL(IDX-RECE230 1)
      *
                    IF   RECE2309-SRYCD(IDX) = "770020070" OR
                                               "770030070"
                         MOVE   IDX-RECE230   TO   WRK-JYUNBAN
                    END-IF
      *
               END-PERFORM
      *
               PERFORM 990-RECE2309-NEXT-SEC
      *
           END-PERFORM
      *
           IF     WRK-GYOSUU   NOT =  ZERO
      *
      *      補正率又は高気圧酸素加算以降の明細をずらす
             IF   WRK-JYUNBAN  NOT =  ZERO
      *
               PERFORM   VARYING   IDX   FROM   IDX-RECE230   BY  -1
                          UNTIL  ( IDX    <    1           )
                           OR    ( IDX    <=   WRK-JYUNBAN )
      *
                   COMPUTE   WRK-GYOSUU2  =  IDX  +  WRK-GYOSUU
                   MOVE   WRK-RECE230XX-SRYACT-TBL(IDX 1)  TO
                          WRK-RECE230XX-SRYACT-TBL(WRK-GYOSUU2 1)
                   INITIALIZE   WRK-RECE230XX-SRYACT-TBL(IDX 1)
      *
               END-PERFORM
      *
             END-IF
      *
      *      計算式の差し込み
             IF   WRK-JYUNBAN  NOT =  ZERO
                 MOVE      WRK-JYUNBAN    TO     MAX-MEISAISU
             ELSE
                 MOVE      IDX-RECE230    TO     MAX-MEISAISU
             END-IF
             PERFORM   VARYING   IDX   FROM    1   BY  1
                        UNTIL  ( IDX                >   50    )
                         OR    ( WK-FREE-NAME2(IDX) =   SPACE )
      *
                ADD    1     TO  MAX-MEISAISU
                MOVE   "810000001"
                             TO  WRK-RECE230XX-SRYCD(MAX-MEISAISU 1)
                MOVE   ZERO  TO  WRK-RECE230XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE230XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE230XX-NAME(MAX-MEISAISU 1)
      *
             END-PERFORM
      *
           END-IF
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
                    INITIALIZE                        RECE2301-REC
                    MOVE    WRK-RECE230-KEY       TO  RECE2301-KEY
                    ADD     1                     TO  WRK-RENNUM
                    MOVE    WRK-RENNUM            TO  RECE2301-RENNUM
                    MOVE    WRK-RECE230-PTNUM     TO  RECE2301-PTNUM
                    MOVE    WRK-RECE230-SRYKA     TO  RECE2301-SRYKA
                    MOVE    WRK-RECE230-SRYKBN    TO  RECE2301-SRYKBN
                    MOVE    WRK-RECE230-SRYSYUKBN TO  RECE2301-SRYSYUKBN
                    MOVE    WRK-RECE230-JIHIMONEY TO  RECE2301-JIHIMONEY
                    PERFORM  VARYING   IDX   FROM   1   BY   1
                             UNTIL   (IDX       >    5)   OR
                                     (FLG-WRKRECE230   =   1)
                       ADD         1             TO    IDX-RECE230
                       IF (WRK-RECE230XX-SRYCD(IDX-RECE230 1) = SPACE)
                       OR (IDX-RECE230                        >  100 )
                           MOVE    1             TO    FLG-WRKRECE230
                       ELSE
                           MOVE  WRK-RECE230XX-SRYACT-TBL(IDX-RECE230 1)
                                            TO  RECE2301-SRYACT-TBL(IDX)
                           ADD   1          TO  WRK-CNT-MEISAI
                       END-IF
                    END-PERFORM
                    IF   RECE2301-SRYCD(1)  NOT =  SPACE
                       WRITE   RECE2301-REC
                       ADD     1            TO   CNT-RECE230
                    END-IF
           END-PERFORM
      *
           MOVE    RECE2209-REC      TO      RECE2201-REC
           MOVE    WRK-CNT-MEISAI    TO      RECE2201-MEISAISU
           WRITE   RECE2201-REC
           ADD     1                 TO      CNT-RECE220
      *
           .
       250111-SRYACTINF2-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメントがあるか判定
      *****************************************************************
       2502-RYOCOM-HANTEI-SEC          SECTION.
      *
           MOVE     ZERO     TO     FLG-RYOCOM2
           INITIALIZE               TBL-RYOCOM2-INF
      *
           PERFORM  VARYING  RYO-IDX  FROM  1  BY  1
                     UNTIL   RYO-IDX   >   31
      *
               IF    (RECE2209-KAISU(1 RYO-IDX)   NOT =  ZERO)
               AND   (TBL-RYOCOM-NYUINKBN(RYO-IDX)    =  "1" )
      *
                  MOVE     ZERO     TO    FLG-ARI
                  PERFORM  VARYING  RYO-IDX3  FROM  1  BY  1
                            UNTIL  (RYO-IDX3   >   31)
                             OR    (TBL-RYOCOM2-MEISAISU(RYO-IDX3)
                                               = ZERO)
                             OR    (FLG-ARI    =    1)
                   IF   RECE200-SRYYM  >=  "201004"
                     IF  (TBL-RYOCOM2-MEISAISU  (RYO-IDX3) =
                                    TBL-RYOCOM-MEISAISU  (RYO-IDX))
                     AND (TBL-RYOCOM2-SRYCDTOTAL(RYO-IDX3) =
                                    TBL-RYOCOM-SRYCDTOTAL(RYO-IDX))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 1) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 1))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 2) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 2))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 3) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 3))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 4) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 4))
                        MOVE   1   TO  TBL-RYOCOM2-DAY(RYO-IDX3 RYO-IDX)
                        MOVE   1   TO  FLG-ARI
                     END-IF
                   ELSE
                     IF  (TBL-RYOCOM2-MEISAISU  (RYO-IDX3) =
                                    TBL-RYOCOM-MEISAISU  (RYO-IDX))
                     AND (TBL-RYOCOM2-SRYCDTOTAL(RYO-IDX3) =
                                    TBL-RYOCOM-SRYCDTOTAL(RYO-IDX))
                     AND (TBL-RYOCOM2-ADL-TEN   (RYO-IDX3) =
                                    TBL-RYOCOM-ADL-TEN   (RYO-IDX))
                        MOVE   1   TO  TBL-RYOCOM2-DAY(RYO-IDX3 RYO-IDX)
                        MOVE   1   TO  FLG-ARI
                     END-IF
                   END-IF
                  END-PERFORM
                  IF  FLG-ARI  =  ZERO
                     MOVE  TBL-RYOCOM-AREA(RYO-IDX)
                               TO  TBL-RYOCOM2-AREA(RYO-IDX3)
                     MOVE  1   TO  TBL-RYOCOM2-DAY (RYO-IDX3 RYO-IDX)
                  END-IF
      *
                  MOVE      1      TO     FLG-RYOCOM2
      *
               END-IF
      *
           END-PERFORM
      *
           IF  FLG-RYOCOM2   =   ZERO
              PERFORM   2599-RECE2209-TENSOU-SEC
           ELSE
            IF   RECE200-SRYYM  >=  "201004"
              PERFORM   25021-RYOCOM-HENSYU-H22-SEC
            ELSE
              PERFORM   25021-RYOCOM-HENSYU-SEC
            END-IF
           END-IF
      *
           .
       2502-RYOCOM-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメント編集（平成２２年４月診療以降）
      *****************************************************************
       25021-RYOCOM-HENSYU-H22-SEC          SECTION.
      *
           PERFORM  250111-RECE2309-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX2-REC
           INITIALIZE                       WRK-RECE230XX2-REC
      *
           MOVE    RECE2209-MEISAISU    TO  MAX-MEISAISU
      *
      *
           PERFORM  VARYING  RYO-IDX3  FROM  1  BY  1
                     UNTIL  (RYO-IDX3   >   31                    )
                      OR    (TBL-RYOCOM2-MEISAISU(RYO-IDX3) = ZERO)
      *
              INITIALIZE                TBL-NYU-DAY
      *
              MOVE    ZERO          TO  DAY-IDX
              MOVE    ZERO          TO  FLG-NYU-RENZOKU
      *
              PERFORM    VARYING    IDX  FROM   1   BY   1
                          UNTIL    (IDX      >   31)  OR
                                   (DAY-IDX  >   31)
                IF    TBL-RYOCOM2-DAY(RYO-IDX3 IDX)   =  ZERO
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                ELSE
                      IF    FLG-NYU-RENZOKU  =  ZERO
                         ADD   1     TO  DAY-IDX
                         MOVE  IDX   TO  TBL-NYU-DAY-ST(DAY-IDX)
                      END-IF
                      MOVE  IDX      TO  TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  1        TO  FLG-NYU-RENZOKU
                END-IF
              END-PERFORM
      *
      ***     PERFORM  VARYING  DAY-IDX  FROM   1   BY   1
      ***               UNTIL  (DAY-IDX                  >   31)
      ***                OR    (TBL-NYU-DAY-ST(DAY-IDX)  = ZERO)
      ***       IF    TBL-NYU-DAY-ST(DAY-IDX) 
      ***                           =   TBL-NYU-DAY-ED(DAY-IDX)
      ***             MOVE  "840000059"
      ***                           TO  TBL-NYU-DAY-CD(DAY-IDX)
      ***       ELSE
      ***             MOVE  "810000001"
      ***                           TO  TBL-NYU-DAY-CD(DAY-IDX)
      ***       END-IF
      ***     END-PERFORM
      *
      *       算定日コメントの挿入
              PERFORM  VARYING   IDX    FROM  1   BY   1
                        UNTIL   (IDX                  >    31)
                         OR     (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU   =   MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                 MOVE  "810000001"
                             TO  WRK-RECE230XX2-SRYCD(MAX-MEISAISU 1)
                 MOVE   ZERO TO  WRK-RECE230XX2-SRYSURYO(MAX-MEISAISU 1)
      ***        IF    TBL-NYU-DAY-CD(IDX)  =  "840000059"
      ***          MOVE   16 TO  WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
      ***          MOVE   "療養病棟入院期間　　　日〜　　日"
      ***                  TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
      ***          MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
      ***          MOVE   TBL-DAY(DAY-IDX2)
      ***                  TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(19:4)
      ***          MOVE   TBL-NYU-DAY-ED(IDX) TO  DAY-IDX2
      ***          MOVE   TBL-DAY(DAY-IDX2)
      ***                  TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(27:4)
      ***        ELSE
                   MOVE   16 TO  WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                   EVALUATE RECE200-HOSPSBT
                     WHEN    "1"
                       MOVE   "療養病棟入院期間　　　日〜　　日"
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                     WHEN    "2"
                       MOVE   "療養病床入院期間　　　日〜　　日"
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                   END-EVALUATE
                   MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(19:4)
                   MOVE   TBL-NYU-DAY-ED(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(27:4)
      ***        END-IF
               END-IF
              END-PERFORM
      *
              PERFORM  VARYING  IDX  FROM   1   BY   1
                  UNTIL  (IDX                                  >  30  )
                   OR    (TBL-RYOCOM2-IRYO-SRYCD(RYO-IDX3 IDX) = SPACE)
      *
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                   MOVE "810000001"
                              TO WRK-RECE230XX2-SRYCD(MAX-MEISAISU 1)
                   MOVE  ZERO TO WRK-RECE230XX2-SRYSURYO(MAX-MEISAISU 1)
                   MOVE  4    TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                   PERFORM       250212-RYOCOM-NAME-HENSYU-SEC
               END-IF
      *
              END-PERFORM
      *
              PERFORM  VARYING  IDX  FROM   1   BY   1
                UNTIL (IDX   >   4)
      *
                IF  TBL-RYOCOM2-ADL-SRYCD-H22(RYO-IDX3 IDX) NOT = SPACE
                  COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
                  IF  MAX-MEISAISU <= 300
                    MOVE   "810000001"
                             TO WRK-RECE230XX2-SRYCD(MAX-MEISAISU 1)
                    MOVE   ZERO
                             TO WRK-RECE230XX2-SRYSURYO(MAX-MEISAISU 1)
                    EVALUATE  IDX
                      WHEN     1
                        MOVE 17
                           TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬａ　ベッド上の可動性　　　点"
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(29:4)
                      WHEN     2
                        MOVE 11
                           TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬｂ　移乗　　　点"
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(17:4)
                      WHEN     3
                        MOVE 11
                           TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬｃ　食事　　　点"
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(17:4)
                      WHEN     4
                        MOVE 15
                           TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬｄ　トイレの使用　　　点"
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(25:4)
                    END-EVALUATE
                  END-IF
                END-IF
      *
              END-PERFORM
      *
           END-PERFORM
      *
      *
           PERFORM    250211-SRYACTINF3-HENSYU-SEC
      *
           .
       25021-RYOCOM-HENSYU-H22-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメント編集
      *****************************************************************
       25021-RYOCOM-HENSYU-SEC          SECTION.
      *
           PERFORM  250111-RECE2309-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE230
           MOVE    SPACE                TO  WRK-RECE230XX2-REC
           INITIALIZE                       WRK-RECE230XX2-REC
      *
           MOVE    RECE2209-MEISAISU    TO  MAX-MEISAISU
      *
      *
           PERFORM  VARYING  RYO-IDX3  FROM  1  BY  1
                     UNTIL  (RYO-IDX3   >   31                    )
                      OR    (TBL-RYOCOM2-MEISAISU(RYO-IDX3) = ZERO)
      *
              INITIALIZE                TBL-NYU-DAY
      *
              MOVE    ZERO          TO  DAY-IDX
              MOVE    ZERO          TO  FLG-NYU-RENZOKU
      *
              PERFORM    VARYING    IDX  FROM   1   BY   1
                          UNTIL    (IDX      >   31)  OR
                                   (DAY-IDX  >   31)
                IF    TBL-RYOCOM2-DAY(RYO-IDX3 IDX)   =  ZERO
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                ELSE
                      IF    FLG-NYU-RENZOKU  =  ZERO
                         ADD   1     TO  DAY-IDX
                         MOVE  IDX   TO  TBL-NYU-DAY-ST(DAY-IDX)
                      END-IF
                      MOVE  IDX      TO  TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  1        TO  FLG-NYU-RENZOKU
                END-IF
              END-PERFORM
      *
              PERFORM  VARYING  DAY-IDX  FROM   1   BY   1
                        UNTIL  (DAY-IDX                  >   31)
                         OR    (TBL-NYU-DAY-ST(DAY-IDX)  = ZERO)
                IF    TBL-NYU-DAY-ST(DAY-IDX) 
                                    =   TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  "840000059"
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                ELSE
                      MOVE  "810000001"
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                END-IF
              END-PERFORM
      *
      *       算定日コメントの挿入
              PERFORM  VARYING   IDX    FROM  1   BY   1
                        UNTIL   (IDX                  >    31)
                         OR     (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU   =   MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                 MOVE  "810000001"
                             TO  WRK-RECE230XX2-SRYCD(MAX-MEISAISU 1)
                 MOVE   ZERO TO  WRK-RECE230XX2-SRYSURYO(MAX-MEISAISU 1)
                 IF    TBL-NYU-DAY-CD(IDX)  =  "840000059"
                   MOVE   6  TO  WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                   MOVE   "　　月　　日"
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                   MOVE   RECE200-SRYYM(5:2)   TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(1:4)
                   MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(7:4)
                 ELSE
                   MOVE   13 TO  WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                   MOVE   "　　月　　日〜　　月　　日"
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                   MOVE   RECE200-SRYYM(5:2)   TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(1:4)
                               WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(15:4)
                   MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(7:4)
                   MOVE   TBL-NYU-DAY-ED(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(21:4)
                 END-IF
               END-IF
              END-PERFORM
      *
              PERFORM  VARYING  IDX  FROM   1   BY   1
                  UNTIL  (IDX                                  >  30  )
                   OR    (TBL-RYOCOM2-IRYO-SRYCD(RYO-IDX3 IDX) = SPACE)
      *
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                   MOVE "810000001"
                              TO WRK-RECE230XX2-SRYCD(MAX-MEISAISU 1)
                   MOVE  ZERO TO WRK-RECE230XX2-SRYSURYO(MAX-MEISAISU 1)
                   MOVE  4    TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                   PERFORM       250212-RYOCOM-NAME-HENSYU-SEC
               END-IF
      *
              END-PERFORM
      *
              IF   TBL-RYOCOM2-ADL-SRYCD(RYO-IDX3)  NOT =  SPACE
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                MOVE   "810000001"
                             TO WRK-RECE230XX2-SRYCD(MAX-MEISAISU 1)
                MOVE   ZERO  TO WRK-RECE230XX2-SRYSURYO(MAX-MEISAISU 1)
                MOVE   7     TO WRK-RECE230XX2-YUKOKETA(MAX-MEISAISU 1)
                MOVE   "ＡＤＬ　　　点"
                             TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
                MOVE   TBL-RYOCOM2-ADL-TEN-MOJI(RYO-IDX3)
                             TO WRK-RECE230XX2-NAME(MAX-MEISAISU 1)(9:4)
               END-IF
              END-IF
      *
           END-PERFORM
      *
      *
           PERFORM    250211-SRYACTINF3-HENSYU-SEC
      *
           .
       25021-RYOCOM-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ６５９　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       250211-SRYACTINF3-HENSYU-SEC     SECTION.
      *
           PERFORM
               UNTIL  ( FLG-RECE2309           =   1               )
               OR     ( RECE2209-KEY1      NOT =   RECE2309-KEY1   )
               OR     ( RECE2209-ZAINUM    NOT =   RECE2309-ZAINUM )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                          UNTIL  ( IDX                 >   5     )
                           OR    ( RECE2309-SRYCD(IDX) =   SPACE )
                    ADD    1    TO    IDX-RECE230
                    MOVE   RECE2309-SRYACT-TBL(IDX)
                           TO   WRK-RECE230XX2-SRYACT-TBL(IDX-RECE230 1)
               END-PERFORM
      *
               PERFORM 990-RECE2309-NEXT-SEC
      *
           END-PERFORM
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE230
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE230
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE230  =    1
               INITIALIZE                        RECE2301-REC
               MOVE    WRK-RECE230-KEY       TO  RECE2301-KEY
               ADD     1                     TO  WRK-RENNUM
               MOVE    WRK-RENNUM            TO  RECE2301-RENNUM
               MOVE    WRK-RECE230-PTNUM     TO  RECE2301-PTNUM
               MOVE    WRK-RECE230-SRYKA     TO  RECE2301-SRYKA
               MOVE    WRK-RECE230-SRYKBN    TO  RECE2301-SRYKBN
               MOVE    WRK-RECE230-SRYSYUKBN TO  RECE2301-SRYSYUKBN
               MOVE    WRK-RECE230-JIHIMONEY TO  RECE2301-JIHIMONEY
               PERFORM  VARYING   IDX   FROM   1   BY   1
                         UNTIL   (IDX             >   5)
                          OR     (FLG-WRKRECE230   =   1)
                   ADD        1             TO   IDX-RECE230
                   IF (WRK-RECE230XX2-SRYCD(IDX-RECE230 1) = SPACE)
                   OR (IDX-RECE230                         >  300 )
                      MOVE    1             TO    FLG-WRKRECE230
                   ELSE
                      MOVE  WRK-RECE230XX2-SRYACT-TBL(IDX-RECE230 1)
                                       TO   RECE2301-SRYACT-TBL(IDX)
                      ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                   IF   IDX-RECE230   >= 300
                      MOVE    1        TO   FLG-WRKRECE230
                   END-IF
               END-PERFORM
               IF  RECE2301-SRYCD(1)  NOT =  SPACE
                  WRITE   RECE2301-REC
                  ADD     1            TO   CNT-RECE230
               END-IF
           END-PERFORM
      *
           MOVE    RECE2209-REC       TO      RECE2201-REC
           MOVE    WRK-CNT-MEISAI     TO      RECE2201-MEISAISU
      *
           MOVE    RECE2209-MEISAISU  TO      RECE2201-RYOTENKISAISU
      *
           WRITE   RECE2201-REC
           ADD     1                  TO      CNT-RECE220
      *
           .
       250211-SRYACTINF3-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメント名称編集
      *****************************************************************
       250212-RYOCOM-NAME-HENSYU-SEC     SECTION.
      *
           EVALUATE  TBL-RYOCOM2-IRYO-SRYCD(RYO-IDX3 IDX)
             WHEN      "820000057"
             WHEN      "820000096"
                MOVE "「０１」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000058"
             WHEN      "820000097"
                MOVE "「０２」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000059"
             WHEN      "820000098"
                MOVE "「０３」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000060"
             WHEN      "820000099"
                MOVE "「０４」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000061"
             WHEN      "820000100"
                MOVE "「０５」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000062"
             WHEN      "820000101"
                MOVE "「０６」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000063"
             WHEN      "820000102"
                MOVE "「０７」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000064"
             WHEN      "820000103"
                MOVE "「０８」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000065"
             WHEN      "820000104"
                MOVE "「０９」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000066"
             WHEN      "820000105"
                MOVE "「１０」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000067"
             WHEN      "820000106"
                MOVE "「１１」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000068"
             WHEN      "820000107"
                MOVE "「１２」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000069"
             WHEN      "820000108"
                MOVE "「１３」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000070"
             WHEN      "820000109"
                MOVE "「１４」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000071"
             WHEN      "820000110"
                MOVE "「１５」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000072"
             WHEN      "820000111"
                MOVE "「１６」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000073"
             WHEN      "820000112"
             WHEN      "820000229"
                MOVE "「１７」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000074"
             WHEN      "820000113"
                MOVE "「１８」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000075"
             WHEN      "820000114"
             WHEN      "820000230"
                MOVE "「１９」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000076"
             WHEN      "820000115"
                MOVE "「２０」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000077"
             WHEN      "820000116"
                MOVE "「２１」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000078"
             WHEN      "820000117"
                MOVE "「２２」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000079"
             WHEN      "820000118"
             WHEN      "820000231"
                MOVE "「２３」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000080"
             WHEN      "820000119"
                MOVE "「２４」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000081"
             WHEN      "820000120"
                MOVE "「２５」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000082"
             WHEN      "820000121"
                MOVE "「２６」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000083"
             WHEN      "820000122"
                MOVE "「２７」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000084"
             WHEN      "820000123"
                MOVE "「２８」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000085"
             WHEN      "820000124"
                MOVE "「２９」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000086"
             WHEN      "820000125"
                MOVE "「３０」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000087"
             WHEN      "820000126"
                MOVE "「３１」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000088"
             WHEN      "820000127"
                MOVE "「３２」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000089"
             WHEN      "820000128"
                MOVE "「３３」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000090"
             WHEN      "820000129"
                MOVE "「３４」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000091"
             WHEN      "820000130"
                MOVE "「３５」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000092"
             WHEN      "820000131"
                MOVE "「３６」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000093"
             WHEN      "820000132"
                MOVE "「３７」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000232"
                MOVE "「３８」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000158"
             WHEN      "820000160"
                MOVE "「９１」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000159"
                MOVE "「９２」"
                       TO  WRK-RECE230XX2-NAME(MAX-MEISAISU 1)
           END-EVALUATE
      *
           .
       250212-RYOCOM-NAME-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト６４９転送処理
      *****************************************************************
       2599-RECE2209-TENSOU-SEC     SECTION.
      *
           MOVE       RECE2209-REC   TO   RECE2201-REC
           WRITE      RECE2201-REC
           ADD        1              TO   CNT-RECE220
           PERFORM    25991-RECE2309-TENSOU-SEC
      *
           .
       2599-RECE2209-TENSOU-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト６５９転送処理
      *****************************************************************
       25991-RECE2309-TENSOU-SEC     SECTION.
      *
           INITIALIZE                       RECE2309-REC
           MOVE    RECE2209-KEY1        TO  RECE2309-KEY1
           MOVE    RECE2209-ZAINUM      TO  RECE2309-ZAINUM
           START   RECE2309-FILE
               KEY IS    >=   RECE2309-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE2309
               NOT INVALID
                   PERFORM 990-RECE2309-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE2309           =   1               )
               OR     ( RECE2209-KEY1      NOT =   RECE2309-KEY1   )
               OR     ( RECE2209-ZAINUM    NOT =   RECE2309-ZAINUM )
      *
               MOVE    RECE2309-REC      TO   RECE2301-REC
               WRITE   RECE2301-REC
               ADD     1                 TO   CNT-RECE230
      *
               PERFORM 990-RECE2309-NEXT-SEC
      *
           END-PERFORM
      *
           .
       25991-RECE2309-TENSOU-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集
      *****************************************************************
       270-SENTAKUCOM-HENSYU-SEC     SECTION.
      *
      *    パラメータ２２０１ファイルより編集
           INITIALIZE                      RECE2201-REC
           MOVE    RECE200-KEY         TO  RECE2201-KEY1
           MOVE    ZERO                TO  RECE2201-ZAINUM
      *
           START   RECE2201-FILE
               KEY IS    >=   RECE2201-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE2201
               NOT INVALID
                   PERFORM 990-RECE2201-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE2201         =   1             )
               OR     ( RECE200-KEY      NOT =   RECE2201-KEY1 )
      *
               IF     RECE2201-SENTAKUCOMFLG  =  "1"
                  MOVE    ZERO    TO    FLG-SENTAKU-OKIKAE
                  PERFORM   2701-SENTAKUCOM-HENSYU2-SEC
                  IF   FLG-SENTAKU-OKIKAE   =  1
                    PERFORM 2702-SENTAKUCOM-HENSYU4-SEC
                  END-IF
               END-IF
      *
               PERFORM 990-RECE2201-NEXT-SEC
      *
           END-PERFORM
      *
           .
       270-SENTAKUCOM-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集２
      *****************************************************************
       2701-SENTAKUCOM-HENSYU2-SEC     SECTION.
      *
           MOVE    ZERO                TO  IDX45
           MOVE    SPACE               TO  WRK-RECE230XX-REC
           INITIALIZE                      WRK-RECE230XX-REC
      *
           MOVE    ZERO                TO  FLG-SENTAKU-SYUGI
           INITIALIZE                      TBL-GAZO-INF
      *
           INITIALIZE                      RECE2301-REC
           MOVE    RECE2201-KEY1       TO  RECE2301-KEY1
           MOVE    RECE2201-ZAINUM     TO  RECE2301-ZAINUM
           START   RECE2301-FILE
               KEY IS    >=   RECE2301-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE2301
               NOT INVALID
                   PERFORM 990-RECE2301-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE2301          =   1               )
               OR     ( RECE2201-KEY1     NOT =   RECE2301-KEY1   )
               OR     ( RECE2201-ZAINUM   NOT =   RECE2301-ZAINUM )
      *
               PERFORM  VARYING  IDX  FROM  1  BY  1
                         UNTIL  (IDX                 >   5  )
                          OR    (RECE2301-SRYCD(IDX) = SPACE)
                 ADD    1   TO   IDX45
                 MOVE   RECE2301-SRYACT-TBL(IDX)
                            TO   WRK-RECE230XX-SRYACT-TBL(IDX45 1)
      *
                 IF    (RECE2201-FLG-CTMRI-COMMENT  =   SPACE)
                 AND   (RECE2201-SENTAKUBUIFLG  NOT =   SPACE)
                   IF   WRK-RECE230XX-SRYCD(IDX45 1)(1:1) = "1"
                         MOVE    1    TO  FLG-SENTAKU-SYUGI
                   END-IF
                   IF   WRK-RECE230XX-SRYCD(IDX45 1)(1:3) = "002"
                     MOVE  "1"  TO  WRK-RECE230XX-RECEPTFLG(IDX45 1)
                     MOVE   1   TO  FLG-SENTAKU-OKIKAE
                   END-IF
                   IF  ((WRK-RECE230XX-SRYCD(IDX45 1)(1:1) = "8"   ) AND
                        (WRK-RECE230XX-SRYCD(IDX45 1)(4:1) = "1"   ) AND
                        (WRK-RECE230XX-SRYCD(IDX45 1)(5:1) = "8"   ))
                   OR  ( WRK-RECE230XX-SRYCD(IDX45 1) = "830100797" )
                     MOVE     ZERO  TO  FLG-GAZO
                     PERFORM  VARYING  IDX50  FROM  1  BY  1
                               UNTIL  (IDX50 >   10                  )
                                OR    (IDX50 > RECE2201-SENTAKUBUICNT)
                                OR    (WRK-RECE230XX-NAME(IDX50 1)
                                                              = SPACE)
                       IF   (WRK-RECE230XX-NAME(IDX45 1) =
                                       WRK-RECE230XX-NAME(IDX50 1))
                       AND  (TBL-GAZO-CHEKFLG(IDX50)     =  ZERO  )
                         MOVE   1   TO  FLG-GAZO
                         MOVE   10  TO  IDX50
                       END-IF
                     END-PERFORM
                     IF  FLG-GAZO  =  ZERO
                     AND IDX50    <=  10
                       MOVE   WRK-RECE230XX-SRYACT-TBL(IDX45 1)
                                  TO  WRK-RECE230XX-SRYACT-TBL(IDX50 1)
                       IF     FLG-SENTAKU-SYUGI  =  ZERO
                         MOVE 1   TO  TBL-GAZO-CHEKFLG(IDX50)
                       END-IF
                     END-IF
                     MOVE    "1"  TO  WRK-RECE230XX-RECEPTFLG(IDX45 1)
                     MOVE     1   TO  FLG-SENTAKU-OKIKAE
                   END-IF
                 END-IF
      *
                 IF  (IDX45                                >  1        )
                 AND (WRK-RECE230XX-SRYCD(IDX45 1)(1:1)    = "8"       )
                 AND (WRK-RECE230XX-SRYCD(IDX45 1)(4:1)    = "1" OR "6")
                 AND (WRK-RECE230XX-MEISKYFLG(IDX45 1) NOT = "2"       )
                 AND (RECE2201-SRYKBN  NOT = "90" AND "92" AND "97"    )
                   MOVE      ZERO    TO   FLG-GET
                   MOVE      ZERO    TO   FLG-ETC
                   COMPUTE   IDY12   =    IDX45  -  1
                   PERFORM  VARYING  IDY11  FROM  IDY12  BY  -1
                             UNTIL  (IDY11    <  1)
                              OR    (FLG-GET  =  1)
                     IF (WRK-RECE230XX-SRYCD(IDY11 1)(1:1) = "7"  )
                     OR (WRK-RECE230XX-SRYCD(IDY11 1)(1:3) = "059")
                       MOVE    1     TO   FLG-ETC
                       MOVE  IDY11   TO   IDY13
                     ELSE
                       IF WRK-RECE230XX-SRYCD(IDY11 1)(1:1) = "1" OR "6"
                         PERFORM 27011-SENTAKUCOM-HENSYU3-SEC
                         IF   FLG-GET = ZERO
                           MOVE    1     TO   FLG-ETC
                           MOVE  IDY11   TO   IDY13
                         END-IF
                       END-IF
                     END-IF
                   END-PERFORM
                   IF     FLG-GET  =   1
                     IF   WRK-RECE230XX-COMCDCHGFLG(IDX45 1) = "1"
                       MOVE   "810000001"
                                    TO   WRK-RECE230XX-SRYCD(IDX45 1)
                       MOVE    1    TO   FLG-SENTAKU-OKIKAE
                     END-IF
                     IF   FLG-ETC  =   1
                       MOVE    1         TO  FLG-SENTAKU-OKIKAE
                       MOVE    ZERO      TO  IDX46
                       MOVE    SPACE     TO  WRK-RECE230ZZ-REC
                       INITIALIZE            WRK-RECE230ZZ-REC
                       PERFORM  VARYING  IDY11  FROM  1  BY  1
                                 UNTIL   IDY11    >   IDY12
                         IF   IDY11 = IDY13
                           ADD   1   TO   IDX46
                           MOVE  WRK-RECE230XX-SRYACT-TBL(IDX45 1)
                                 TO   WRK-RECE230ZZ-SRYACT-TBL(IDX46 1)
                         END-IF
                         ADD     1   TO   IDX46
                         MOVE    WRK-RECE230XX-SRYACT-TBL(IDY11 1)
                                 TO   WRK-RECE230ZZ-SRYACT-TBL(IDX46 1)
                       END-PERFORM
                       PERFORM  VARYING  IDY11  FROM  1  BY  1
                                 UNTIL   IDY11    >   IDX45
                         MOVE   WRK-RECE230ZZ-SRYACT-TBL(IDY11 1)
                                 TO   WRK-RECE230XX-SRYACT-TBL(IDY11 1)
                       END-PERFORM
                     END-IF
                   ELSE
                     IF   WRK-RECE230XX-COMCDCHGFLG(IDX45 1) = "1"
                       MOVE "810000001" TO WRK-RECE230XX-SRYCD(IDX45 1)
                       MOVE  1          TO FLG-SENTAKU-OKIKAE
                     END-IF
                   END-IF
                 ELSE
                   IF     WRK-RECE230XX-COMCDCHGFLG(IDX45 1) = "1"
                       MOVE "810000001" TO WRK-RECE230XX-SRYCD(IDX45 1)
                       MOVE  1          TO FLG-SENTAKU-OKIKAE
                   END-IF
                 END-IF
               END-PERFORM
      *
               PERFORM 990-RECE2301-NEXT-SEC
      *
           END-PERFORM
      *
           .
       2701-SENTAKUCOM-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集３
      *****************************************************************
       27011-SENTAKUCOM-HENSYU3-SEC     SECTION.
      *
           INITIALIZE                      RKISAI-REC
           MOVE  WRK-RECE230XX-SRYCD(IDY11 1)
                                       TO  RKISAI-SRYCD
           MOVE  RECE200-SRYYM         TO  RKISAI-STYM
           MOVE  RECE200-SRYYM         TO  RKISAI-EDYM
           MOVE  RKISAI-REC            TO  MCPDATA-REC
           MOVE  "tbl_recekisai"       TO  MCP-TABLE
           MOVE  "key5"                TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC  =  ZERO
             MOVE  "tbl_recekisai"     TO  MCP-TABLE
             MOVE  "key5"              TO  MCP-PATHNAME
             PERFORM  900-RKISAI-READ-SEC
             PERFORM  UNTIL (FLG-RKISAI  =  1)
                       OR   (FLG-GET     =  1)
               IF   RKISAI-C-CD  =  WRK-RECE230XX-SRYCD(IDX45 1)
                 MOVE    1    TO    FLG-GET
               END-IF
               MOVE  "tbl_recekisai"   TO  MCP-TABLE
               MOVE  "key5"            TO  MCP-PATHNAME
               PERFORM  900-RKISAI-READ-SEC
             END-PERFORM
           END-IF
           MOVE  "tbl_recekisai"       TO  MCP-TABLE
           MOVE  "key5"                TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       27011-SENTAKUCOM-HENSYU3-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集４
      *****************************************************************
       2702-SENTAKUCOM-HENSYU4-SEC     SECTION.
      *
           MOVE    ZERO                TO  IDX45
      *
           INITIALIZE                      RECE2301-REC
           MOVE    RECE2201-KEY1       TO  RECE2301-KEY1
           MOVE    RECE2201-ZAINUM     TO  RECE2301-ZAINUM
           START   RECE2301-FILE
               KEY IS    >=   RECE2301-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE2301
               NOT INVALID
                   PERFORM 990-RECE2301-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE2301          =   1               )
               OR     ( RECE2201-KEY1     NOT =   RECE2301-KEY1   )
               OR     ( RECE2201-ZAINUM   NOT =   RECE2301-ZAINUM )
      *
               PERFORM  VARYING  IDX  FROM  1  BY  1
                         UNTIL  (IDX                 >   5  )
                          OR    (RECE2301-SRYCD(IDX) = SPACE)
                 ADD    1   TO   IDX45
                 MOVE   WRK-RECE230XX-SRYACT-TBL(IDX45 1)
                            TO   RECE2301-SRYACT-TBL(IDX)
               END-PERFORM
      *
               REWRITE   RECE2301-REC
               ADD       1        TO   CNT-RECE230-RE
      *
               PERFORM 990-RECE2301-NEXT-SEC
      *
           END-PERFORM
      *
      *****REWRITE   RECE2201-REC
      *****ADD     1      TO   CNT-RECE220-RE
      *
           .
       2702-SENTAKUCOM-HENSYU4-EXT.
           EXIT.
      *
      *****************************************************************
      *    エラー出力処理
      *****************************************************************
       500-ERR-HENSYU-SEC                SECTION.
      *
           OPEN    INPUT   RECEERR-FILE
           IF      STS-RECEERR         =   ZERO
               CLOSE   RECEERR-FILE
           ELSE
               OPEN    OUTPUT              RECEERR-FILE
      *
               MOVE    WRK-RECEERR         TO  RECEERR-REC
               WRITE   RECEERR-REC
               CLOSE   RECEERR-FILE
      *         
               IF      WRK-PARA-SHELLID    NOT =   "RECEPTX"
      *            ジョブ管理終了処理
                   MOVE    "JBE"           TO  SJOBKANRI-MODE
                   INITIALIZE                  JOBKANRI-REC
                   MOVE    WRK-RECEERR     TO  JOB-YOBI
                   MOVE    "9999"          TO  JOB-ERRCD
                   PERFORM   900-CALL-ORCSJOB-SEC
               END-IF
           END-IF
      *                             
           MOVE    1                   TO  FLG-END
      *
           .
       500-ERR-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    処理中止処理
      *****************************************************************
       500-CANCEL-HENSYU-SEC                SECTION.
      *
           IF      WRK-PARA-SHELLID    =   "RECEPTX"
               CONTINUE
           ELSE
               MOVE    "CHK"           TO  SJOBKANRI-MODE
               INITIALIZE                  JOBKANRI-REC
               PERFORM   900-CALL-ORCSJOB-SEC
               IF    ( SJOBKANRI-RETURN
                                       =   ZERO )
               AND   ( JOB-STOPFLG     =   1    )
                   MOVE    "処理が中止されました"
                                           TO  WRK-RECEERR
      *
                   OPEN    INPUT   RECEERR-FILE
                   IF      STS-RECEERR         =   ZERO
                       CLOSE   RECEERR-FILE
                   ELSE
                       OPEN    OUTPUT              RECEERR-FILE
      *    
                       MOVE    WRK-RECEERR         TO  RECEERR-REC
                       WRITE   RECEERR-REC
                       CLOSE   RECEERR-FILE
      *         
      *                ジョブ管理終了処理
                       MOVE    "CAN"           TO  SJOBKANRI-MODE
                       INITIALIZE                  JOBKANRI-REC
                       MOVE    WRK-RECEERR     TO  JOB-YOBI
                       MOVE    "8888"          TO  JOB-ERRCD
                       MOVE    2               TO  JOB-STOPFLG
                       PERFORM   900-CALL-ORCSJOB-SEC
                   END-IF
      *                             
                   MOVE    1                   TO  FLG-END
               END-IF
           END-IF
           .
       500-CANCEL-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    終了　　処理
      *****************************************************************
       300-END-SEC                 SECTION.
      *
      *    ファイルＣＬＯＳＥ処理
           PERFORM 310-FILE-CLOSE-SEC
      *
           IF      WRK-PARA-SHELLID    NOT =   "RECEPTX"
      *        ステップ管理終了処理
               MOVE    "STE"           TO  SJOBKANRI-MODE
               INITIALIZE                  JOBKANRI-REC
               PERFORM   900-CALL-ORCSJOB-SEC
      *
               PERFORM 900-DBDISCONNECT-SEC
           END-IF
      *
           DISPLAY "RECE200  CNT-IN  :" CNT-RECE200 
           DISPLAY "RECE2209 CNT-WK  :" CNT-RECE2209
           DISPLAY "RECE2309 CNT-WK  :" CNT-RECE2309
           DISPLAY "RECE220  CNT-OUT :" CNT-RECE220 
           DISPLAY "RECE230  CNT-OUT :" CNT-RECE230 
           DISPLAY "RECE220  REWRITE :" CNT-RECE220-RE
           DISPLAY "RECE230  REWRITE :" CNT-RECE230-RE
           DISPLAY "*** ORCR1240 END ***"
      *
           .
       300-END-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイルＣＬＯＳＥ処理
      *****************************************************************
       310-FILE-CLOSE-SEC              SECTION.
      *
           CLOSE                       RECE200-FILE
      *
           CLOSE                       RECE220-FILE
      *
           CLOSE                       RECE230-FILE
      *
           CLOSE                       RECE2201-FILE     
           CLOSE                       RECE2301-FILE     
      *
           CLOSE                       RECE2209-FILE
           CLOSE                       RECE2309-FILE
      *
           .
       310-FILE-CLOSE-EXT.
           EXIT.
      *
      *****************************************************************
      *    一時ファイル名取得処理
      *****************************************************************
       800-FILENM-SET-SEC        SECTION.
      *
           MOVE    WRK-PARA-TERMID     TO  RECEDAT1PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECEDAT1PARA-HOSPNUM
           MOVE    SGETTEMP-TEMPDIR    TO  TEMPFLPARA
           MOVE    RECEDAT1PARA-BASENAME
                                       TO  TEMPFLPARA (SGETTEMP-ST:)
           .
       800-FILENM-SET-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト０２データ編集処理（０４９）
      *****************************************************************
       800-RECE200-SET2209-SEC           SECTION.
      *
           INITIALIZE                      RECE2209-REC
           MOVE    RECE200-KEY         TO  RECE2209-KEY1
      *
           .
       800-RECE200-SET2209-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト０２データ編集処理（０５９）
      *****************************************************************
       800-RECE200-SET2309-SEC           SECTION.
      *
           INITIALIZE                       RECE2309-REC
           MOVE    RECE200-KEY          TO  RECE2309-KEY1
      *
           .
       800-RECE200-SET2309-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト０２データ順検索処理
      *****************************************************************
       990-RECE200-READ-SEC           SECTION.
      *
           READ    RECE200-FILE         NEXT
               AT  END
                   MOVE    1           TO  FLG-END
               NOT AT  END
                   ADD     1           TO  CNT-RECE200
                   ADD     1           TO  CNT-IN-COMMIT
                                           CNT-IN-CANCEL
      *
                   DISPLAY "RECE200  PTNUM=" RECE200-PTNUM
      *
           END-READ
      *
           .
       990-RECE200-READ-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト０４データ読み
      ****************************************************************
       990-RECE220-NEXT-SEC           SECTION.
      *
           READ    RECE220-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE220
               NOT AT  END
                   MOVE    ZERO      TO  FLG-RECE220
           END-READ
      *
           .
       990-RECE220-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト６４９データ読み
      ****************************************************************
       990-RECE2209-NEXT-SEC           SECTION.
      *
           READ    RECE2209-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE2209
               NOT AT  END
                   MOVE    ZERO      TO  FLG-RECE2209
           END-READ
      *
           .
       990-RECE2209-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト０５データ読み
      ****************************************************************
       990-RECE230-NEXT-SEC           SECTION.
      *
           READ    RECE230-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE230
               NOT AT  END
                   MOVE    ZERO      TO  FLG-RECE230
           END-READ
      *
           .
       990-RECE230-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト６５９データ読み
      ****************************************************************
       990-RECE2309-NEXT-SEC           SECTION.
      *
           READ    RECE2309-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE2309
               NOT AT  END
                   MOVE    ZERO      TO  FLG-RECE2309
           END-READ
      *
           .
       990-RECE2309-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト０４１データ読み
      ****************************************************************
       990-RECE2201-NEXT-SEC           SECTION.
      *
           READ    RECE2201-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE2201
               NOT AT  END
                   MOVE    ZERO      TO  FLG-RECE2201
           END-READ
      *
           .
       990-RECE2201-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト０５１データ読み
      ****************************************************************
       990-RECE2301-NEXT-SEC           SECTION.
      *
           READ    RECE2301-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE2301
               NOT AT  END
                   MOVE    ZERO      TO  FLG-RECE2301
           END-READ
      *
           .
       990-RECE2301-NEXT-EXT.
           EXIT.
      *
      *****************************************************************
      *    診療行為読込
      *****************************************************************
       900-SRYACT-READ-SEC           SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SRYACT-REC
               MOVE    ZERO            TO  FLG-SRYACT
           ELSE
               INITIALIZE                  SRYACT-REC
               MOVE    1               TO  FLG-SRYACT
           END-IF
      *
           .
       900-SRYACT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定履歴付加読込
      *****************************************************************
       900-SANTEIPLUS-READ-SEC           SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SANTEIPLUS-REC
               MOVE    ZERO            TO  FLG-SANTEIPLUS
           ELSE
               INITIALIZE                  SANTEIPLUS-REC
               MOVE    1               TO  FLG-SANTEIPLUS
           END-IF
      *
           .
       900-SANTEIPLUS-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト記載
      *****************************************************************
       900-RKISAI-READ-SEC           SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  RKISAI-REC
               MOVE    ZERO            TO  FLG-RKISAI
           ELSE
               INITIALIZE                  RKISAI-REC
               MOVE    1               TO  FLG-RKISAI
           END-IF
      *
           .
       900-RKISAI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定履歴マスタ読み込み
      *****************************************************************
       900-SANTEI-INV-SEC             SECTION.
      *
           MOVE    WRK-MCP-TABLE       TO  MCP-TABLE
           MOVE    WRK-MCP-PATHNAME    TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    WRK-MCP-TABLE       TO  MCP-TABLE
               MOVE    WRK-MCP-PATHNAME    TO  MCP-PATHNAME
               PERFORM 900-DBFETCH-SEC
               IF      MCP-RC              =   ZERO
                   MOVE    MCPDATA-REC         TO  SANTEI-REC
                   MOVE    ZERO                TO  FLG-SANTEI
               ELSE
                   MOVE    1                   TO  FLG-SANTEI
                   INITIALIZE                      SANTEI-REC
               END-IF
           ELSE
               MOVE    1                   TO  FLG-SANTEI
               INITIALIZE                      SANTEI-REC
           END-IF
      *
           MOVE    WRK-MCP-TABLE       TO  MCP-TABLE
           MOVE    WRK-MCP-PATHNAME    TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       900-SANTEI-INV-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定歴マスタ読み込み
      *****************************************************************
       900-SANTEI-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  SANTEI-REC
               MOVE    ZERO                TO  FLG-SANTEI
           ELSE
               INITIALIZE                      SANTEI-REC
               MOVE    1                   TO  FLG-SANTEI
           END-IF
      *
           .
       900-SANTEI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院履歴マスタ読み込み
      *****************************************************************
       900-PTNYUINRRK-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  PTNYUINRRK-REC
               MOVE    ZERO                TO  FLG-PTNYUINRRK
           ELSE
               INITIALIZE                      PTNYUINRRK-REC
               MOVE    1                   TO  FLG-PTNYUINRRK
           END-IF
      *
           .
       900-PTNYUINRRK-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    患者コメントマスタ読み込み
      *****************************************************************
       900-PTCOM-READ-SEC           SECTION.
      *
           MOVE     PTCOM-REC          TO      MCPDATA-REC
           MOVE    "tbl_ptcom"         TO      MCP-TABLE
           MOVE    "key"               TO      MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_ptcom"       TO      MCP-TABLE
               MOVE    "key"             TO      MCP-PATHNAME
               PERFORM   900-DBFETCH-SEC
               IF      MCP-RC              =   ZERO
                   MOVE    MCPDATA-REC         TO  PTCOM-REC
                   MOVE    ZERO                TO  FLG-PTCOM
               ELSE
                   MOVE    1                   TO  FLG-PTCOM
                   INITIALIZE                      PTCOM-REC
               END-IF
           ELSE
               MOVE    1                       TO  FLG-PTCOM
               INITIALIZE                          PTCOM-REC
           END-IF
      *
           MOVE    "tbl_ptcom"         TO      MCP-TABLE
           MOVE    "key"               TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       900-PTCOM-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    点数テーブルの検索
      *****************************************************************
       900-TENSU-TBL-SEC               SECTION.
      *
           INITIALIZE                           TNS-TENSU-REC
           MOVE    WRK-TENSU-SRYCD      TO      TNS-SRYCD
           MOVE    WRK-TENSU-SRYYM      TO      TNS-YUKOSTYMD(1:6)
           MOVE    "01"                 TO      TNS-YUKOSTYMD(7:2)
           MOVE    TNS-YUKOSTYMD        TO      TNS-YUKOEDYMD
           MOVE    SPA-HOSPNUM          TO      TNS-HOSPNUM
           MOVE    TNS-TENSU-REC        TO      MCPDATA-REC
           MOVE    "tbl_tensu"          TO      MCP-TABLE
           MOVE    "key"                TO      MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC               =       ZERO
               MOVE    "tbl_tensu"      TO      MCP-TABLE
               MOVE    "key"            TO      MCP-PATHNAME
               PERFORM   900-DBFETCH-SEC
               IF      MCP-RC           =       ZERO
                   MOVE    MCPDATA-REC  TO      TNS-TENSU-REC
                   MOVE    ZERO         TO      FLG-TENSU
               ELSE
                   INITIALIZE                   TNS-TENSU-REC
                   MOVE    1            TO      FLG-TENSU
               END-IF
           ELSE
               INITIALIZE                       TNS-TENSU-REC
               MOVE    1                TO      FLG-TENSU
           END-IF
      *
           MOVE    "tbl_tensu"          TO      MCP-TABLE
           MOVE    "key"                TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       900-TENSU-TBL-EXT.
           EXIT.
      *
      *****************************************************************
      *    システム管理マスター読込
      *****************************************************************
       900-SYSKANRI-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SYS-1005-REC
               MOVE    ZERO            TO  FLG-SYSKANRI
           ELSE
               INITIALIZE                  SYS-1005-REC
               MOVE    1               TO  FLG-SYSKANRI
           END-IF
      *
           .
       900-SYSKANRI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    テーブルクローズ処理
      *****************************************************************
       900-CLOSE-SEC               SECTION.
      *
           MOVE    "DBCLOSECURSOR"     TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-CLOSE-EXT.
           EXIT.
      *      
      *
      *****************************************************************
      *    ジョブ管理ＤＢ制御処理
      *****************************************************************
       900-CALL-ORCSJOB-SEC            SECTION.
      *
           MOVE    WRK-PARA-JOBID  TO  JOB-JOBID
           MOVE    WRK-PARA-SHELLID
                                   TO  JOB-SHELLID
           MOVE    SPA-HOSPNUM     TO  JOB-HOSPNUM
           CALL    "ORCSJOB"       USING
                                   ORCSJOBKANRIAREA 
                                   JOBKANRI-REC
                                   SPA-AREA
           .
       900-CALL-ORCSJOB-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢＳＥＬＥＣＴ処理
      *****************************************************************
       900-DBSELECT-SEC                SECTION.
      *
           MOVE    "DBSELECT"          TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
           IF      MCP-RC              =   ZERO
               CONTINUE
           ELSE
               DISPLAY "SELECT ERR table=" MCP-TABLE
                       " pathname="        MCP-PATHNAME
           END-IF
           .
       900-DBSELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢＦＥＴＣＨ処理
      *****************************************************************
       900-DBFETCH-SEC                SECTION.
      *
           MOVE    "DBFETCH"           TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-DBFETCH-EXT.
           EXIT.
      *
      *
      *****************************************************************
      *    テーブルアクセス処理
      *****************************************************************
       900-ORCDBMAIN-SEC               SECTION.
      *
           CALL    "ORCDBMAIN"     USING   MCPAREA
                                           MCPDATA-REC
                                           SPA-AREA
           .
      *
       900-ORCDBMAIN-EXT.
           EXIT.
      *      
      *****************************************************************
      *    ＤＢ　オープン処理
      *****************************************************************
       120-DBOPEN-SEC                SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBOPEN"            TO  MCP-FUNC
           PERFORM   900-ORCDBMAIN-SEC
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBSTART"           TO  MCP-FUNC
           PERFORM   900-ORCDBMAIN-SEC
           .
       120-DBOPEN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢ　クローズ処理
      *****************************************************************
       900-DBDISCONNECT-SEC            SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBCOMMIT"          TO  MCP-FUNC
           PERFORM   900-ORCDBMAIN-SEC
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBDISCONNECT"      TO  MCP-FUNC
           PERFORM   900-ORCDBMAIN-SEC
      *
           .
       900-DBDISCONNECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢ　ＣＯＭＭＩＴ処理
      *****************************************************************
       900-DBCOMMIT-SEC            SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBCOMMIT"          TO  MCP-FUNC
           PERFORM   900-ORCDBMAIN-SEC
      *
           .
       900-DBCOMMIT-EXT.
           EXIT.
      *      
      *****************************************************************
      *    ＤＢ　ＳＴＡＲＴ処理
      *****************************************************************
       900-DBSTART-SEC                SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBSTART"           TO  MCP-FUNC
           PERFORM   900-ORCDBMAIN-SEC
           .
       900-DBSTART-EXT.
           EXIT.
