      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
       IDENTIFICATION          DIVISION.
       PROGRAM-ID.             ORCR0981.
      *****************************************************************
      *  システム名        : ＯＲＣＡ
      *  サブシステム名    : レセプト入院（労災）
      *  コンポーネント名  : レセプト電算ファイル作成
      *                      コメント編集
      *  管理者            : 
      *  作成日付    作業者        記述
      *  13/02/12    NACL−門脇    新規作成
      *****************************************************************
      *  プログラム修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      *  05.00.01    NACL-門脇    19/04/03  自動記載コメント改元対応
      *  05.00.02    NACL-門脇    19/05/16  退院時共同指導料２コメント自動
      *                                     記載対応
      *  05.00.03    NACL-門脇    19/06/24  リハビリ発症日レセプト記載対応
      *                                     （機能追加）
      *  05.00.04    NACL-門脇    19/08/01  リハビリ発症日レセプト記載対応
      *                                     （機能追加）修正
      *  05.00.05    NACL-門脇    20/03/30  令和２年４月改正対応
      *  05.00.06    NACL-門脇    20/05/07  令和２年４月改正対応
      *                                     画像診断コメント対応
      *  05.00.07    NACL-門脇    20/06/03  画像診断コメント対応修正
      *  05.00.08    NACL-門脇    20/06/05  画像診断コメント対応修正
      *  05.00.09    NACL-門脇    20/07/01  選択式コメント対応（自動記載）
      *  05.00.10    NACL-門脇    20/09/03  選択式コメント対応（自動記載）
      *  05.00.11    NACL-門脇    20/10/09  選択式コメント対応（自動記載）
      *  05.00.12    ORCAMO       21/08/12  【包括診療】画像診断の
      *                                     選択式コメント編集修正
      *  05.01.00    ORCAMO       22/01/06  在宅持続陽圧呼吸療法指導管
      *                                     理料対応
      *  05.01.01    ORCAMO       22/01/27  特別訪問看護指示加算対応
      *  05.01.02    ORCAMO       22/03/31  令和４年４月改正対応
      *  05.01.03    ORCAMO       22/05/11  新たな選択式コメント対応
      *                                     （４桁目が"6"）
      *  05.01.04    ORCAMO       22/05/17  新たな部位コメント追加
      *  05.01.05    ORCAMO       22/06/21  廃用症候群リハの初期加算の
      *                                     疾患名コメントコード変更対応
      *  05.01.06    ORCAMO       22/11/11  関連コメント対応
      *                                     （医薬品、器材）
      *  05.01.07    ORCAMO       22/11/14  初診料コード追加対応
      *  05.01.08    ORCAMO       22/11/15  （検選）等のコメント編集修正
      *  05.02.01    ORCAMO       23/05/01  令和５年５月改正対応
      *  05.02.02    ORCAMO       24/06/06  令和６年６月改正対応
      *****************************************************************
      *
       ENVIRONMENT             DIVISION.
       CONFIGURATION               SECTION.
       INPUT-OUTPUT                SECTION.
       FILE-CONTROL.
      *
           SELECT  RECE82-FILE     ASSIGN  RECE82PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE82-KEY
                                   FILE    STATUS  IS  STS-RECE82.
      *
           SELECT  RECE84-FILE     ASSIGN  RECE84PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  SEQUENTIAL
                                   RECORD  KEY     IS  RECE84-KEY
                                   FILE    STATUS  IS  STS-RECE84.
      *
           SELECT  RECE85-FILE     ASSIGN  RECE85PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  SEQUENTIAL
                                   RECORD  KEY     IS  RECE85-KEY
                                   FILE    STATUS  IS  STS-RECE85.
      *
           SELECT  RECE841-FILE    ASSIGN  RECE841PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE841-KEY
                                   FILE    STATUS  IS  STS-RECE841.
      *
           SELECT  RECE851-FILE    ASSIGN  RECE851PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE851-KEY
                                   FILE    STATUS  IS  STS-RECE851.
      *ワーク
           SELECT  RECE849-FILE    ASSIGN  RECE849PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE849-KEY
                                   FILE    STATUS  IS  STS-RECE849.
      *
           SELECT  RECE859-FILE    ASSIGN  RECE859PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE859-KEY
                                   FILE    STATUS  IS  STS-RECE859.
      *
           SELECT  RECE855-FILE    ASSIGN  RECE855PARA
                                   ORGANIZATION    IS  INDEXED
                                   ACCESS  MODE    IS  DYNAMIC
                                   RECORD  KEY     IS  RECE855-KEY
                                   FILE    STATUS  IS  STS-RECE855.
      *    エラーファイル
           SELECT  RECEERR-FILE    ASSIGN  RECEERR
                                   FILE    STATUS  IS  STS-RECEERR.
      *
       DATA                    DIVISION.
       FILE                        SECTION.
      *
       FD  RECE82-FILE.
       01  RECE82-REC.
           COPY    "CPRCF082.INC".
      *
       FD  RECE84-FILE.
       01  RECE84-REC.
           COPY    "CPRCF084.INC".
      *
       FD  RECE85-FILE.
       01  RECE85-REC.
           COPY    "CPRCF085.INC".
      *
       FD  RECE841-FILE.
       01  RECE841-REC. 
           COPY    "CPRCF0841.INC".
      *
       FD  RECE851-FILE.
       01  RECE851-REC. 
           COPY    "CPRCF085.INC"  REPLACING   //RECE85//
                                   BY          //RECE851//.
      *ワーク
       FD  RECE849-FILE.
       01  RECE849-REC. 
           COPY    "CPRCF084.INC" REPLACING    //RECE84//
                                   BY          //RECE849//.
      *
       FD  RECE859-FILE.
       01  RECE859-REC. 
           COPY    "CPRCF085.INC"  REPLACING   //RECE85//
                                   BY          //RECE859//.
      *
       FD  RECE855-FILE.
       01  RECE855-REC. 
           COPY    "CPRCF0855.INC".
      *
      *    エラーファイル
       FD  RECEERR-FILE.
       01  RECEERR-REC             PIC X(200). 
      *
       WORKING-STORAGE             SECTION.
      *     レセプト明細ファイル 名称領域 
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE82//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE84//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE85//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE841//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE851//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE849//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE859//.
      *
           COPY    "CPRECEDAT1.INC"
                                   REPLACING  //RECEDAT1//
                                   BY         //RECE855//.
      *
      *    エラーファイル 名称領域 
           COPY    "CPERRFL.INC"   REPLACING  //ERRFLPARA//
                                   BY         //RECEERR//.
      *
      *    フラグ領域
       01  STS-AREA.
           03  STS-RECE82          PIC X(02).
           03  STS-RECE84          PIC X(02).
           03  STS-RECE841         PIC X(02).
           03  STS-RECE85          PIC X(02).
           03  STS-RECE851         PIC X(02).
           03  STS-RECE849         PIC X(02).
           03  STS-RECE859         PIC X(02).
           03  STS-RECE855         PIC X(02).
           03  STS-RECEERR         PIC X(02).
      *
      *    フラグ領域
       01  FLG-AREA.
           03  FLG-END             PIC 9(01).
           03  FLG-RECE84          PIC 9(01).
           03  FLG-RECE849         PIC 9(01).
           03  FLG-RECE841         PIC 9(01).
           03  FLG-RECE85          PIC 9(01).
           03  FLG-RECE859         PIC 9(01).
           03  FLG-RECE851         PIC 9(01).
           03  FLG-FIRST           PIC 9(01).
           03  FLG-SRYACT          PIC 9(01).
      *
           03  FLG-YAKUKAN-COMMENT PIC 9(01).
           03  FLG-HINKAI-COMMENT  PIC 9(01).
           03  FLG-KYUSEI-COMMENT  PIC 9(01).
           03  FLG-KYUSEI-COMMENT2 PIC 9(01).
           03  FLG-WRKRECE85       PIC 9(01).
           03  FLG-COMMENT         PIC 9(02).
           03  FLG-NYU-RENZOKU     PIC 9(01).
           03  FLG-SANTEI          PIC 9(01).
           03  FLG-KYUSEI-OK       PIC 9(01).
           03  FLG-PTCOM           PIC 9(01).
           03  FLG-RIHA            PIC 9(01).
           03  FLG-TENSU           PIC 9(01).
           03  FLG-RYOCOM          PIC 9(01).
           03  FLG-RYOCOM2         PIC 9(01).
           03  FLG-ARI             PIC 9(01).
           03  FLG-SYSKANRI        PIC 9(01).
           03  FLG-COMOKIKAE       PIC 9(01).
           03  FLG-COMOKIKAE2      PIC 9(01).
           03  FLG-HANTEI          PIC 9(01).
           03  FLG-COMARI          PIC 9(01).
           03  FLG-COMARI2         PIC 9(01).
           03  FLG-SANTEIPLUS      PIC 9(01).
           03  FLG-KAISIEN         PIC 9(01).
           03  FLG-PTNYUINRRK      PIC 9(01).
           03  FLG-NG              PIC 9(01).
           03  FLG-SANTEIPLUS-HANTEI
                                   PIC 9(01).
           03  FLG-KAISYOKU-COMMENT
                                   PIC 9(01).
           03  FLG-OK              PIC 9(01).
           03  FLG-OK2             PIC 9(01).
           03  FLG-SETCOM          PIC 9(01).
           03  FLG-SETCOM2         PIC 9(01).
           03  FLG-MEISKY-OKIKAE   PIC 9(01).
           03  FLG-SETCOM-OKIKAE   PIC 9(01).
           03  FLG-SINPESUR-COMMENT
                                   PIC 9(01).
           03  FLG-SINPESUR-COMMENT2
                                   PIC 9(01).
           03  FLG-ZAIKYO-COMMENT  PIC 9(01).
           03  FLG-CHECK-MAE       PIC 9(01).
           03  FLG-CHECK-ATO       PIC 9(01).
           03  FLG-RETRY           PIC 9(01).
           03  FLG-ZAIKYO-OK       PIC 9(01).
           03  FLG-ZAIKYOCOMARI    PIC 9(01).
           03  FLG-CYOJKSN-OK      PIC 9(01).
           03  FLG-CYOJKSNCOMARI   PIC 9(01).
           03  FLG-CYOJKSN         PIC 9(01).
           03  FLG-GET             PIC 9(01).
           03  FLG-RKISAI          PIC 9(01).
           03  FLG-ETC             PIC 9(01).
           03  FLG-SENTAKU-OKIKAE  PIC 9(01).
           03  FLG-SENTAKU-OKIKAE2 PIC 9(01).
           03  FLG-JINNAI-COMMENT  PIC 9(01).
           03  FLG-GAZO            PIC 9(01).
           03  FLG-SENTAKU-SYUGI   PIC 9(01).
           03  FLG-YOUATU-COMMENT  PIC 9(01).
           03  FLG-COM-HENSYU      PIC 9(01).
           03  FLG-COM-HENSYU2     PIC 9(01).
           03  FLG-KOUYAK-COMMENT  PIC 9(01).
           03  FLG-TEJHOU-COMMENT  PIC 9(01).
      *
      *    カウント領域
       01  CNT-AREA.
           03  CNT-RECE82          PIC 9(06).
           03  CNT-RECE84          PIC 9(06).
           03  CNT-RECE85          PIC 9(06).
           03  CNT-RECE849         PIC 9(06).
           03  CNT-RECE859         PIC 9(06).
           03  CNT-RECE855         PIC 9(06).
           03  CNT-RECE84-RE       PIC 9(06).
           03  CNT-RECE85-RE       PIC 9(06).
           03  CNT-RIHA            PIC 9(06).
           03  CNT-KENSA           PIC 9(06).
      *
      *    添字領域
       01  IDX-AREA.
           03  IDX                 PIC 9(04).
           03  IDX1                PIC 9(04).
           03  IDX2                PIC 9(04).
           03  IDX3                PIC 9(02).
           03  IDX4                PIC 9(04).
           03  IDX5                PIC 9(04).
           03  IDX6                PIC 9(04).
           03  IDX12               PIC 9(04).
           03  IDX13               PIC 9(04).
           03  IDX15               PIC 9(01).
           03  IDX16               PIC 9(02).
           03  IDX17               PIC 9(02).
           03  IDX18               PIC 9(02).
           03  IDX20               PIC 9(04).
           03  IDX21               PIC 9(01).
           03  IDX26               PIC 9(02).
           03  IDX27               PIC 9(02).
           03  IDX28               PIC 9(02).
           03  IDX29               PIC 9(02).
           03  IDX30               PIC 9(02).
           03  IDX32               PIC 9(02).
           03  IDX33               PIC 9(02).
           03  IDX41               PIC 9(02).
           03  IDX42               PIC 9(02).
           03  IDX43               PIC 9(02).
           03  IDX44               PIC 9(02).
           03  IDX45               PIC 9(03).
           03  IDX46               PIC 9(03).
           03  IDX48               PIC 9(02).
           03  IDX49               PIC 9(02).
           03  IDX50               PIC 9(02).
           03  IDX51               PIC 9(03).
           03  IDX52               PIC 9(03).
           03  IDX53               PIC 9(03).
           03  IDY                 PIC 9(04).
           03  IDY11               PIC 9(03).
           03  IDY12               PIC 9(03).
           03  IDY13               PIC 9(03).
           03  IDZ                 PIC 9(04).
           03  DAY-IDX             PIC 9(04).
           03  DAY-IDX2            PIC 9(02).
           03  DAY-IDX3            PIC 9(01).
           03  DAY-IDX4            PIC 9(03).
           03  IDX-RECE85          PIC 9(04).
           03  IDV                 PIC 9(04).
           03  IDV2                PIC 9(04).
           03  IDV3                PIC 9(04).
           03  RYO-IDX             PIC 9(03).
           03  RYO-IDX2            PIC 9(03).
           03  RYO-IDX3            PIC 9(03).
           03  IDW                 PIC 9(04).
           03  IDC1                PIC 9(02).
           03  IDC2                PIC 9(02).
           03  IDC3                PIC 9(02).
           03  IDC4                PIC 9(02).
           03  RIHA-IDX            PIC 9(02).
           03  RIHA-IDX2           PIC 9(02).
           03  RIHA-ST             PIC 9(02).
           03  RIHA-ST2            PIC 9(02).
           03  RIHA-ED             PIC 9(02).
           03  RIHA-ED2            PIC 9(02).
           03  IDX-JIDO            PIC 9(04).
      *
      *    一時領域
       01  WRK-AREA.
           03  WRK-PARA.
               05  WRK-PARA-SRYYM              PIC  X(06).
               05  WRK-PARA-TERMID             PIC  X(16).
               05  WRK-PARA-SYSYMD             PIC  X(08).
               05  WRK-PARA-RECEKBN            PIC  X(01).
               05  WRK-PARA-JOBID              PIC  9(07).
               05  WRK-PARA-SHELLID            PIC  X(08).
           03  WRK-PARA-JIBAIPRTKBN            PIC  X(01).
           03  WRK-PARA-HOSPNUM                PIC  9(02).
      *
           03  WRK-JYUNBAN         PIC 9(04).
           03  WRK-GYOSUU          PIC 9(04).
           03  WRK-GYOSUU2         PIC 9(04).
           03  WRK-RENNUM          PIC 9(02).
           03  WRK-CNT-MEISAI      PIC 9(04).
           03  WRK-KETA            PIC 9(04).
           03  WRK-KETA-TAIHI      PIC 9(04).
           03  WRK-KETA2           PIC 9(04).
      *
           03  WRK-FSANTEIYMD      PIC 9(08).
           03  WRK-AFTER2          PIC 9(08).
           03  WRK-AFTER180        PIC 9(08).
           03  WRK-TOSEKIYMD       PIC 9(08).
           03  WRK-KYUSEIYMD       PIC 9(08).
           03  WRK-HINKAIYMD       PIC 9(08).
           03  WRK-DAY             PIC 9(02).
      *
           03  WRK-SRYKBN          PIC X(02).
           03  WRK-SRYCD           PIC X(09).
           03  WRK-SRYCD2          PIC X(09).
           03  WRK-ZAINUM          PIC 9(08).
      *
           03  WRK-HENSYU-KAISU    PIC X(02).
           03  WRK-HENSYU-KAISU2   PIC X(04).
           03  WRK-HENSYU-KAISU3   PIC X(03).
           03  WRK-HENSYU-KAISU4   PIC X(06).
      *
           03  WRK-HENSYU-KASANRITU   PIC X(01).
           03  WRK-HENSYU-KASANRITU2  PIC X(02).
      *
           03  WRK-TUKI-YAKUKAN    PIC 9(02).
           03  WRK-DAY-YAKUKAN     PIC 9(02).
      *
           03  TBL-SANTEI-DAY.
               05  TB-SANTEI-DAY   PIC 9(02)   OCCURS  31.
      *
      *    該当診療月分
           03  TBL-RIHASANTEI-DAY.
               05  TB-RIHASANTEI-DAY PIC 9(01) OCCURS  31.
      *
           03  TBL-RIHASANTEI-DAY-END.
               05  TB-RIHASANTEI-DAY-END
                                     PIC 9(01) OCCURS  31.
           03  TBL-RIHASANTEI-DAY-END2.
               05  TB-RIHASANTEI-DAY-END2
                                     PIC 9(01) OCCURS  31.
           03  TBL-RIHASANTEI-DAY-END3.
               05  TB-RIHASANTEI-DAY-END3
                                     PIC 9(01) OCCURS  31.
      *
      *    直近分
           03  WRK-RIHASANTEI-YMD    PIC X(08).
      *
      *    直近分退避用
           03  WRK-RIHASANTEI-YMD2   PIC X(08).
           03  WRK-RIHASANTEI-YMD3   PIC X(08).
      *
      *    前月以前の直近終了日
           03  WRK-RIHASANTEI-END    PIC X(08).
      *
      *    ２００６年４月１日に算定日があるか
           03  WRK-RIHASANTEI41-FLG  PIC 9(01).
      *
      *    リハビリ開始日指定チェック用
           03  WRK-CHECK-RIHASANTEI-AREA.
               05  WRK-CHECK-RIHASANTEI-YMD     PIC X(08).
               05  WRK-CHECK-RIHASANTEI-YMD3    PIC X(08).
               05  WRK-CHECK-RIHASANTEI-DAY-OCC.
                 07  WRK-CHECK-RIHASANTEI-DAY   PIC 9(01)  OCCURS  31.
      *
           03  TBL-NYU-DAY.
               05  TBL-NYU-DAY-OCC             OCCURS  31.
                 07  TBL-NYU-DAY-ST  PIC 9(02).
                 07  TBL-NYU-DAY-ED  PIC 9(02).
                 07  TBL-NYU-DAY-CD  PIC X(09).
      *
           03  WRK-ZENYYMM           PIC 9(06).
      *
           03  WRK-KEISAN            PIC 9(09).
           03  WRK-KEISAN2           PIC 9(03).
           03  WRK-KEISAN3           PIC 9(09).
           03  WRK-KEISAN4           PIC 9(09).
           03  WRK-KEISAN-TAIHI      PIC X(09).
      *
           03  WRK-KYUSEI-NYUGAIKBN  PIC X(01).
           03  WRK-KYUSEI-SRYKA      PIC X(02).
           03  WRK-KYUSEI-ZAINUM     PIC 9(08).
      *
           03  WRK-ZAIKYO-NYUGAIKBN  PIC X(01).
           03  WRK-ZAIKYO-SRYKA      PIC X(02).
           03  WRK-ZAIKYO-ZAINUM     PIC 9(08).
      *
           03  WRK-CYOJKSN-INPUTCOMENT
                                     PIC X(140).
           03  WRK-CYOJKSN-NAME      PIC X(140).
           03  WRK-CYOJKSN-INPUTCOMENT2
                                     PIC X(140).
           03  WRK-CYOJKSN-NAME2     PIC X(140).
           03  WRK-CYOJKSN-INPUTCOMENT3
                                     PIC X(140).
      *
           03  WRK-HENYMD            PIC X(08).
           03  WRK-TAIHI-XX          PIC X(02).
      *
           03  WRK-OKIKAEFLG         PIC X(01).
      *
           03  WRK-RIHAIGAKU-SRYCD           PIC X(09).
           03  WRK-RIHAIGAKU-SRYCD2          PIC X(09).
           03  WRK-RIHAIGAKU-FSANTEIYMD      PIC X(08).
           03  WRK-RIHAIGAKU-SANTEI-AREA.
               05  WRK-RIHAIGAKU-SANTEI-FLG  PIC X(01).
               05  WRK-RIHAIGAKU-SANTEI-DAY  PIC 9(03)
                                             OCCURS 31.
      *
           03  WRK-MCP-TABLE         PIC X(64).
           03  WRK-MCP-PATHNAME      PIC X(64).
      *
           03  WRK-YAKUKAN-SRYCD     PIC X(09).
      *
           03  WRK-KAISIEN-FSANTEIYMD        PIC X(08).
           03  WRK-KAISIEN-YMD               PIC X(08).
           03  WRK-KAISIEN-CHECKYMD          PIC X(08).
           03  WRK-KAISIEN-RRKNUM            PIC 9(03).
           03  WRK-KAISIEN-RRKNUM-X          PIC 9(03).
           03  WRK-KAISIEN-RRKNUM-Y          PIC 9(03).
      *
           03  WRK-BUNKAKUKETA               PIC 9(02).
           03  WRK-BUNKAKU-N                 PIC X(10).
           03  WRK-SRYKAISU-X                PIC ZZ9.
           03  WRK-CHAR-HENKAN-AREA.
               05  WRK-CHAR-X                PIC X(03).
               05  WRK-CHAR-N                PIC X(06).
               05  WRK-CHAR-N-CNT            PIC 9(01).
               05  WRK-CHAR-IDX              PIC 9(01).
      *
           03  WRK-KAISYOKU-YMD              PIC X(08).
      *
           03  WRK-HEN-RENNUM                PIC 9(02).
           03  WRK-HEN-SHORI-RENNUM          PIC 9(01).
           03  WRK-HEN-SEQNO                 PIC 9(02).
      *
           03  WRK-HEN-RENNUM-X              PIC 9(02).
           03  WRK-HEN-SHORI-RENNUM-X        PIC 9(01).
           03  WRK-HEN-SEQNO-X               PIC 9(02).
      *
           03  WRK-HEN-RENNUM-J              PIC 9(02).
           03  WRK-HEN-SHORI-RENNUM-J        PIC 9(01).
           03  WRK-HEN-SEQNO-J               PIC 9(02).
      *
           03  WRK-HEN-RENNUM-J2             PIC 9(02).
           03  WRK-HEN-SHORI-RENNUM-J2       PIC 9(01).
           03  WRK-HEN-SEQNO-J2              PIC 9(02).
      *
           03  WRK-SINPESUR-YMD              PIC X(08).
           03  WRK-SINPESUR-YMD2             PIC X(08).
           03  WRK-ZAIKYO-YMD                PIC X(08).
           03  WRK-ZAIKYO-YMD2               PIC X(08).
           03  WRK-CYOJKSN-YMD               PIC X(08).
           03  WRK-HAIJRT-YMD                PIC X(08).
      *
           03  WRK-GANSIDO-YMD-AREA.
               05  WRK-GANSIDO-YMD           PIC X(08)
                                             OCCURS 10.
           03  WRK-GANSIDO-DATA              PIC X(08).
      *
           03  WRK-BOKOHO-YMD2-AREA.
               05  WRK-BOKOHO-YMD2           PIC X(08)
                                             OCCURS 30.
      *
           03  WRK-ZAIKYO-YMD9               PIC X(08).
           03  WRK-ZAIKYO-KAISU              PIC 9(02).
           03  WRK-HAIJRT-KAISU              PIC 9(02).
      *
           03  WRK-CYOJKSN-TAIHIYM           PIC X(06).
           03  WRK-CYOJKSN-TAIHIDD           PIC X(02).
      *
           03  WRK-CYOJKSN-YMD-XXX              PIC X(08).
           03  WRK-CYOJKSN-COM-XXX              PIC X(140).
           03  WRK-CYOJKSN-COM2-XXX             PIC X(140).
           03  WRK-CYOJKSN-YMD-YYY              PIC X(08).
           03  WRK-CYOJKSN-COM-YYY              PIC X(140).
           03  WRK-CYOJKSN-COM2-YYY             PIC X(140).
           03  WRK-CYOJKSN-KAISHIDAY-XXX-AREA.
             04  WRK-CYOJKSN-KAISHIDAY-XXX-OCC  OCCURS  2.
               05  WRK-CYOJKSN-KAISHIDAY-XXX    PIC X(08).
               05  WRK-CYOJKSN-INPUTCOMENT-XXX  PIC X(140).
               05  WRK-CYOJKSN-NAME-XXX         PIC X(140).
           03  WRK-CYOJKSN-KAISHIDAY-YYY-AREA.
             04  WRK-CYOJKSN-KAISHIDAY-YYY-OCC  OCCURS  2.
               05  WRK-CYOJKSN-KAISHIDAY-YYY    PIC X(08).
               05  WRK-CYOJKSN-INPUTCOMENT-YYY  PIC X(140).
               05  WRK-CYOJKSN-NAME-YYY         PIC X(140).
      *
           03  WRK-SRYACCT-PATHNAME             PIC X(64).
      *
           03  WRK-ZAIHANKO-FSANTEIYMD          PIC X(08).
      *
           03  WRK-CHECK-SRYCD                  PIC X(09).
           03  WRK-TENSU-SRYCD                  PIC X(09).
           03  WRK-TENSU-SRYYM                  PIC X(06).
      *
           03  WRK-SJIYMD                       PIC X(08).
      *
           03  WRK-JINNAI-YMD                   PIC X(08).
      *
           03  WRK-HAIJSK-FSANTEIYM             PIC X(08).
           03  WRK-HAIJSK-KAISU                 PIC 9(02).
      *
           03  WRK-RCW-KBN                      PIC X(01).
           03  WRK-RCW-SRYCD                    PIC X(09).
           03  WRK-RCW-SRYYMD                   PIC X(08).
      *
           03  WRK-YOUATU-FSANTEIYMD            PIC X(08).
      *
           03  WRK-KOUYAK-FSANTEIYMD            PIC X(08).
      *
           03  WRK-TEJHOU-YMD                   PIC X(08).
      *
       01  WRK-ERR-AREA.
           03  WRK-RECEERR             PIC X(200).
           03  WRK-ERRMSG              PIC X(300).
           03  WRK-MCP-RC              PIC 9(9).
           03  WRK-ERR-FILE-STS        PIC X(02).
           03  WRK-ERR-FILE-MSG        PIC X(100).
           03  WRK-ERR-FILE-MSG1       PIC X(17).
           03  WRK-ERR-FLG             PIC 9(01).
      *    エラーファイル名称領域 
           COPY    "CPRECEDAT1.INC"    REPLACING  //RECEDAT1PARA//
                                       BY         //WRK-ERR-FILE-NM//.
      *    FULLNAME内のBASENAME開始位置
       01  WRK-SGETTEMP-ST         PIC 9(05).
      *
       01  WRK-RECE84-REC. 
           COPY    "CPRCF084.INC"  REPLACING   //RECE84//
                                   BY          //WRK-RECE84//.
      *
       01  WRK-RECE85-REC. 
           COPY    "CPRCF085.INC"  REPLACING   //RECE85//
                                   BY          //WRK-RECE85//.
      *
       01  WRK-RECE85XX-REC.
         02 WRK-RECE85XX-TBL       OCCURS 100.
           COPY    "CPRCF085.INC"  REPLACING   //RECE85//
                                   BY          //WRK-RECE85XX//.
      *
       01  WRK-RECE85XX2-REC.
         02 WRK-RECE85XX2-TBL      OCCURS 300.
           COPY    "CPRCF085.INC"  REPLACING   //RECE85//
                                   BY          //WRK-RECE85XX2//.
      *
       01  WRK-RECE85ZZ-REC.
         02 WRK-RECE85ZZ-TBL       OCCURS 100.
           COPY    "CPRCF085.INC"  REPLACING   //RECE85//
                                   BY          //WRK-RECE85ZZ//.
      *
       01  WRK-FREE-AREA.
           03  WRK-FREEINF                     OCCURS 49.         
               05  WK-FREE-YUKOKETA          PIC  9(03).
               05  WK-FREE-NAME              PIC  X(300).
      *
       01  WRK-FREE-AREA2.                                              
           03  WRK-FREEINF2                    OCCURS 50.               
               05  WK-FREE-SRYCD2            PIC  X(09).
               05  WK-FREE-YUKOKETA2         PIC  9(03).                
               05  WK-FREE-NAME2             PIC  X(300).               
               05  WK-FREE-INPUTCOMENT2      PIC  X(140).
               05  WK-FREE-MEISKYFLG2        PIC  X(01).
               05  WK-FREE-SETCOMATFLG2      PIC  9(03).
               05  WK-FREE-RECEDENFLG2       PIC  X(01).
      *
       01  WRK-FREE-AREA3.
           03  WRK-FREEINF3.
               05  WK-FREE-NAME3             PIC  X(1000).
               05  WK-FREE-NAME3-TAIHI       PIC  X(1000).
      *
       01  WRK-JIDO-SETCOM-AREA.                                              
           03  WRK-JIDO-SETCOMATFLG          PIC  9(03).
           03  WRK-JIDO-SETCOMFLG            PIC  X(01).
           03  WRK-JIDO-JYOUGEFLG            PIC  9(01).
           03  WRK-JIDO-RECEDENFLG           PIC  X(01).
      *
       01  WRK-RECECOM-AREA.                                              
           03  WRK-RECECOM-KBN               PIC  X(01).
           03  WRK-RECECOM-SRYCD             PIC  X(09).
           03  WRK-RECECOM-YMD               PIC  X(08).
           03  WRK-RECECOM-COMMENT           PIC  X(100).
           03  WRK-RECECOM-NUM               PIC  S9(05)V9(06).
           03  WRK-RECECOM-SRYYMD            PIC  X(08).
      *
      *    日付全角変換領域
       01  TBL-DAY-AREA.
           03  FILLER              PIC X(04)  VALUE "　１".
           03  FILLER              PIC X(04)  VALUE "　２".
           03  FILLER              PIC X(04)  VALUE "　３".
           03  FILLER              PIC X(04)  VALUE "　４".
           03  FILLER              PIC X(04)  VALUE "　５".
           03  FILLER              PIC X(04)  VALUE "　６".
           03  FILLER              PIC X(04)  VALUE "　７".
           03  FILLER              PIC X(04)  VALUE "　８".
           03  FILLER              PIC X(04)  VALUE "　９".
           03  FILLER              PIC X(04)  VALUE "１０".
           03  FILLER              PIC X(04)  VALUE "１１".
           03  FILLER              PIC X(04)  VALUE "１２".
           03  FILLER              PIC X(04)  VALUE "１３".
           03  FILLER              PIC X(04)  VALUE "１４".
           03  FILLER              PIC X(04)  VALUE "１５".
           03  FILLER              PIC X(04)  VALUE "１６".
           03  FILLER              PIC X(04)  VALUE "１７".
           03  FILLER              PIC X(04)  VALUE "１８".
           03  FILLER              PIC X(04)  VALUE "１９".
           03  FILLER              PIC X(04)  VALUE "２０".
           03  FILLER              PIC X(04)  VALUE "２１".
           03  FILLER              PIC X(04)  VALUE "２２".
           03  FILLER              PIC X(04)  VALUE "２３".
           03  FILLER              PIC X(04)  VALUE "２４".
           03  FILLER              PIC X(04)  VALUE "２５".
           03  FILLER              PIC X(04)  VALUE "２６".
           03  FILLER              PIC X(04)  VALUE "２７".
           03  FILLER              PIC X(04)  VALUE "２８".
           03  FILLER              PIC X(04)  VALUE "２９".
           03  FILLER              PIC X(04)  VALUE "３０".
           03  FILLER              PIC X(04)  VALUE "３１".
       01  TBL-DAY-AREA-R          REDEFINES   TBL-DAY-AREA.
           03  TBL-DAY             PIC X(04)   OCCURS   31.
      *
       01  MAX-MEISAISU            PIC 9(07).
      *
      *    固定値
       01  CONST-AREA.
      *    薬剤管理指導料
           03  CONS-YAKUKAN-COMMENT  PIC X(09) VALUE "120001610".
      *    算定日コメント
           03  CONS-SANTEI-COMMENT1  PIC X(09) VALUE "840000058".
           03  CONS-SANTEI-COMMENT2  PIC X(09) VALUE "840000065".
      *    在宅血液透析指導管理料
           03  CONS-TOSEKI           PIC X(09) VALUE "114009310".
      *    脳血管疾患急性発症日
           03  CONS-KYUSEI           PIC X(09) VALUE "099800101".
      *    心大リハ開始日
           03  CONS-SINDAI          PIC X(09) VALUE "099800111".
      *    呼吸器リハ開始日
           03  CONS-KOKYUKI         PIC X(09) VALUE "099800141".
      *    脳血管疾患等リハ開始日
           03  CONS-NOUKE           PIC X(09) VALUE "099800121".
      *    運動器リハ開始日
           03  CONS-UNDOKI          PIC X(09) VALUE "099800131".
      *    難病患者リハ開始日
           03  CONS-NANBYO          PIC X(09) VALUE "099800161".
      *    障害児（者）リハ開始日
           03  CONS-SYOGAI          PIC X(09) VALUE "099800171".
      *    摂食療法開始日
           03  CONS-SESSYOKU        PIC X(09) VALUE "099800151".
      *    廃用症候群リハ開始日
           03  CONS-HAIYO           PIC X(09) VALUE "099800191".
      *
      *    心大リハ終了日
           03  CONS-SINDAI-E        PIC X(09) VALUE "099800112".
      *    呼吸器リハ終了日
           03  CONS-KOKYUKI-E       PIC X(09) VALUE "099800142".
      *    脳血管疾患等リハ終了日
           03  CONS-NOUKE-E         PIC X(09) VALUE "099800122".
      *    運動器リハ終了日
           03  CONS-UNDOKI-E        PIC X(09) VALUE "099800132".
      *    難病患者リハ終了日
           03  CONS-NANBYO-E        PIC X(09) VALUE "099800162".
      *    障害児（者）リハ終了日
           03  CONS-SYOGAI-E        PIC X(09) VALUE "099800172".
      *    摂食療法終了日
           03  CONS-SESSYOKU-E      PIC X(09) VALUE "099800152".
      *    廃用症候群リハ開始日
           03  CONS-HAIYO-E         PIC X(09) VALUE "099800192".
      *
      *    心大リハ加算開始日
           03  CONS-SINDAI-K        PIC X(09) VALUE "099800211".
      *    呼吸器リハ加算開始日
           03  CONS-KOKYUKI-K       PIC X(09) VALUE "099800241".
      *    廃用症候群リハ加算開始日
           03  CONS-HAIYO-K         PIC X(09) VALUE "099800291".
      *
      *    心大血管疾患リハビリテーション医学管理料（１）
           03  CONS-SINDAI-IGAKU1   PIC X(09) VALUE "180029910".
      *    心大血管疾患リハビリテーション医学管理料（２）
           03  CONS-SINDAI-IGAKU2   PIC X(09) VALUE "180030010".
      *    呼吸器リハビリテーション医学管理料（１）
           03  CONS-KOKYUKI-IGAKU1  PIC X(09) VALUE "180030510".
      *    呼吸器リハビリテーション医学管理料（２）
           03  CONS-KOKYUKI-IGAKU2  PIC X(09) VALUE "180030610".
      *    脳血管疾患等リハビリテーション医学管理料（１）
           03  CONS-NOUKE-IGAKU1    PIC X(09) VALUE "180030110".
      *    脳血管疾患等リハビリテーション医学管理料（２）
           03  CONS-NOUKE-IGAKU2    PIC X(09) VALUE "180030210".
      *    運動器リハビリテーション医学管理料（１）
           03  CONS-UNDOKI-IGAKU1   PIC X(09) VALUE "180030310".
      *    運動器リハビリテーション医学管理料（２）
           03  CONS-UNDOKI-IGAKU2   PIC X(09) VALUE "180030410".
      *
      *    心大血管疾患リハ実施
           03  CONS-SINDAI-DUMMY    PIC X(09) VALUE "099800311".
      *    呼吸器リハ実施
           03  CONS-KOKYUKI-DUMMY   PIC X(09) VALUE "099800341".
      *    脳血管疾患リハ実施
           03  CONS-NOUKE-DUMMY     PIC X(09) VALUE "099800321".
      *    運動器リハ実施
           03  CONS-UNDOKI-DUMMY    PIC X(09) VALUE "099800331".
      *
      *    介護支援連携指導料
           03  CONS-KAISIEN         PIC X(09) VALUE "113011710".
      *
      *    介護職員等喀痰吸引等指示料
           03  CONS-KAISYOKU        PIC X(09) VALUE "114020910".
      *
      *    救急医療管理加算
           03  CONS-KYUKYU          PIC X(09) VALUE "101110020".
           03  CONS-KYUKYU2         PIC X(09) VALUE "101800880".
      *
      *    心臓ペースメーカー指導管理料（着用型自動除細動器）
           03  CONS-SINPESUR1       PIC X(09) VALUE "113015010".
      *    心臓ペースメーカー指導管理料（ロ・植込型除細動器移行期加算含む）
           03  CONS-SINPESUR2       PIC X(09) VALUE "113015130".
      *
      *    がん患者指導管理料（心理的不安軽減のため面接）
           03  CONS-GANSIDO1        PIC X(09) VALUE "113015310".
      *    がん患者指導管理料（抗悪性腫瘍剤の必要等文書説明）
           03  CONS-GANSIDO2        PIC X(09) VALUE "113015410".
      *    がん患者指導管理料（心理的不安軽減のため面接・情報通信機器）
           03  CONS-GANSIDO3        PIC X(09) VALUE "113035410".
      *    がん患者指導管理料（抗悪性腫瘍剤の必要性文書説明・情報通信機器）
           03  CONS-GANSIDO4        PIC X(09) VALUE "113035510".
      *
      *    在宅患者共同診療料開始日
           03  CONS-ZAIKYO          PIC X(09) VALUE "099140004".
      *
      *    磁気による膀胱等刺激法開始日
           03  CONS-BOKOHO1         PIC X(09) VALUE "099400001".
      *    磁気による膀胱等刺激法
           03  CONS-BOKOHO2         PIC X(09) VALUE "140055110".
      *
      *    排尿自立指導料
           03  CONS-HAIJRT          PIC X(09) VALUE "113022810".
      *
      *    在宅酸素療法指導管理料（その他）
           03  CONS-ZAISAN          PIC X(09) VALUE "114003710".
      *    在宅酸素療法指導管理料（その他）（特例）
           03  CONS-ZAISAN2         PIC X(09) VALUE "114055550".
      *    在宅持続陽圧呼吸療法指導管理料１
           03  CONS-YOUATU1         PIC X(09) VALUE "114040710".
      *    在宅持続陽圧呼吸療法指導管理料２
           03  CONS-YOUATU2         PIC X(09) VALUE "114040810".
      *    在宅持続陽圧呼吸療法指導管理料
           03  CONS-YOUATU3         PIC X(09) VALUE "114009710".
      *
      *    在宅半固形栄養経管栄養法指導管理料
           03  CONS-ZAIHANKO        PIC X(09) VALUE "114045510".
      *
      *    高気圧酸素治療（減圧症又は空気塞栓）
           03  CONS-KIATU           PIC X(09) VALUE "140057510".
      *    高気圧酸素治療（その他のもの）
           03  CONS-KIATU2          PIC X(09) VALUE "140057610".
      *    高気圧酸素治療開始日
           03  CONS-KIATU3          PIC X(09) VALUE "099400002".
      *
      *    精神科ＳＣ疾患別等専門プログラム加算開始日
           03  CONS-SCPRO           PIC X(09) VALUE "099830104".
      *
      *    経頭蓋磁気刺激療法開始日
           03  CONS-JIKSGK          PIC X(09) VALUE "099830106".
      *    経頭蓋磁気刺激療法終了日
           03  CONS-JIKSGK-E        PIC X(09) VALUE "099830107".
      *
      *    心不全に対する遠赤外線温熱療法開始日
           03  CONS-ONNETU          PIC X(09) VALUE "099400003".
      *
      *    人工内耳機器調整加算（６歳未満）
           03  CONS-JINNAI1         PIC X(09) VALUE "113030670".
      *    人工内耳機器調整加算（６歳以上）
           03  CONS-JINNAI2         PIC X(09) VALUE "113030770".
      *
      *    精神科デイ・ケア等開始日
           03  CONS-SEIKEA          PIC X(09) VALUE "099830108".
      *
      *    在宅抗菌薬吸入療法用ネブライザ加算（１月目）
           03  CONS-KOUYAK          PIC X(09) VALUE "114051750".
      *    手順書加算（訪問看護指示料）
           03  CONS-TEJHOU          PIC X(09) VALUE "114061070".
      *
      *    在宅患者共同診療料テーブル
       01  TBL-ZAIKYO-CHECK-AREA.
           03  FILLER          PIC X(09)   VALUE    "114027610".
           03  FILLER          PIC X(09)   VALUE    "114027710".
           03  FILLER          PIC X(09)   VALUE    "114027810".
           03  FILLER          PIC X(09)   VALUE    "114027910".
      *
       01  TBL-ZAIKYO-CHECK-R  REDEFINES   TBL-ZAIKYO-CHECK-AREA.
           03  TBL-ZAIKYO-CHECK     PIC X(09)   OCCURS    4.
      *
       01  TBL-ZAIKYO-CHECK-MAX     PIC 9(02)   VALUE     4.
      *
      *    超重症児（者）入院診療加算テーブル
       01  TBL-CYOJKSN-CHECK-XXX-AREA.
           03  FILLER          PIC X(09)   VALUE    "190127510".
           03  FILLER          PIC X(09)   VALUE    "190076570".
      *
       01  TBL-CYOJKSN-CHECK-XXX-R
                               REDEFINES  TBL-CYOJKSN-CHECK-XXX-AREA.
           03  TBL-CYOJKSN-CHECK-XXX  PIC X(09)   OCCURS    2.
      *
       01  TBL-CYOJKSN-CHECK-XXX-MAX  PIC 9(02)   VALUE     2.
      *
      *    準超重症児（者）入院診療加算テーブル
       01  TBL-CYOJKSN-CHECK-YYY-AREA.
           03  FILLER          PIC X(09)   VALUE    "190127610".
           03  FILLER          PIC X(09)   VALUE    "190076670".
      *
       01  TBL-CYOJKSN-CHECK-YYY-R
                               REDEFINES  TBL-CYOJKSN-CHECK-YYY-AREA.
           03  TBL-CYOJKSN-CHECK-YYY  PIC X(09)   OCCURS    2.
      *
       01  TBL-CYOJKSN-CHECK-YYY-MAX  PIC 9(02)   VALUE     2.
      *
      *    薬剤管理指導料テーブル（２００８年４月診療分以降）
       01  TBL-YAKUKAN-AREA.
           03  FILLER               PIC X(09) VALUE "113010710".
           03  FILLER               PIC X(09) VALUE "113010810".
           03  FILLER               PIC X(09) VALUE "120001610".
      *
       01  TBL-YAKUKAN-R       REDEFINES   TBL-YAKUKAN-AREA.
            03  TBL-YAKUKAN    PIC X(09)   OCCURS   3.
      *
       01  TBL-YAKUKAN-MAX     PIC 9(02)   VALUE    3.
      *
      *
       01  TBL-HASSYO-INF.
           03  TBL-HASSYO-KAITATU-COMMENT   PIC 9(01).
           03  TBL-HASSYO-SINDAI-COMMENT    PIC 9(01).
           03  TBL-HASSYO-KOKYUKI-COMMENT   PIC 9(01).
           03  TBL-HASSYO-NOUKE-COMMENT     PIC 9(01).
           03  TBL-HASSYO-UNDOKI-COMMENT    PIC 9(01).
           03  TBL-HASSYO-NANBYO-COMMENT    PIC 9(01).
           03  TBL-HASSYO-SYOGAI-COMMENT    PIC 9(01).
           03  TBL-HASSYO-SESSYOKU-COMMENT  PIC 9(01).
           03  TBL-HASSYO-HAIYO-COMMENT     PIC 9(01).
      *
           03  TBL-HASSYO-SINDAI-DAY-T.
               05  TBL-HASSYO-SINDAI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-SINDAI-SANTEI   PIC 9(01).
           03  TBL-HASSYO-KOKYUKI-DAY-T.
               05  TBL-HASSYO-KOKYUKI-DAY-OCC     OCCURS  31.
                   07  TBL-HASSYO-KOKYUKI-SANTEI  PIC 9(01).
           03  TBL-HASSYO-NOUKE-DAY-T.
               05  TBL-HASSYO-NOUKE-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO-NOUKE-SANTEI    PIC 9(01).
           03  TBL-HASSYO-UNDOKI-DAY-T.
               05  TBL-HASSYO-UNDOKI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-UNDOKI-SANTEI   PIC 9(01).
           03  TBL-HASSYO-NANBYO-DAY-T.
               05  TBL-HASSYO-NANBYO-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-NANBYO-SANTEI   PIC 9(01).
           03  TBL-HASSYO-SYOGAI-DAY-T.
               05  TBL-HASSYO-SYOGAI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO-SYOGAI-SANTEI   PIC 9(01).
           03  TBL-HASSYO-SESSYOKU-DAY-T.
               05  TBL-HASSYO-SESSYOKU-DAY-OCC    OCCURS  31.
                   07  TBL-HASSYO-SESSYOKU-SANTEI PIC 9(01).
           03  TBL-HASSYO-HAIYO-DAY-T.
               05  TBL-HASSYO-HAIYO-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO-HAIYO-SANTEI    PIC 9(01).
           03  TBL-HASSYO-TAIHI-DAY-T.
               05  TBL-HASSYO-TAIHI-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO-TAIHI-SANTEI    PIC 9(01).
      *
           03  TBL-HASSYO-TAIHIYMD1-DAY-T.
               05  TBL-HASSYO-TAIHIYMD1-FLG       PIC 9(01).
               05  TBL-HASSYO-TAIHIYMD1-DAY-OCC1.
                   07  TBL-HASSYO-TAIHIYMD11      PIC X(08) OCCURS  2.
               05  TBL-HASSYO-TAIHIYMD1-DAY-OCC2.
                   07  TBL-HASSYO-TAIHIYMD12      PIC 9(01) OCCURS 31.
      *
      *****（リハ加算用）
       01  TBL-HASSYO9-INF.
           03  TBL-HASSYO9-SINDAI-COMMENT    PIC 9(01).
           03  TBL-HASSYO9-KOKYUKI-COMMENT   PIC 9(01).
           03  TBL-HASSYO9-HAIYO-COMMENT     PIC 9(01).
      *
           03  TBL-HASSYO9-SINDAI-DAY-T.
               05  TBL-HASSYO9-SINDAI-DAY-OCC      OCCURS  31.
                   07  TBL-HASSYO9-SINDAI-SANTEI   PIC 9(01).
           03  TBL-HASSYO9-KOKYUKI-DAY-T.
               05  TBL-HASSYO9-KOKYUKI-DAY-OCC     OCCURS  31.
                   07  TBL-HASSYO9-KOKYUKI-SANTEI  PIC 9(01).
           03  TBL-HASSYO9-HAIYO-DAY-T.
               05  TBL-HASSYO9-HAIYO-DAY-OCC       OCCURS  31.
                   07  TBL-HASSYO9-HAIYO-SANTEI    PIC 9(01).
      *****
      *
       01  TBL-ZAISIEN-INF.
           03  TBL-ZAISIEN-COMMENT          PIC 9(01).
      *
      *    酸素（金額・数量）情報
       01  TBL-SANSO-INF.
           03  TBL-SANSO-INF2       OCCURS    10.
               05  TBL-SANSO-TEN          PIC 9(09)V9(02).
               05  TBL-SANSO-SRYSURYO     PIC 9(05)V9(05).
           03  TBL-SANSO-INF3.
               05  TBL-KASAN-SRYSURYO     PIC 9(05)V9(05).
      *
      *    療養レセコメント情報
       01  TBL-RYOCOM-INF.
           03  TBL-RYOCOM-INF2                 OCCURS  31.
               05  TBL-RYOCOM-NYUINKBN         PIC  X(01).
               05  TBL-RYOCOM-AREA.
                 06  TBL-RYOCOM-MEISAISU       PIC  9(03).
                 06  TBL-RYOCOM-SRYCDTOTAL     PIC  9(14).
                 06  TBL-RYOCOM-INF3           OCCURS  30.
                   07  TBL-RYOCOM-IRYO-SRYCD   PIC  X(09).
                 06  TBL-RYOCOM-ADL-SRYCD      PIC  X(09).
                 06  TBL-RYOCOM-ADL-TEN        PIC  9(02).
                 06  TBL-RYOCOM-ADL-TEN-MOJI   PIC  X(04).
                 06  TBL-RYOCOM-INF4           OCCURS   4.
                   07  TBL-RYOCOM-ADL-SRYCD-H22      PIC  X(09).
                   07  TBL-RYOCOM-ADL-TEN-H22        PIC  9(02).
                   07  TBL-RYOCOM-ADL-TEN-MOJI-H22   PIC  X(04).
      *
      *    療養レセコメント情報（該当分のまとめ）
       01  TBL-RYOCOM2-INF.
           03  TBL-RYOCOM2-INF2                OCCURS  31.
               05  TBL-RYOCOM2-AREA.
                 06  TBL-RYOCOM2-MEISAISU      PIC  9(03).
                 06  TBL-RYOCOM2-SRYCDTOTAL    PIC  9(14).
                 06  TBL-RYOCOM2-INF3          OCCURS  30.
                   07  TBL-RYOCOM2-IRYO-SRYCD  PIC  X(09).
                 06  TBL-RYOCOM2-ADL-SRYCD     PIC  X(09).
                 06  TBL-RYOCOM2-ADL-TEN       PIC  9(02).
                 06  TBL-RYOCOM2-ADL-TEN-MOJI  PIC  X(04).
                 06  TBL-RYOCOM2-INF4          OCCURS   4.
                   07  TBL-RYOCOM2-ADL-SRYCD-H22     PIC  X(09).
                   07  TBL-RYOCOM2-ADL-TEN-H22       PIC  9(02).
                   07  TBL-RYOCOM2-ADL-TEN-MOJI-H22  PIC  X(04).
               05  TBL-RYOCOM2-INF5            OCCURS  31.
                 06  TBL-RYOCOM2-DAY           PIC  9(01).
      *
       01  TBL-CYOJKSN-INF.
           03  TBL-CYOJKSN-INF2.
               05  TBL-CYOJKSN-X               PIC  9(01).
               05  TBL-CYOJKSN-Y               PIC  9(01).
       01  TBL-CYOJKSN2-INF.
           03  TBL-CYOJKSN2-INF2.
             04  TBL-CYOJKSN2-INF3             OCCURS 10.
               05  TBL-CYOJKSN2-X-TAIHIYMD     PIC  X(140).
               05  TBL-CYOJKSN2-Y-TAIHIYMD     PIC  X(140).
      *
      *    画像診断の部位コード編集用
       01  TBL-GAZO-INF.
           03  TBL-GAZO-INF2                   OCCURS 10.
             05  TBL-GAZO-CHEKFLG              PIC  9(02).
      *
      *    酸素
           COPY    "CMSANSOTBL.INC".
      *
           COPY    "MCPAREA".
      *
           COPY    "COMMON-SPA".
      *
      *****************************************************************
      *    ファイルレイアウト
      *****************************************************************
      *
      *    ジョブ管理マスタ
       01  JOBKANRI-REC.
           COPY    "CPJOBKANRI.INC".
      *
      *    診療会計
       01  SRYACCT-REC.
           COPY    "CPSRYACCT.INC".
      *
      *    診療行為
       01  SRYACT-REC.
           COPY    "CPSRYACT.INC".
      *
      *    算定履歴
       01  SANTEI-REC.
           COPY    "CPSANTEI.INC".
      *
      *    患者コメント
       01  PTCOM-REC.
           COPY    "CPPTCOM.INC".
      *
      *    点数
           COPY    "CPTENSU.INC".
      *
      *    診療科目情報
           COPY    "CPSK1005.INC".
      *
      *    算定履歴付加
       01  SANTEIPLUS-REC.
           COPY    "CPSANTEIPLUS.INC".
      *
      *    入院履歴
       01  PTNYUINRRK-REC.
           COPY    "CPPTNYUINRRK.INC".
      *
      *    レセプト記載
       01  RKISAI-REC.
           COPY    "CPRECEKISAI.INC".
      *
      *****************************************************************
      *    サブプロ用領域
      *****************************************************************
      *   ジョブ管理ＤＢ制御サブ
           COPY    "CPORCSJOBKANRI.INC".
      *     
      *    数値変換サブ
           COPY    "CPORCSNUM.INC".
      *
      *    全角チェックパラメタ
           COPY    "CPORCSKANACHK.INC".
      *
      *    療養レセコメント取得サブ
           COPY    "CPORCSRYOCOM.INC".
      *
           COPY    "CPORCSGETTEMP.INC".
      *
      *    オンライン診療料等に関わる算定履歴チェックサブ
           COPY    "CPORCSRECESRCHK.INC".
      *
      *    レセプト自動記載コメント編集サブ
           COPY    "CPORCSRECECOMMENT.INC".
      *
      *    日付変換サブ
           COPY    "CPORCSDAY.INC".
           COPY    "CPORCSLNK.INC".
      *
      *    ＤＢ検索
           COPY    "MCPDATA.INC".
      *
      ****************************************************************
       LINKAGE                 SECTION.
       01  COMMAND-PARAM.
           02  FILLER      PIC X(256).
      ****************************************************************
       PROCEDURE           DIVISION
               USING
           COMMAND-PARAM.
      *
      *****************************************************************
      *    主　　処理
      *****************************************************************
       000-PROC-SEC                SECTION.
      *
           PERFORM 100-INIT-SEC
      *
           PERFORM 200-MAIN-SEC
                   UNTIL   FLG-END  =  1
      *
           PERFORM 300-END-SEC
      *
           STOP    RUN
           .
      *****************************************************************
      *    初期　処理
      *****************************************************************
       100-INIT-SEC                SECTION.
      *
           INITIALIZE                  FLG-AREA
           INITIALIZE                  STS-AREA
           INITIALIZE                  WRK-AREA
           INITIALIZE                  CNT-AREA
           INITIALIZE                  SPA-AREA
           INITIALIZE                  RECEERR
      *
           UNSTRING    COMMAND-PARAM   DELIMITED  BY  ","
                                       INTO    WRK-PARA
                                               WRK-PARA-JIBAIPRTKBN
                                               WRK-PARA-HOSPNUM
                                               RECEERR
           END-UNSTRING
           MOVE    WRK-PARA-HOSPNUM    TO  SPA-HOSPNUM
      *
      *    ファイルＯＰＥＮ処理
      *
           PERFORM 110-FILE-OPEN-SEC
      *
           PERFORM 120-DBOPEN-SEC
      *
      *    ステップ管理開始処理
           MOVE    "STS"               TO  SJOBKANRI-MODE
           INITIALIZE                      JOBKANRI-REC
           MOVE    "ORCR0981"          TO  JOB-PGID
           MOVE    "コメント編集（労災・自賠責）（レセ電用）"
                                       TO  JOB-SHELLMSG
           PERFORM 900-CALL-ORCSJOB-SEC
      *
           PERFORM 990-RECE82-READ-SEC
           .
       100-INIT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイルＯＰＥＮ処理
      *****************************************************************
       110-FILE-OPEN-SEC          SECTION.
      *
           MOVE    "RECE820"           TO  RECE82PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE82PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE82PARA-HOSPNUM
      *
           MOVE    "RECE84E"           TO  RECE84PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE84PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE84PARA-HOSPNUM
      *
           MOVE    "RECE85C"           TO  RECE85PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE85PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE85PARA-HOSPNUM
      *
           MOVE    "RECE84F"           TO  RECE841PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE841PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE841PARA-HOSPNUM
      *
           MOVE    "RECE85F"           TO  RECE851PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE851PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE851PARA-HOSPNUM
      *
           MOVE    "RECE84G"           TO  RECE849PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE849PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE849PARA-HOSPNUM
      *
           MOVE    "RECE85G"           TO  RECE859PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE859PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE859PARA-HOSPNUM
      *
           MOVE    "RECE856"           TO  RECE855PARA-FILE-ID
           MOVE    WRK-PARA-TERMID     TO  RECE855PARA-TERMID
           MOVE    WRK-PARA-HOSPNUM    TO  RECE855PARA-HOSPNUM
      *
           INITIALIZE                      SGETTEMP-AREA
           MOVE    RECEERR             TO  SGETTEMP-BASENAMES  (1)
           MOVE    RECE82PARA-BASENAME TO  SGETTEMP-BASENAMES  (2)
           MOVE    RECE84PARA-BASENAME TO  SGETTEMP-BASENAMES  (3)
           MOVE    RECE85PARA-BASENAME TO  SGETTEMP-BASENAMES  (4)
           MOVE    RECE841PARA-BASENAME
                                       TO  SGETTEMP-BASENAMES  (5)
           MOVE    RECE851PARA-BASENAME
                                       TO  SGETTEMP-BASENAMES  (6)
           MOVE    RECE849PARA-BASENAME
                                       TO  SGETTEMP-BASENAMES  (7)
           MOVE    RECE859PARA-BASENAME
                                       TO  SGETTEMP-BASENAMES  (8)
           MOVE    RECE855PARA-BASENAME
                                       TO  SGETTEMP-BASENAMES  (9)
           CALL    "ORCSGETTEMP"       USING   SGETTEMP-AREA
           MOVE    SGETTEMP-FULLNAMES (1)
                                       TO  RECEERR
           MOVE    SGETTEMP-FULLNAMES (2)
                                       TO  RECE82PARA
           MOVE    SGETTEMP-FULLNAMES (3)
                                       TO  RECE84PARA
           MOVE    SGETTEMP-FULLNAMES (4)
                                       TO  RECE85PARA
           MOVE    SGETTEMP-FULLNAMES (5)
                                       TO  RECE841PARA
           MOVE    SGETTEMP-FULLNAMES (6)
                                       TO  RECE851PARA
           MOVE    SGETTEMP-FULLNAMES (7)
                                       TO  RECE849PARA
           MOVE    SGETTEMP-FULLNAMES (8)
                                       TO  RECE859PARA
           MOVE    SGETTEMP-FULLNAMES (9)
                                       TO  RECE855PARA
      *
           MOVE   SGETTEMP-ST          TO  WRK-SGETTEMP-ST
      *
           OPEN    INPUT               RECE82-FILE
           IF      STS-RECE82          =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
               MOVE    1                   TO  WRK-ERR-FLG
               MOVE    RECE82PARA          TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE82          TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           OPEN    INPUT               RECE84-FILE
           IF      STS-RECE84          =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
               MOVE    1                   TO  WRK-ERR-FLG
               MOVE    RECE84PARA          TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE84          TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           OPEN    INPUT               RECE85-FILE
           IF      STS-RECE85          =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
               MOVE    1                   TO  WRK-ERR-FLG
               MOVE    RECE85PARA          TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE85          TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           OPEN    OUTPUT              RECE841-FILE
           CLOSE                       RECE841-FILE
      *
           OPEN    OUTPUT              RECE851-FILE
           CLOSE                       RECE851-FILE
      *
           OPEN    OUTPUT              RECE849-FILE
           CLOSE                       RECE849-FILE
      *
           OPEN    OUTPUT              RECE859-FILE
           CLOSE                       RECE859-FILE
      *
           OPEN    OUTPUT              RECE855-FILE
           CLOSE                       RECE855-FILE
      *
           OPEN    I-O                 RECE841-FILE
           OPEN    I-O                 RECE849-FILE
      *
           OPEN    I-O                 RECE851-FILE
           OPEN    I-O                 RECE859-FILE
      *
           OPEN    OUTPUT              RECE855-FILE
      *
           .
       110-FILE-OPEN-EXT.
           EXIT.
      *
      *****************************************************************
      *    主処理
      *****************************************************************
       200-MAIN-SEC                SECTION.
      *
           INITIALIZE                        TBL-HASSYO-INF
           INITIALIZE                        TBL-HASSYO9-INF
           INITIALIZE                        TBL-ZAISIEN-INF
           INITIALIZE                        TBL-RYOCOM-INF
           INITIALIZE                        TBL-CYOJKSN-INF
           INITIALIZE                        TBL-CYOJKSN2-INF
           INITIALIZE                        WRK-JIDO-SETCOM-AREA
      *
      *    療養レセコメント取得
      *
           MOVE      ZERO     TO      FLG-RYOCOM
      *
           IF    RECE82-SRYYM   >=  "200610"
           AND   RECE82-SRYYM   <=  "201803"
             INITIALIZE                   ORCSRYOCOM-AREA
             MOVE    RECE82-HOSPNUM   TO  LNK-RYOCOM-HOSPNUM
             MOVE    RECE82-PTID      TO  LNK-RYOCOM-PTID
             MOVE    RECE82-SRYYM     TO  LNK-RYOCOM-SANTEIYM
             CALL    "ORCSRYOCOM"         USING
                                          ORCSRYOCOM-AREA
                                          SPA-AREA
             IF      LNK-RYOCOM-RC    =   ZERO
               MOVE       1           TO  FLG-RYOCOM
               PERFORM  VARYING  RYO-IDX  FROM  1  BY  1
                         UNTIL   RYO-IDX   >   31
                 MOVE  LNK-RYOCOM-NYUINKBN(RYO-IDX)
                                 TO  TBL-RYOCOM-NYUINKBN(RYO-IDX)
                 MOVE  LNK-RYOCOM-MEISAISU(RYO-IDX)
                                 TO  TBL-RYOCOM-MEISAISU(RYO-IDX)
                 MOVE  LNK-RYOCOM-SRYCDTOTAL(RYO-IDX)
                                 TO  TBL-RYOCOM-SRYCDTOTAL(RYO-IDX)
                 PERFORM  VARYING  RYO-IDX2  FROM  1  BY  1
                           UNTIL   RYO-IDX2   >   30
                   MOVE  LNK-RYOCOM-IRYO-SRYCD(RYO-IDX RYO-IDX2)
                           TO  TBL-RYOCOM-IRYO-SRYCD(RYO-IDX RYO-IDX2)
                 END-PERFORM
                 MOVE  LNK-RYOCOM-ADL-SRYCD(RYO-IDX)
                                 TO  TBL-RYOCOM-ADL-SRYCD(RYO-IDX)
                 MOVE  LNK-RYOCOM-ADL-TEN(RYO-IDX)
                                 TO  TBL-RYOCOM-ADL-TEN(RYO-IDX)
                 MOVE  LNK-RYOCOM-ADL-TEN-MOJI(RYO-IDX)
                                 TO  TBL-RYOCOM-ADL-TEN-MOJI(RYO-IDX)
                 PERFORM  VARYING  RYO-IDX2  FROM  1  BY  1
                           UNTIL   RYO-IDX2   >    4
                   MOVE  LNK-RYOCOM-ADL-SRYCD-H22(RYO-IDX RYO-IDX2)
                      TO  TBL-RYOCOM-ADL-SRYCD-H22(RYO-IDX RYO-IDX2)
                   MOVE  LNK-RYOCOM-ADL-TEN-H22(RYO-IDX RYO-IDX2)
                      TO  TBL-RYOCOM-ADL-TEN-H22(RYO-IDX RYO-IDX2)
                   MOVE  LNK-RYOCOM-ADL-TEN-MOJI-H22(RYO-IDX RYO-IDX2)
                      TO  TBL-RYOCOM-ADL-TEN-MOJI-H22(RYO-IDX RYO-IDX2)
                 END-PERFORM
               END-PERFORM
             END-IF
           END-IF
      *
           MOVE  ZERO        TO    CNT-KENSA
           IF   RECE82-KENSA-BNPFLG     =   1
                 ADD    1    TO    CNT-KENSA
           END-IF
           IF   RECE82-KENSA-NTPROFLG   =   1
                 ADD    1    TO    CNT-KENSA
           END-IF
           IF   RECE82-KENSA-ANPFLG     =   1
                 ADD    1    TO    CNT-KENSA
           END-IF
      *
           IF   RECE82-COMCNTFLG   =   "1"
             PERFORM 800-RECE82-SET84-SEC
             MOVE    ZERO                TO  RECE84-ZAINUM
      *
             START   RECE84-FILE
                 KEY IS    >=   RECE84-KEY
                 INVALID
                     MOVE    1           TO  FLG-RECE84
                 NOT INVALID
                     PERFORM 990-RECE84-NEXT-SEC
             END-START
             PERFORM
               UNTIL  ( FLG-RECE84           =   1                   )
               OR     ( RECE82-HOSPNUM   NOT =   RECE84-HOSPNUM      )
               OR     ( RECE82-SRYYM     NOT =   RECE84-SRYYM        )
               OR     ( RECE82-NYUGAIKBN NOT =   RECE84-NYUGAIKBN    )
               OR     ( RECE82-PTID      NOT =   RECE84-PTID         )
               OR     ( RECE82-RECEKA    NOT =   RECE84-RECEKA       )
               OR     ( RECE82-HKNID     NOT =   RECE84-HKNID        )
               OR     ( RECE82-TEKSTYMD  NOT =   RECE84-TEKSTYMD     )
      *
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                  EVALUATE      RECE84-SRYKBN
                      WHEN      "14"
      *               （在支援に関する診療のカウント）
                         IF  RECE84-FLG-ZAISIEN-COMMENT   =  "1" OR "2"
                            MOVE  RECE84-REC  TO  WRK-RECE84-REC
                            EVALUATE  RECE84-FLG-ZAISIEN-COMMENT
                              WHEN      "1"
                                MOVE  1  TO  TBL-ZAISIEN-COMMENT
                              WHEN      "2"
                                MOVE  2  TO  TBL-ZAISIEN-COMMENT
                            END-EVALUATE
                         END-IF
                      WHEN      "40"
      *               （介達牽引あり）
                         IF  RECE84-KAITATU-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO-KAITATU-COMMENT
                         END-IF
                      WHEN      "80"
      *               （リハビリあり）
                         IF  RECE84-SINDAI-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-SINDAI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-SINDAI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-KOKYUKI-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO-KOKYUKI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-KOKYUKI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-NOUKE-COMMENT        =  "1"
                            MOVE   1   TO  TBL-HASSYO-NOUKE-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-NOUKE-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-UNDOKI-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-UNDOKI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-UNDOKI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-NANBYO-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-NANBYO-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-NANBYO-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-SYOGAI-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-SYOGAI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-SYOGAI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-SESSYOKU-COMMENT     =  "1"
                            MOVE   1   TO  TBL-HASSYO-SESSYOKU-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-SESSYOKU-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-HAIYO-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-HAIYO-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-HAIYO-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
      *
                         IF  RECE84-SINDAI9-COMMENT       =  "1"
                         OR  RECE84-SINDAI9X-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO9-SINDAI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO9-SINDAI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-KOKYUKI9-COMMENT      =  "1"
                         OR  RECE84-KOKYUKI9X-COMMENT     =  "1"
                            MOVE   1   TO  TBL-HASSYO9-KOKYUKI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO9-KOKYUKI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-HAIYO9-COMMENT       =  "1"
                         OR  RECE84-HAIYO9X-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO9-HAIYO-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO9-HAIYO-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                   WHEN      "90"
                   WHEN      "92"
                         IF  (RECE82-CYOJKSNFLG  NOT = SPACE     )
                         AND (RECE84-FLG-CYOJKSN-COMMENT =
                                         "1" OR "2" OR "3" OR "4")
                            PERFORM   20011-CYOJKSN-KAISHIDAY-SEC
                         END-IF
                  END-EVALUATE
               ELSE                                                     
                  EVALUATE      RECE84-SRYKBN
                      WHEN      "40"
                      WHEN      "80"
      *               （介達牽引あり）
                         IF  RECE84-KAITATU-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO-KAITATU-COMMENT
                         END-IF
      *               （リハビリあり）
                         IF  RECE84-SINDAI-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-SINDAI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-SINDAI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-KOKYUKI-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO-KOKYUKI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-KOKYUKI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-NOUKE-COMMENT        =  "1"
                            MOVE   1   TO  TBL-HASSYO-NOUKE-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-NOUKE-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-UNDOKI-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-UNDOKI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-UNDOKI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-NANBYO-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-NANBYO-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-NANBYO-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-SYOGAI-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-SYOGAI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-SYOGAI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-SESSYOKU-COMMENT     =  "1"
                            MOVE   1   TO  TBL-HASSYO-SESSYOKU-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-SESSYOKU-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-HAIYO-COMMENT       =  "1"
                            MOVE   1   TO  TBL-HASSYO-HAIYO-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO-HAIYO-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
      *
                         IF  RECE84-SINDAI9-COMMENT       =  "1"
                         OR  RECE84-SINDAI9X-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO9-SINDAI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO9-SINDAI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-KOKYUKI9-COMMENT      =  "1"
                         OR  RECE84-KOKYUKI9X-COMMENT     =  "1"
                            MOVE   1   TO  TBL-HASSYO9-KOKYUKI-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO9-KOKYUKI-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
                         IF  RECE84-HAIYO9-COMMENT       =  "1"
                         OR  RECE84-HAIYO9X-COMMENT      =  "1"
                            MOVE   1   TO  TBL-HASSYO9-HAIYO-COMMENT
                            PERFORM  VARYING  IDX1  FROM  1  BY  1
                                      UNTIL   IDX1   >   31
                             IF   RECE84-KAISU(1 IDX1)  NOT = ZERO
                              MOVE 1 TO TBL-HASSYO9-HAIYO-SANTEI(IDX1)
                             END-IF
                            END-PERFORM
                         END-IF
      *               （在支援に関する診療のカウント）
                         IF  RECE84-FLG-ZAISIEN-COMMENT   =  "1" OR "2"
                            MOVE  RECE84-REC  TO  WRK-RECE84-REC
                            EVALUATE  RECE84-FLG-ZAISIEN-COMMENT
                              WHEN      "1"
                                MOVE  1  TO  TBL-ZAISIEN-COMMENT
                              WHEN      "2"
                                MOVE  2  TO  TBL-ZAISIEN-COMMENT
                            END-EVALUATE
                         END-IF
                   WHEN      "90"
                   WHEN      "92"
                         IF  (RECE82-CYOJKSNFLG  NOT = SPACE     )
                         AND (RECE84-FLG-CYOJKSN-COMMENT =
                                         "1" OR "2" OR "3" OR "4")
                            PERFORM   20011-CYOJKSN-KAISHIDAY-SEC
                         END-IF
                  END-EVALUATE                                          
               END-IF                                                   
               PERFORM 990-RECE84-NEXT-SEC
             END-PERFORM
           END-IF
      *
           INITIALIZE    WRK-JIDO-SETCOM-AREA
      *
      *    他保険にて入院料算定済みのコメント
      *
           IF   RECE82-NYUINRYOFLG   NOT =   SPACE
      *
              PERFORM   2001-NYUINRYO-COMMENT-SEC
      *
           END-IF
      *
      *    発症日のコメント
           IF   RECE82-SRYYM      >=    "200604"
               PERFORM   2001-HASSYO-HANTEI-SEC
           ELSE
               MOVE      ZERO            TO   FLG-COMOKIKAE
               MOVE      CONS-KYUSEI     TO   WRK-SRYCD
               PERFORM   2001-KYUSEIHASSYO-HANTEI-SEC
           END-IF
      *
      *    自賠責従来様式：加算率 
           IF   RECE82-HKNKBN     =   "4"
           AND  WRK-PARA-RECEKBN  =   "5"
             EVALUATE  RECE82-JIBAIKBN
      *        加算率
               WHEN     "1"
                  PERFORM    2001-KASANRITU-COMMENT-SEC
      *        薬剤等点単価
               WHEN     "2"
                  IF    RECE82-SYUTENTANKA  =  RECE82-YKZTENTANKA
                     CONTINUE
                  ELSE
                     PERFORM    2001-YKZTENTANKA-COMMENT-SEC
                  END-IF
             END-EVALUATE
           END-IF
      *
      *    在支援コメント
           IF     TBL-ZAISIEN-COMMENT   NOT =  ZERO
                PERFORM    2001-ZAISIEN-COMMENT-SEC
           END-IF
      *
      *    特別のコメント（特別な関係にある他院）
      *
           IF     RECE82-TAINFLG            =  "1"
                PERFORM    2001-TAIN-TOKUBETU-COMMENT-SEC
           END-IF
      *
      *    標準負担額経過措置（精神）入院年月日のコメント
      *
           IF   RECE82-SEISIN-SKJFLG        =   1
           AND  RECE82-SEISIN-NYUINYMD  NOT =  SPACE
             INITIALIZE                         STS-AREA-DAY
             INITIALIZE                         LNK-DAY2-AREA
             MOVE    "21"                   TO  LNK-DAY2-IRAI
             MOVE  RECE82-SEISIN-NYUINYMD   TO  LNK-DAY2-YMD
             CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                            LNK-DAY2-AREA
             IF      STS-DAY-RC1            =   ZERO
                PERFORM    2001-SEISIN-SKJ-COMMENT-SEC
             END-IF
           END-IF
      *
      *    妊婦のコメント
           IF   RECE82-NINPUFLG   =   1
                PERFORM    2001-NINPU-COMMENT-SEC
           END-IF
      *
           PERFORM 800-RECE82-SET84-SEC
           MOVE    ZERO                TO  RECE84-ZAINUM
      *
           START   RECE84-FILE
               KEY IS    >=   RECE84-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE84
               NOT INVALID
                   PERFORM 990-RECE84-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE84           =   1                   )
               OR     ( RECE82-HOSPNUM   NOT =   RECE84-HOSPNUM      )
               OR     ( RECE82-SRYYM     NOT =   RECE84-SRYYM        )
               OR     ( RECE82-NYUGAIKBN NOT =   RECE84-NYUGAIKBN    )
               OR     ( RECE82-PTID      NOT =   RECE84-PTID         )
               OR     ( RECE82-RECEKA    NOT =   RECE84-RECEKA       )
               OR     ( RECE82-HKNID     NOT =   RECE84-HKNID        )
               OR     ( RECE82-TEKSTYMD  NOT =   RECE84-TEKSTYMD     )
      *
               INITIALIZE    WRK-JIDO-SETCOM-AREA
               MOVE    ZERO   TO   FLG-KAISIEN
      *
               IF   RECE84-JIHOKBN  NOT =  SPACE
                INITIALIZE  WRK-JIDO-SETCOM-AREA
                PERFORM     20011-HOKATU-COMMENT-SEC
               ELSE
                IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                 EVALUATE      RECE84-SRYKBN                   
                   WHEN      "11"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYODOU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "13"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-YAKUKANSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-NYUEIYOSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUMONSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYOBYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-RYOYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TAIIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KAISIEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYUEIYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-JINNAI-HANTEI-SEC
                      END-IF
      *               診区１３・１４共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SINPESUR-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-GANSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HAIJRT-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TAIKYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "14"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUSIJI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUSKSN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TEJHOU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HINKAI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-OSIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KAISYOKU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-YOUATU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-ZAIKYO-HANTEI-SEC
                      END-IF
      *               診区１３・１４共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SINPESUR-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-ZAIHANKO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-GAIZAI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KOUYAK-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "40"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-JINZOUETC-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KYOKUIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-BOKOHO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KIATU-HANTEI-SEC
                      END-IF
      *               診区４０・８０共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SCPRO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "50"
                      PERFORM      2001-SHUJUTSU-HANTEI-SEC
                   WHEN      "54"
                      PERFORM      2001-MASUI-HANTEI-SEC
                   WHEN      "60"
                   WHEN      "64"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENSEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENSA-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENKSN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "70"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-CTMRI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KINGAZ-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "80"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUMONSIDO-SEI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        IF    RECE84-RIHABIRI-COMMENT  NOT = SPACE
                          IF  RECE84-RIHABIRI-COMMENT      =  "1"
                            MOVE      99   TO   FLG-COMMENT
                            PERFORM   2001-RIHA-COMMENT-SEC
                          ELSE
                            MOVE      99   TO   FLG-COMMENT
                            PERFORM   2001-RIHAIGAKU-COMMENT-SEC
                          END-IF
                        END-IF
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-RIHASEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SEIKEA-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KYUKYU-HANTEI-SEC
                      END-IF
      *               診区４０・８０共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SCPRO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "90"
                   WHEN      "92"
                      EVALUATE    RECE84-ZAISKBKBN
                        WHEN   "2"
                          PERFORM      2001-NYU-COMMENT-SEC
                        WHEN   "6"
                          MOVE   ZERO   TO  FLG-COMMENT
                          IF   FLG-COMMENT  =  ZERO
                             PERFORM   2001-KAKURI-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                             PERFORM   2001-CHIRYO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-EISAPO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-KOKKEA-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-JYUSYO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-SEIRIE-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-BYOYAK-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-CYOJKSN-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-HAIJSK-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-NYUKSN-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                             PERFORM   2099-RECE84-WRITE-SEC
                          END-IF
                        WHEN   OTHER
                         PERFORM       2099-RECE84-WRITE-SEC
                      END-EVALUATE
                   WHEN   OTHER
                         PERFORM       2099-RECE84-WRITE-SEC
                 END-EVALUATE
                ELSE                                                     
                 EVALUATE      RECE84-SRYKBN                            
                   WHEN      "11"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYODOU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "13"                                       
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-YAKUKANSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-NYUEIYOSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUMONSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYOBYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-RYOYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TAIIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KAISIEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SYUEIYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-JINNAI-HANTEI-SEC
                      END-IF
      *               診区１３・１４共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SINPESUR-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-GANSIDO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HAIJRT-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TAIKYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "40"          
                   WHEN      "80"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUMONSIDO-SEI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        IF    RECE84-RIHABIRI-COMMENT  NOT = SPACE
                          IF  RECE84-RIHABIRI-COMMENT      =  "1"
                            MOVE      99   TO   FLG-COMMENT
                            PERFORM   2001-RIHA-COMMENT-SEC
                          ELSE
                            MOVE      99   TO   FLG-COMMENT
                            PERFORM   2001-RIHAIGAKU-COMMENT-SEC
                          END-IF
                        END-IF
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-RIHASEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SEIKEA-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUSIJI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HOUSKSN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-TEJHOU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-HINKAI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-OSIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KAISYOKU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-YOUATU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-JINZOUETC-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KYOKUIN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KYUKYU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-ZAIKYO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-BOKOHO-HANTEI-SEC
                      END-IF
      *               診区１３・１４共用分
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SINPESUR-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-ZAIHANKO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KIATU-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-SCPRO-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-GAIZAI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KOUYAK-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "50"                                       
                      PERFORM      2001-SHUJUTSU-HANTEI-SEC               
                   WHEN      "54"
                      PERFORM      2001-MASUI-HANTEI-SEC
                   WHEN      "60"
                   WHEN      "64"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENSEN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENSA-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KENKSN-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "70"
                      MOVE   ZERO   TO  FLG-COMMENT
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-CTMRI-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2001-KINGAZ-HANTEI-SEC
                      END-IF
                      IF   FLG-COMMENT  =  ZERO
                        PERFORM    2099-RECE84-WRITE-SEC
                      END-IF
                   WHEN      "90"
                   WHEN      "92"
                      EVALUATE    RECE84-ZAISKBKBN
                        WHEN   "2"
                          PERFORM      2001-NYU-COMMENT-SEC
                        WHEN   "6"
                          MOVE   ZERO   TO  FLG-COMMENT
                          IF   FLG-COMMENT  =  ZERO
                             PERFORM   2001-KAKURI-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                             PERFORM   2001-CHIRYO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-EISAPO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-KOKKEA-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-JYUSYO-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-SEIRIE-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-BYOYAK-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-CYOJKSN-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-HAIJSK-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                            PERFORM    2001-NYUKSN-HANTEI-SEC
                          END-IF
                          IF   FLG-COMMENT  =  ZERO
                             PERFORM   2099-RECE84-WRITE-SEC
                          END-IF
                        WHEN   OTHER
                          PERFORM      2099-RECE84-WRITE-SEC
                      END-EVALUATE
                   WHEN   OTHER                                         
                         PERFORM       2099-RECE84-WRITE-SEC
                 END-EVALUATE                                           
                END-IF
               END-IF                                                   
      *
               PERFORM 990-RECE84-NEXT-SEC
      *
           END-PERFORM
      *
      *****差込編集２**********************
           PERFORM     250-SASHIKOMI2-SEC
      *
      *****選択式コメント編集**************
           IF   RECE82-SRYYM  >=  "201810"
             PERFORM   270-SENTAKUCOM-HENSYU-SEC
           END-IF
      *
      *****関係コメント編集****************
           PERFORM     260-SETCOM-HENSYU-SEC
      *
           PERFORM 990-RECE82-READ-SEC
      *
           .
       200-MAIN-EXT.
           EXIT.
      *
      *****************************************************************
      *    他保険にて入院料算定済みのコメント編集
      *****************************************************************
       2001-NYUINRYO-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999999            TO  RECE849-ZAINUM
           MOVE    "90"                TO  RECE849-SRYKBN
      *
           MOVE    1                   TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999999            TO  RECE859-ZAINUM
           MOVE    "90"                TO  RECE859-SRYKBN
      *    コメントの挿入
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
           MOVE    "810000001"         TO  WRK-RECE85XX-SRYCD(1 1)
           MOVE     ZERO               TO  WRK-RECE85XX-SRYSURYO(1 1)
           EVALUATE   RECE82-NYUINRYOFLG
             WHEN     "1"
               MOVE     10             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "自費にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "2"
               MOVE     10             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "労災にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "3"
               MOVE     11             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "自賠責にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "4"
               MOVE     10             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "国保にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "5"
               MOVE     10             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "社保にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "6"
               MOVE     11             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "他保険にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "7"
               MOVE     10             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "公害にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
             WHEN     "8"
               MOVE     10             TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE    "後保にて入院料算定済" 
                                       TO  WRK-RECE85XX-NAME(1 1)
           END-EVALUATE
           MOVE     "1"                TO  WRK-RECE85XX-SIKFLG(1 1)
      *
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       2001-NYUINRYO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    妊婦のコメント編集
      *****************************************************************
       2001-NINPU-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999960            TO  RECE849-ZAINUM
           MOVE    "99"                TO  RECE849-SRYKBN
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           MOVE    1                   TO  RECE849-MEISAISU
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999960            TO  RECE859-ZAINUM
           MOVE    "99"                TO  RECE859-SRYKBN
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
      *    「妊婦」
           MOVE    "820100348"         TO  WRK-TENSU-SRYCD
           MOVE    RECE82-SRYYM        TO  WRK-TENSU-SRYYM
           PERFORM 900-TENSU-TBL-SEC
      *
           MOVE    TNS-SRYCD           TO  WRK-RECE85XX-SRYCD(1 1)
           MOVE    ZERO                TO  WRK-RECE85XX-SRYSURYO(1 1)
           MOVE    TNS-YUKOKETA        TO  WRK-RECE85XX-YUKOKETA(1 1)
           MOVE    TNS-NAME            TO  WRK-RECE85XX-NAME(1 1)
                                           WRK-RECE85XX-INPUTCOMENT(1 1)
           MOVE    "1"                 TO  WRK-RECE85XX-SIKFLG(1 1)
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       2001-NINPU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日があるか判定
      *****************************************************************
       2001-HASSYO-HANTEI-SEC          SECTION.
      *
           IF   TBL-HASSYO-KAITATU-COMMENT   =  1
                MOVE      ZERO             TO   FLG-COMOKIKAE
                MOVE      CONS-KYUSEI      TO   WRK-SRYCD
                PERFORM   2001-KYUSEIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-SINDAI-COMMENT    =  1
                MOVE      ZERO             TO   FLG-COMOKIKAE
                MOVE      CONS-SINDAI      TO   WRK-SRYCD
                MOVE      CONS-SINDAI-E    TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-SINDAI-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-SINDAI-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-KOKYUKI-COMMENT   =  1
                MOVE      ZERO             TO   FLG-COMOKIKAE
                MOVE      CONS-KOKYUKI     TO   WRK-SRYCD
                MOVE      CONS-KOKYUKI-E   TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-KOKYUKI-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-KOKYUKI-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-NOUKE-COMMENT     =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-NOUKE       TO   WRK-SRYCD
                MOVE      CONS-NOUKE-E     TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-NOUKE-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-NOUKE-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-UNDOKI-COMMENT    =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-UNDOKI      TO   WRK-SRYCD
                MOVE      CONS-UNDOKI-E    TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-UNDOKI-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-UNDOKI-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-NANBYO-COMMENT    =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-NANBYO      TO   WRK-SRYCD
                MOVE      CONS-NANBYO-E    TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-NANBYO-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-NANBYO-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-SYOGAI-COMMENT    =  1
                MOVE      ZERO             TO   FLG-COMOKIKAE
                MOVE      CONS-SYOGAI      TO   WRK-SRYCD
                MOVE      CONS-SYOGAI-E    TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-SYOGAI-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-SYOGAI-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-SESSYOKU-COMMENT  =  1
                MOVE      ZERO             TO   FLG-COMOKIKAE
                MOVE      CONS-SESSYOKU    TO   WRK-SRYCD
                MOVE      CONS-SESSYOKU-E  TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-SESSYOKU-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-SESSYOKU-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO-HAIYO-COMMENT    =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-HAIYO       TO   WRK-SRYCD
                MOVE      CONS-HAIYO-E     TO   WRK-SRYCD2
                MOVE      TBL-HASSYO-HAIYO-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-HAIYO-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      *####
           IF   TBL-HASSYO9-SINDAI-COMMENT    =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-SINDAI-K    TO   WRK-SRYCD
                MOVE      "999999999"      TO   WRK-SRYCD2
                MOVE      TBL-HASSYO9-SINDAI-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-SINDAI9-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO9-KOKYUKI-COMMENT   =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-KOKYUKI-K   TO   WRK-SRYCD
                MOVE      "999999999"      TO   WRK-SRYCD2
                MOVE      TBL-HASSYO9-KOKYUKI-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-KOKYUKI9-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      ***
           IF   TBL-HASSYO9-HAIYO-COMMENT    =  1
                MOVE      1                TO   FLG-COMOKIKAE
                MOVE      CONS-HAIYO-K     TO   WRK-SRYCD
                MOVE      "999999999"      TO   WRK-SRYCD2
                MOVE      TBL-HASSYO9-HAIYO-DAY-T
                                           TO   TBL-HASSYO-TAIHI-DAY-T
                MOVE      RECE82-RIHA2-HAIYO9-AREA
                                       TO   TBL-HASSYO-TAIHIYMD1-DAY-T
                PERFORM   20011-RIHABIRIHASSYO-HANTEI-SEC
           END-IF
      *
           .
       2001-HASSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    脳血管疾患急性発症日があるか判定
      *    脳血管疾患急性発症日の１８０日以内か判定
      *****************************************************************
       2001-KYUSEIHASSYO-HANTEI-SEC          SECTION.
      *
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT
           MOVE     ZERO     TO     WRK-KYUSEIYMD
      *
      *    算定履歴検索
           INITIALIZE                  SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    WRK-SRYCD           TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    RECE82-HKNCOMBI     TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
      *
                MOVE    "tbl_santei"   TO  MCP-TABLE
                MOVE    "key3"         TO  MCP-PATHNAME
                PERFORM  900-SANTEI-READ-SEC
      *
                PERFORM   UNTIL  ( FLG-SANTEI         =   1 ) OR
                                 ( FLG-KYUSEI-COMMENT =   1 )
      *
                   PERFORM  VARYING   IDX3   FROM  31  BY  -1
                             UNTIL   ( IDX3               <    1 )
                               OR    ( FLG-KYUSEI-COMMENT =    1 )
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                         MOVE   SANTEI-SRYYM   TO  WRK-FSANTEIYMD(1:6)
                         MOVE   IDX3           TO  WRK-FSANTEIYMD(7:2)
      *
                         INITIALIZE                  STS-AREA-DAY
                         INITIALIZE                  LNK-DAY6-AREA
                         MOVE    "61"            TO  LNK-DAY6-IRAI
                         MOVE    WRK-FSANTEIYMD  TO  LNK-DAY6-KIJUN
                         MOVE    "1"             TO  LNK-DAY6-ZOGENPTN
                         MOVE     179            TO  LNK-DAY6-ZOGEN
                         CALL    "ORCSDAY"       USING   STS-AREA-DAY
                                                         LNK-DAY6-AREA
                         MOVE    LNK-DAY6-KEISAN TO  WRK-AFTER180
      *
                         IF   WRK-FSANTEIYMD(1:6) <=  RECE82-SRYYM
                         AND  RECE82-SRYYM        <=  WRK-AFTER180(1:6)
                               MOVE    1    TO   FLG-KYUSEI-COMMENT
                               MOVE  WRK-FSANTEIYMD
                                            TO   WRK-KYUSEIYMD
                         END-IF
      *
                     END-IF
      *
                   END-PERFORM
      *
                   MOVE    "tbl_santei"   TO  MCP-TABLE
                   MOVE    "key3"         TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
      *
                END-PERFORM
      *
           END-IF
      *
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           IF      FLG-KYUSEI-COMMENT    =      1
               PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
               IF   RECE82-SRYYM      >=    "200604"
                   MOVE       WRK-KYUSEIYMD(7:2)  TO  IDX16
                   IF   RECE82-SRYYM >= "201905"
                     PERFORM  20011-HASSYO-COM-201905-SEC
                   ELSE
                     PERFORM  20011-HASSYO-COMMENT-SEC
                   END-IF
               ELSE
                   PERFORM    20011-KYUSEIHASSYO-COMMENT-SEC
               END-IF
           END-IF
      *
           .
       2001-KYUSEIHASSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    脳血管疾患急性発症日等の検索
      *****************************************************************
       20011-KYUSEIHASSYO-KENSAKU-SEC          SECTION.
      *
           MOVE    ZERO                  TO  FLG-KYUSEI-OK
           MOVE    SPACE                 TO  WRK-KYUSEI-NYUGAIKBN
           MOVE    SPACE                 TO  WRK-KYUSEI-SRYKA
           MOVE    ZERO                  TO  WRK-KYUSEI-ZAINUM
           MOVE    ZERO                  TO  FLG-COMOKIKAE2
           MOVE    ZERO                  TO  FLG-COMARI
           MOVE    ZERO                  TO  FLG-COMARI2
      *
           MOVE    ZERO                  TO  IDZ
           INITIALIZE                        WRK-FREE-AREA
           INITIALIZE                        WRK-FREE-AREA2
      *++++
           PERFORM   VARYING   IDX15    FROM   1   BY   1
                      UNTIL   (IDX15          >    2)
                       OR     (FLG-KYUSEI-OK  =    1)
      *
           INITIALIZE                        SRYACT-REC
           MOVE    RECE82-HOSPNUM        TO  SRY-HOSPNUM
           MOVE    IDX15                 TO  SRY-NYUGAIKBN
           MOVE    RECE82-PTID           TO  SRY-PTID
           MOVE    WRK-KYUSEIYMD(1:6)    TO  SRY-SRYYM
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (1)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (2)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (3)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (4)
           MOVE    WRK-SRYCD             TO  SRY-SRYCD (5)
           MOVE    SRYACT-REC            TO  MCPDATA-REC
           MOVE    "tbl_sryact"          TO  MCP-TABLE
           MOVE    "key7"                TO  MCP-PATHNAME
           PERFORM  900-DBSELECT-SEC
           IF      MCP-RC               =       ZERO
               MOVE    "tbl_sryact"      TO  MCP-TABLE
               MOVE    "key7"            TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT     =   1
                         OR     FLG-KYUSEI-OK  =   1
                 INITIALIZE                     SRYACCT-REC
                 MOVE    SRY-HOSPNUM      TO    ACCT-HOSPNUM
                 MOVE    SRY-NYUGAIKBN    TO    ACCT-NYUGAIKBN
                 MOVE    SRY-PTID         TO    ACCT-PTID
                 MOVE    SRY-SRYKA        TO    ACCT-SRYKA
                 MOVE    SRY-SRYYM        TO    ACCT-SRYYM
                 MOVE    SRY-ZAINUM       TO    ACCT-ZAINUM
                 MOVE    SRYACCT-REC      TO    MCPDATA-REC
                 MOVE    "tbl_sryacct"    TO    MCP-TABLE
                 MOVE    "key31"          TO    MCP-PATHNAME
                 PERFORM  900-DBSELECT-SEC
                 IF     MCP-RC            =  ZERO
                    MOVE    "tbl_sryacct" TO    MCP-TABLE
                    MOVE    "key31"       TO    MCP-PATHNAME
                    PERFORM  900-DBFETCH-SEC
                    IF      MCP-RC        =       ZERO
                        MOVE    MCPDATA-REC  TO  SRYACCT-REC
      *
                        MOVE    WRK-KYUSEIYMD(7:2)  TO  DAY-IDX2
                        IF  ( ACCT-DAY(1 DAY-IDX2)  NOT =  ZERO )
                        AND ( ACCT-HKNCOMBI  =  RECE82-HKNCOMBI )
                            MOVE   1   TO  FLG-KYUSEI-OK
                            MOVE   ACCT-NYUGAIKBN
                                       TO  WRK-KYUSEI-NYUGAIKBN
                            MOVE   ACCT-SRYKA
                                       TO  WRK-KYUSEI-SRYKA
                            MOVE   ACCT-ZAINUM
                                       TO  WRK-KYUSEI-ZAINUM
                        END-IF
                    END-IF
                 END-IF
                 MOVE    "tbl_sryacct"    TO   MCP-TABLE
                 MOVE    "key31"          TO   MCP-PATHNAME
                 PERFORM  900-CLOSE-SEC
      *
                 MOVE    "tbl_sryact"     TO   MCP-TABLE
                 MOVE    "key7"           TO   MCP-PATHNAME
                 PERFORM  900-SRYACT-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_sryact"         TO  MCP-TABLE
           MOVE    "key7"               TO  MCP-PATHNAME
           PERFORM  900-CLOSE-SEC
      *
           END-PERFORM
      *++++
           IF      WRK-KYUSEI-ZAINUM    NOT =    ZERO
              INITIALIZE                           SRYACT-REC
              MOVE    RECE82-HOSPNUM         TO    SRY-HOSPNUM
              MOVE    WRK-KYUSEI-NYUGAIKBN   TO    SRY-NYUGAIKBN
              MOVE    RECE82-PTID            TO    SRY-PTID
              MOVE    WRK-KYUSEI-SRYKA       TO    SRY-SRYKA
              MOVE    WRK-KYUSEIYMD(1:6)     TO    SRY-SRYYM
              MOVE    WRK-KYUSEI-ZAINUM      TO    SRY-ZAINUM
              MOVE    SRYACT-REC             TO    MCPDATA-REC
              MOVE    "tbl_sryact"           TO    MCP-TABLE
              MOVE    "key2"                 TO    MCP-PATHNAME
              PERFORM  900-DBSELECT-SEC
              IF     MCP-RC            =  ZERO
                 MOVE    "tbl_sryact"        TO    MCP-TABLE
                 MOVE    "key2"              TO    MCP-PATHNAME
                 PERFORM  900-SRYACT-READ-SEC
                 PERFORM  UNTIL   FLG-SRYACT     =   1
                   PERFORM  VARYING  IDX12  FROM  1  BY  1
                             UNTIL  (IDX12             >    5   )  OR
                                    (SRY-SRYCD(IDX12)  =   SPACE)
                    IF   RECE82-SRYYM >= "202008"
                      PERFORM  200111-KYUSEIHASSYO-KSCOM1-SEC
                    ELSE
                      IF  ((SRY-SRYCD(IDX12)(1:1)     =   "8"  )  OR
                           (SRY-SRYCD(IDX12)(1:3)     =   "008"))
                      AND ( SRY-SRYCD(IDX12)(1:4) NOT =
                                              "0085" AND "0086" )
                       IF   SRY-INPUTNUM(IDX12)   NOT =   ZERO
                         INITIALIZE                      PTCOM-REC
                         MOVE    SRY-HOSPNUM         TO  PTCOM-HOSPNUM
                         MOVE    SRY-PTID            TO  PTCOM-PTID
                         MOVE    SRY-ZAINUM          TO  PTCOM-ZAINUM
                         MOVE    SRY-SRYCD(IDX12)    TO  PTCOM-SRYCD
                         MOVE    SRY-INPUTNUM(IDX12) TO  PTCOM-RENNUM
                         PERFORM 900-PTCOM-READ-SEC
                         ADD     1     TO    IDZ
                         MOVE    PTCOM-INPUTCOMENT
                                                TO  WK-FREE-NAME(IDZ)
                         PERFORM   VARYING   IDX13   FROM   300   BY  -1
                                    UNTIL    IDX13    <    1
                           IF  WK-FREE-NAME(IDZ)(IDX13:1)  NOT =  SPACE
                             COMPUTE  WK-FREE-YUKOKETA(IDZ)  =
                                      IDX13    /    2
                             MOVE     1     TO      IDX13
                           END-IF
                         END-PERFORM
                       ELSE
                         MOVE  SRY-SRYCD(IDX12) TO  WRK-TENSU-SRYCD
                         MOVE  SRY-SRYYM        TO  WRK-TENSU-SRYYM
                         PERFORM      900-TENSU-TBL-SEC
                         ADD     1           TO  IDZ
                         MOVE    TNS-NAME    TO  WK-FREE-NAME(IDZ)
                         PERFORM   VARYING   IDX13   FROM   300   BY  -1
                                    UNTIL    IDX13    <    1
                           IF  WK-FREE-NAME(IDZ)(IDX13:1)  NOT =  SPACE
                             COMPUTE  WK-FREE-YUKOKETA(IDZ)  =
                                      IDX13    /    2
                             MOVE     1     TO      IDX13
                           END-IF
                         END-PERFORM
                       END-IF
                       IF   FLG-COMOKIKAE  =   1
                          EVALUATE  SRY-SRYCD(IDX12)
                            WHEN     "840000042"
                              IF   FLG-COMOKIKAE2 = ZERO
                                 MOVE    1    TO  FLG-COMOKIKAE2
                                 MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                                 MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                                 COMPUTE  IDZ  =  IDZ - 1
                              END-IF
                            WHEN     "840000101"
                              IF   FLG-COMOKIKAE2 = ZERO
                                 MOVE    2    TO  FLG-COMOKIKAE2
                                 MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                                 MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                                 COMPUTE  IDZ  =  IDZ - 1
                              END-IF
                            WHEN     "840000058"
                              IF   FLG-COMOKIKAE2 = ZERO
                                 MOVE    3    TO  FLG-COMOKIKAE2
                                 MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                                 MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                                 COMPUTE  IDZ  =  IDZ - 1
                              END-IF
                          END-EVALUATE
                       END-IF
                       IF   FLG-COMOKIKAE  =   1
                          IF  SRY-SRYCD(IDX12) = "840000042" OR
                                                 "840000101" OR
                                                 "840000058"
                            MOVE    1    TO   FLG-COMARI2
                          ELSE
                            MOVE    1    TO   FLG-COMARI
                          END-IF
                       ELSE
                            MOVE    1    TO   FLG-COMARI
                       END-IF
                      END-IF
                    END-IF
                   END-PERFORM
                   MOVE    "tbl_sryact"       TO  MCP-TABLE
                   MOVE    "key2"             TO  MCP-PATHNAME
                   PERFORM  900-SRYACT-READ-SEC
                 END-PERFORM
              END-IF
              MOVE    "tbl_sryact"            TO  MCP-TABLE
              MOVE    "key2"                  TO  MCP-PATHNAME
              PERFORM  900-CLOSE-SEC
           END-IF
      *++++
           IF      FLG-COMARI    =    ZERO
              INITIALIZE                      SANTEIPLUS-REC
              MOVE    RECE82-HOSPNUM      TO  SANTEIPLUS-HOSPNUM
              MOVE    RECE82-PTID         TO  SANTEIPLUS-PTID
              MOVE    WRK-KYUSEIYMD(1:6)  TO  SANTEIPLUS-SRYYM
              MOVE    WRK-SRYCD           TO  SANTEIPLUS-SRYCD
              MOVE    ZERO                TO  SANTEIPLUS-NYUGAIKBN
              MOVE    ZERO                TO  SANTEIPLUS-SRYKA
              MOVE    RECE82-HKNCOMBI     TO  SANTEIPLUS-HKNCOMBINUM
              MOVE    WRK-KYUSEIYMD(7:2)  TO  SANTEIPLUS-DAYKEY
              MOVE    SANTEIPLUS-REC      TO  MCPDATA-REC
              MOVE    "tbl_santeiplus"    TO  MCP-TABLE
              MOVE    "key2"              TO  MCP-PATHNAME
              PERFORM 900-DBSELECT-SEC
              IF      MCP-RC               =       ZERO
                 MOVE    "tbl_santeiplus"     TO  MCP-TABLE
                 MOVE    "key2"               TO  MCP-PATHNAME
                 PERFORM  900-SANTEIPLUS-READ-SEC
                 PERFORM  UNTIL   FLG-SANTEIPLUS     =   1
      *           リハコメントの終了日と診療月をチェック
      *           （履歴番号＞０のデータ）
                  IF     SANTEIPLUS-RENNUM   NOT =  ZERO
                   IF  ( SANTEIPLUS-ENDYMD       =  SPACE        )
                   OR  ((SANTEIPLUS-ENDYMD   NOT =  SPACE       ) AND
                        (SANTEIPLUS-ENDYMD(1:6) >=  RECE82-SRYYM))
                    IF   RECE82-SRYYM >= "202008"
                      PERFORM  200111-KYUSEIHASSYO-KSCOM2-SEC
                    ELSE
                     IF  SANTEIPLUS-COMMENT  NOT =  SPACE
                      ADD     1                 TO  IDZ
                      MOVE  SANTEIPLUS-COMMENT  TO  WK-FREE-NAME(IDZ)
                      PERFORM   VARYING   IDX13   FROM   300   BY  -1
                                 UNTIL    IDX13    <     1
                        IF  WK-FREE-NAME(IDZ)(IDX13:1)  NOT =  SPACE
                          COMPUTE  WK-FREE-YUKOKETA(IDZ)  =
                                   IDX13    /    2
                          MOVE     1     TO      IDX13
                        END-IF
                      END-PERFORM
                     END-IF
                     IF   FLG-COMOKIKAE  =    1
                     AND  FLG-COMARI2    =   ZERO
                      IF   SANTEIPLUS-COMMENT(1:8)  = "手術　日"
                        IF   FLG-COMOKIKAE2 = ZERO
                           MOVE    1    TO  FLG-COMOKIKAE2
                           MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                           MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                           COMPUTE  IDZ  =  IDZ - 1
                        END-IF
                      END-IF
                      IF   SANTEIPLUS-COMMENT(1:12) = "急性増悪　日"
                        IF   FLG-COMOKIKAE2 = ZERO
                           MOVE    2    TO  FLG-COMOKIKAE2
                           MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                           MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                           COMPUTE  IDZ  =  IDZ - 1
                        END-IF
                      END-IF
                      IF   SANTEIPLUS-COMMENT(1:8) = "診断　日"
                        IF   FLG-COMOKIKAE2 = ZERO
                           MOVE    3    TO  FLG-COMOKIKAE2
                           MOVE  SPACE  TO  WK-FREE-NAME(IDZ)
                           MOVE  ZERO   TO  WK-FREE-YUKOKETA(IDZ)
                           COMPUTE  IDZ  =  IDZ - 1
                        END-IF
                      END-IF
                     END-IF
                    END-IF
                   END-IF
                  END-IF
                  MOVE    "tbl_santeiplus"     TO  MCP-TABLE
                  MOVE    "key2"               TO  MCP-PATHNAME
                  PERFORM  900-SANTEIPLUS-READ-SEC
                 END-PERFORM
              END-IF
              MOVE    "tbl_santeiplus"     TO  MCP-TABLE
              MOVE    "key2"               TO  MCP-PATHNAME
              PERFORM 900-CLOSE-SEC
           END-IF
      *
           .
       20011-KYUSEIHASSYO-KENSAKU-EXT.
           EXIT.
      *
      *****************************************************************
      *    コメント検索
      *****************************************************************
       200111-KYUSEIHASSYO-KSCOM1-SEC          SECTION.
      *
           IF  (SRY-SRYCD(IDX12) = "810000001" OR "840000042"
                                OR "840000101" OR "840000058")
           OR  (SRY-SRYCD(IDX12)(1:4) = "0082" OR "0083"     )
           OR  (SRY-SRYCD(IDX12)(1:4) = "8301"               )
      *
             MOVE    SRY-SRYCD(IDX12)  TO  WRK-TENSU-SRYCD
             MOVE    SRY-SRYYM         TO  WRK-TENSU-SRYYM
             PERFORM      900-TENSU-TBL-SEC
      *
             IF   SRY-INPUTNUM(IDX12)   NOT =   ZERO
               INITIALIZE                      PTCOM-REC
               MOVE    SRY-HOSPNUM         TO  PTCOM-HOSPNUM
               MOVE    SRY-PTID            TO  PTCOM-PTID
               MOVE    SRY-ZAINUM          TO  PTCOM-ZAINUM
               MOVE    SRY-SRYCD(IDX12)    TO  PTCOM-SRYCD
               MOVE    SRY-INPUTNUM(IDX12) TO  PTCOM-RENNUM
               PERFORM 900-PTCOM-READ-SEC
               ADD     1     TO    IDZ
               MOVE    "999999999"         TO  WK-FREE-SRYCD2(IDZ)
               MOVE    PTCOM-INPUTCOMENT   TO  WK-FREE-NAME2(IDZ)
                                               WK-FREE-INPUTCOMENT2(IDZ)
      *
               IF  (SRY-SRYCD(IDX12)(1:4) = "8301")
      *********OR  (SRY-SRYCD(IDX12)(1:4) = "0083")
                 INITIALIZE                ORCSKANACHKAREA
                 MOVE  "2"             TO  KANACHK-SYORI 
                 MOVE  TNS-NAME        TO  KANACHK-MAE-INPUT
                 CALL  "ORCSKANACHK"   USING  ORCSKANACHKAREA
                 IF    ( KANACHK-RC      =   ZERO )
                 AND   ( KANACHK-MAX     >   ZERO )
                   COMPUTE IDX51 = KANACHK-MAX + 1
                   MOVE  PTCOM-INPUTCOMENT(IDX51:)
                                       TO  WK-FREE-INPUTCOMENT2(IDZ)
                 ELSE
                   MOVE  PTCOM-INPUTCOMENT
                                       TO  WK-FREE-INPUTCOMENT2(IDZ)
                 END-IF
      ***********IF   SRY-SRYCD(IDX12)(1:4) = "8301"
      ***********  MOVE  SRY-SRYCD(IDX12)  TO  WK-FREE-SRYCD2(IDZ)
      ***********END-IF
               END-IF
      *
               IF   SRY-SRYCD(IDX12)(1:4) = "8301"
                 IF      PTCOM-INPUTSTRING  =  SPACE
                   IF  TNS-FORMALNAME  =  SPACE
                     CONTINUE
                   ELSE
                     COMPUTE IDX52 = TNS-YUKOKETA * 2 + 1
                     INITIALIZE              ORCSKANACHKAREA
                     MOVE    "2"         TO  KANACHK-SYORI
                     STRING  TNS-FORMALNAME
                                     DELIMITED  BY  SPACE
                             PTCOM-INPUTCOMENT(IDX52:)
                                     DELIMITED  BY  SPACE
                                     INTO    KANACHK-MAE-INPUT
                     END-STRING
                     CALL    "ORCSKANACHK"   USING  ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                       MOVE  KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                         TO  WK-FREE-NAME2(IDZ)
                     END-IF
                   END-IF
                 ELSE
                   IF  TNS-FORMALNAME  =  SPACE
                     INITIALIZE              ORCSKANACHKAREA
                     MOVE    "2"         TO  KANACHK-SYORI
                     STRING  TNS-NAME
                                     DELIMITED  BY  SPACE
                             PTCOM-INPUTSTRING
                                     DELIMITED  BY  SPACE
                                     INTO    KANACHK-MAE-INPUT
                     END-STRING
                     CALL    "ORCSKANACHK"   USING  ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                       MOVE  KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                         TO  WK-FREE-NAME2(IDZ)
                     END-IF
                   ELSE
                     INITIALIZE              ORCSKANACHKAREA
                     MOVE    "2"         TO  KANACHK-SYORI
                     STRING  TNS-FORMALNAME
                                     DELIMITED  BY  SPACE
                             PTCOM-INPUTSTRING
                                     DELIMITED  BY  SPACE
                                     INTO    KANACHK-MAE-INPUT
                     END-STRING
                     CALL    "ORCSKANACHK"   USING  ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                       MOVE  KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                         TO  WK-FREE-NAME2(IDZ)
                     END-IF
                   END-IF
                   MOVE    PTCOM-INPUTSTRING
                                         TO  WK-FREE-INPUTCOMENT2(IDZ)
                 END-IF
               END-IF
             ELSE
               ADD     1           TO  IDZ
               MOVE    "999999999" TO  WK-FREE-SRYCD2(IDZ)
               MOVE    TNS-NAME    TO  WK-FREE-NAME2(IDZ)
                                       WK-FREE-INPUTCOMENT2(IDZ)
             END-IF
             PERFORM   VARYING   IDX13   FROM   300   BY  -1
                        UNTIL    IDX13    <    1
               IF  WK-FREE-NAME2(IDZ)(IDX13:1)  NOT =  SPACE
                 COMPUTE  WK-FREE-YUKOKETA2(IDZ) = IDX13  /  2
                 MOVE     1      TO  IDX13
               END-IF
             END-PERFORM
      *
             IF   SRY-SRYCD(IDX12) = "840000042" OR "840000101"
                                                 OR "840000058"
               MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
               MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
               MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
               MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
               COMPUTE  IDZ  =  IDZ - 1
               EVALUATE  SRY-SRYCD(IDX12)
                 WHEN     "840000042"
                   IF   FLG-COMOKIKAE  =   1
                   AND  FLG-COMOKIKAE2 =  ZERO
                     MOVE   1    TO   FLG-COMOKIKAE2
                   END-IF
                 WHEN     "840000101"
                   IF   FLG-COMOKIKAE  =   1
                   AND  FLG-COMOKIKAE2 =  ZERO
                     MOVE   2    TO   FLG-COMOKIKAE2
                   END-IF
                 WHEN     "840000058"
                   IF   FLG-COMOKIKAE  =   1
                   AND  FLG-COMOKIKAE2 =  ZERO
                     MOVE   3    TO   FLG-COMOKIKAE2
                   END-IF
               END-EVALUATE
             END-IF
             IF   FLG-COMOKIKAE  =   1
               IF   SRY-SRYCD(IDX12) = "840000042" OR "840000101"
                                                   OR "840000058"
                     MOVE   1    TO   FLG-COMARI2
               ELSE
                     MOVE   1    TO   FLG-COMARI
               END-IF
             ELSE
               IF   SRY-SRYCD(IDX12) = "840000042" OR "840000101"
                                                   OR "840000058"
                     CONTINUE
               ELSE
                     MOVE   1    TO   FLG-COMARI
               END-IF
             END-IF
           END-IF
      *
           .
       200111-KYUSEIHASSYO-KSCOM1-EXT.
           EXIT.
      *
      *****************************************************************
      *    コメント検索
      *****************************************************************
       200111-KYUSEIHASSYO-KSCOM2-SEC          SECTION.
      *
           IF   SANTEIPLUS-COMMENT  NOT =  SPACE
             ADD     1           TO  IDZ
             MOVE    "999999999" TO  WK-FREE-SRYCD2(IDZ)
             MOVE    SANTEIPLUS-COMMENT
                                 TO  WK-FREE-NAME2(IDZ)
                                     WK-FREE-INPUTCOMENT2(IDZ)
             PERFORM   VARYING   IDX13   FROM   300   BY  -1
                        UNTIL    IDX13    <    1
               IF  WK-FREE-NAME2(IDZ)(IDX13:1)  NOT =  SPACE
                 COMPUTE  WK-FREE-YUKOKETA2(IDZ) = IDX13  /  2
                 MOVE     1      TO  IDX13
               END-IF
             END-PERFORM
           END-IF
      *
           IF   SANTEIPLUS-COMMENT(1:8)  = "手術　日"
             MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
             MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
             MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
             MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
             COMPUTE  IDZ  =  IDZ - 1
             IF   FLG-COMOKIKAE  =   1
             AND  FLG-COMARI2    =  ZERO
             AND  FLG-COMOKIKAE2 =  ZERO
               MOVE   1   TO   FLG-COMOKIKAE2
             END-IF
           END-IF
           IF   SANTEIPLUS-COMMENT(1:12) = "急性増悪　日"
             MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
             MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
             MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
             MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
             COMPUTE  IDZ  =  IDZ - 1
             IF   FLG-COMOKIKAE  =   1
             AND  FLG-COMARI2    =  ZERO
             AND  FLG-COMOKIKAE2 =  ZERO
               MOVE   2   TO   FLG-COMOKIKAE2
             END-IF
           END-IF
           IF   SANTEIPLUS-COMMENT(1:8) = "診断　日"
             MOVE  SPACE  TO  WK-FREE-SRYCD2(IDZ)
             MOVE  SPACE  TO  WK-FREE-NAME2(IDZ)
             MOVE  SPACE  TO  WK-FREE-INPUTCOMENT2(IDZ)
             MOVE  ZERO   TO  WK-FREE-YUKOKETA2(IDZ)
             COMPUTE  IDZ  =  IDZ - 1
             IF   FLG-COMOKIKAE  =   1
             AND  FLG-COMARI2    =  ZERO
             AND  FLG-COMOKIKAE2 =  ZERO
               MOVE   3   TO   FLG-COMOKIKAE2
             END-IF
           END-IF
      *
           .
       200111-KYUSEIHASSYO-KSCOM2-EXT.
           EXIT.
      *
      *****************************************************************
      *    脳血管疾患急性発症日のコメント編集
      *****************************************************************
       20011-KYUSEIHASSYO-COMMENT-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO         TO  IDX-RECE85
           MOVE    SPACE        TO  WRK-RECE85XX-REC
           INITIALIZE               WRK-RECE85XX-REC
      *
           ADD     1            TO  IDX-RECE85
           MOVE    "810000001"  TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
           MOVE    ZERO         TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
           MOVE    9            TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
           MOVE    "発症　　　月　　日"
                                TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
           MOVE    WRK-KYUSEIYMD(5:2)   TO  DAY-IDX2
           MOVE    TBL-DAY(DAY-IDX2)
                              TO  WRK-RECE85XX-NAME(IDX-RECE85 1)(7:4)
           MOVE    WRK-KYUSEIYMD(7:2)   TO  DAY-IDX2
           MOVE    TBL-DAY(DAY-IDX2)
                              TO  WRK-RECE85XX-NAME(IDX-RECE85 1)(13:4)
           MOVE    "1"        TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
      *
           PERFORM   VARYING   IDX12   FROM    1   BY  1
                      UNTIL  ( IDX12               >   49    )
                        OR   ( WK-FREE-NAME(IDX12) =   SPACE )
                ADD    1        TO  IDX-RECE85
                MOVE   "810000001"
                                TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                MOVE   ZERO     TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                MOVE   WK-FREE-YUKOKETA(IDX12)
                                TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                MOVE   WK-FREE-NAME(IDX12)
                                TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                MOVE   "1"      TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
           END-PERFORM
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
                PERFORM 800-RECE82-SET859-SEC
                MOVE    99999996            TO  RECE859-ZAINUM
                MOVE    "99"                TO  RECE859-SRYKBN
                ADD     1                   TO  WRK-RENNUM
                MOVE    WRK-RENNUM          TO  RECE859-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE85   =    1)
                   ADD         1            TO  IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE    1            TO  FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL (IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE859-SRYCD(1)  NOT =  SPACE
                     PERFORM 800-RECE859-WRITE-SEC
                END-IF
           END-PERFORM
      *
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999996            TO  RECE849-ZAINUM
           MOVE    "99"                TO  RECE849-SRYKBN
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       20011-KYUSEIHASSYO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集
      *****************************************************************
       20011-HASSYO-COMMENT-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO         TO  IDX-RECE85
           MOVE    SPACE        TO  WRK-RECE85XX-REC
           INITIALIZE               WRK-RECE85XX-REC
      *
           ADD     1            TO  IDX-RECE85
           MOVE    "810000001"  TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
           MOVE    ZERO         TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
      *
           MOVE    SPACE        TO  WRK-OKIKAEFLG
      *
           EVALUATE      WRK-SRYCD
             WHEN       CONS-KYUSEI
               MOVE    19   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE    "脳血管疾患急性発症　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    21   TO  IDC1
               MOVE    27   TO  IDC2
               MOVE    33   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               COMPUTE WRK-ZAINUM    =    99980000
                                     +   (IDX16 + 31)
               MOVE    "40" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI
               MOVE    23   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE    "心大血管疾患リハ：治療開始　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    29   TO  IDC1
               MOVE    35   TO  IDC2
               MOVE    41   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-SINDAI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE  "早期・初期リハ加算：発症　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE  "早期・初期リハ加算：手術　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE  "早期・初期リハ加算：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-NOUKE
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    21  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "脳血管疾患等リハ：発症　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    21  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "脳血管疾患等リハ：手術　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    23  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE
                       "脳血管疾患等リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    21  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "脳血管疾患等リハ：診断　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-HAIYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       1
                 WHEN       3
                   MOVE    20  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "廃用症候群リハ：診断　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE
                       "廃用症候群リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-HAIYO-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE  "早期・初期リハ加算：発症　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE  "早期・初期リハ加算：手術　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE  "早期・初期リハ加算：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-UNDOKI
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    18  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "運動器リハ：発症　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    19  TO  IDC1
                   MOVE    25  TO  IDC2
                   MOVE    31  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    18  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "運動器リハ：手術　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    19  TO  IDC1
                   MOVE    25  TO  IDC2
                   MOVE    31  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    20  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "運動器リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    18  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "運動器リハ：診断　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    19  TO  IDC1
                   MOVE    25  TO  IDC2
                   MOVE    31  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-KOKYUKI
               MOVE    20   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE    "呼吸器リハ：治療開始　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    23   TO  IDC1
               MOVE    29   TO  IDC2
               MOVE    35   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-KOKYUKI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE  "早期・初期リハ加算：発症　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE  "早期・初期リハ加算：手術　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE  "早期・初期リハ加算：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-SESSYOKU
               MOVE    21   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE    "摂食機能療法：治療開始　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    25   TO  IDC1
               MOVE    31   TO  IDC2
               MOVE    37   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-NANBYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    19  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "難病患者リハ：発症　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    21  TO  IDC1
                   MOVE    27  TO  IDC2
                   MOVE    33  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    19  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "難病患者リハ：手術　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    21  TO  IDC1
                   MOVE    27  TO  IDC2
                   MOVE    33  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    21  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE    "難病患者リハ：急性増悪　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-SYOGAI
               MOVE    21   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE    "障害児（者）リハ：発症　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    25   TO  IDC1
               MOVE    31   TO  IDC2
               MOVE    37   TO  IDC3
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
           END-EVALUATE
      *
           MOVE    "1"        TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
      *
           PERFORM   VARYING   IDX12   FROM    1   BY  1
                      UNTIL  ( IDX12               >   49    )
                        OR   ( WK-FREE-NAME(IDX12) =   SPACE )
                ADD    1        TO  IDX-RECE85
                MOVE   "810000001"
                                TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                MOVE   ZERO     TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                MOVE   WK-FREE-YUKOKETA(IDX12)
                                TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                MOVE   WK-FREE-NAME(IDX12)
                                TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                MOVE   "1"      TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
           END-PERFORM
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
                PERFORM 800-RECE82-SET859-SEC
                MOVE    WRK-ZAINUM          TO  RECE859-ZAINUM
                MOVE    WRK-SRYKBN          TO  RECE859-SRYKBN
                ADD     1                   TO  WRK-RENNUM
                MOVE    WRK-RENNUM          TO  RECE859-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE85   =    1)
                   ADD         1            TO  IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE    1            TO  FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL (IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE859-SRYCD(1)  NOT =  SPACE
                     PERFORM 800-RECE859-WRITE-SEC
                END-IF
           END-PERFORM
      *
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    WRK-ZAINUM          TO  RECE849-ZAINUM
           MOVE    WRK-SRYKBN          TO  RECE849-SRYKBN
           MOVE    WRK-OKIKAEFLG       TO  RECE849-OKIKAEFLG
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       20011-HASSYO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集
      *****************************************************************
       20011-HASSYO-COM-201905-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO         TO  IDX-RECE85
           MOVE    SPACE        TO  WRK-RECE85XX-REC
           INITIALIZE               WRK-RECE85XX-REC
      *
           ADD     1            TO  IDX-RECE85
           MOVE    "810000001"  TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
           MOVE    ZERO         TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
      *
           MOVE    SPACE        TO  WRK-OKIKAEFLG
      *
           EVALUATE      WRK-SRYCD
             WHEN       CONS-KYUSEI
               MOVE    21   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "脳血管疾患急性発症　　　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    25   TO  IDC1
               MOVE    31   TO  IDC2
               MOVE    37   TO  IDC3
               MOVE    21   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               COMPUTE WRK-ZAINUM    =    99980000
                                     +   (IDX16 + 31)
               MOVE    "40" TO  WRK-SRYKBN
             WHEN       CONS-SINDAI
               MOVE    25   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "心大血管疾患リハ：治療開始　　　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    33   TO  IDC1
               MOVE    39   TO  IDC2
               MOVE    45   TO  IDC3
               MOVE    29   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-SINDAI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                 MOVE "早期・初期リハ加算：発症　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                 MOVE "早期・初期リハ加算：手術　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    26  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
             MOVE "早期・初期リハ加算：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    35  TO  IDC1
                   MOVE    41  TO  IDC2
                   MOVE    47  TO  IDC3
                   MOVE    31  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-NOUKE
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    23  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "脳血管疾患等リハ：発症　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    23  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "脳血管疾患等リハ：手術　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    25  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "脳血管疾患等リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    33  TO  IDC1
                   MOVE    39  TO  IDC2
                   MOVE    45  TO  IDC3
                   MOVE    29  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    23  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "脳血管疾患等リハ：診断　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-HAIYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       1
                 WHEN       3
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "廃用症候群リハ：診断　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   MOVE    23  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "廃用症候群リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-HAIYO-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "早期・初期リハ加算：発症　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "早期・初期リハ加算：手術　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    26  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
           MOVE "早期・初期リハ加算：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    35  TO  IDC1
                   MOVE    41  TO  IDC2
                   MOVE    47  TO  IDC3
                   MOVE    31  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-UNDOKI
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                   MOVE    20  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "運動器リハ：発症　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   MOVE    19  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    20  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "運動器リハ：手術　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   MOVE    19  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    22  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "運動器リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    27  TO  IDC1
                   MOVE    33  TO  IDC2
                   MOVE    39  TO  IDC3
                   MOVE    23  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       3
                   MOVE    20  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "運動器リハ：診断　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    23  TO  IDC1
                   MOVE    29  TO  IDC2
                   MOVE    35  TO  IDC3
                   MOVE    19  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-KOKYUKI
               MOVE    22   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "呼吸器リハ：治療開始　　　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    27   TO  IDC1
               MOVE    33   TO  IDC2
               MOVE    39   TO  IDC3
               MOVE    23   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-KOKYUKI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                 MOVE "早期・初期リハ加算：発症　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    24  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                 MOVE "早期・初期リハ加算：手術　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    31  TO  IDC1
                   MOVE    37  TO  IDC2
                   MOVE    43  TO  IDC3
                   MOVE    27  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    26  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
             MOVE "早期・初期リハ加算：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    35  TO  IDC1
                   MOVE    41  TO  IDC2
                   MOVE    47  TO  IDC3
                   MOVE    31  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-SESSYOKU
               MOVE    23   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "摂食機能療法：治療開始　　　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    29   TO  IDC1
               MOVE    35   TO  IDC2
               MOVE    41   TO  IDC3
               MOVE    25   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-NANBYO
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   MOVE    21  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "難病患者リハ：発症　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   MOVE    21  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       1
                   MOVE    21  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "難病患者リハ：手術　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    25  TO  IDC1
                   MOVE    31  TO  IDC2
                   MOVE    37  TO  IDC3
                   MOVE    21  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
                 WHEN       2
                   MOVE    23  TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE "難病患者リハ：急性増悪　　　　　年　　月　　日"
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE    29  TO  IDC1
                   MOVE    35  TO  IDC2
                   MOVE    41  TO  IDC3
                   MOVE    25  TO  IDC4
                   PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
             WHEN       CONS-SYOGAI
               MOVE    23   TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "障害児（者）リハ：発症　　　　　年　　月　　日"
                            TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
               MOVE    29   TO  IDC1
               MOVE    35   TO  IDC2
               MOVE    41   TO  IDC3
               MOVE    25   TO  IDC4
               PERFORM 200111-HASSYO-COMMENT-DATE-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99982200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99982200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99982200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
               IF   RECE82-HKNKBN    NOT  =  "4" AND "6"
                    MOVE    "80" TO  WRK-SRYKBN
               ELSE
                 EVALUATE  WRK-PARA-JIBAIPRTKBN
                  WHEN     "0"
                    MOVE    "40" TO  WRK-SRYKBN
                    MOVE    "1"  TO  WRK-OKIKAEFLG
                  WHEN     "1"
                    MOVE    "80" TO  WRK-SRYKBN
                 END-EVALUATE
               END-IF
           END-EVALUATE
      *
           MOVE    "1"        TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
      *
           PERFORM   VARYING   IDX12   FROM    1   BY  1
                      UNTIL  ( IDX12               >   49    )
                        OR   ( WK-FREE-NAME(IDX12) =   SPACE )
                ADD    1        TO  IDX-RECE85
                MOVE   "810000001"
                                TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                MOVE   ZERO     TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                MOVE   WK-FREE-YUKOKETA(IDX12)
                                TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                MOVE   WK-FREE-NAME(IDX12)
                                TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                MOVE   "1"      TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
           END-PERFORM
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
                PERFORM 800-RECE82-SET859-SEC
                MOVE    WRK-ZAINUM          TO  RECE859-ZAINUM
                MOVE    WRK-SRYKBN          TO  RECE859-SRYKBN
                ADD     1                   TO  WRK-RENNUM
                MOVE    WRK-RENNUM          TO  RECE859-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE85   =    1)
                   ADD         1            TO  IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE    1            TO  FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL (IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE859-SRYCD(1)  NOT =  SPACE
                     PERFORM 800-RECE859-WRITE-SEC
                END-IF
           END-PERFORM
      *
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    WRK-ZAINUM          TO  RECE849-ZAINUM
           MOVE    WRK-SRYKBN          TO  RECE849-SRYKBN
           MOVE    WRK-OKIKAEFLG       TO  RECE849-OKIKAEFLG
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       20011-HASSYO-COM-201905-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集（年月日）
      *****************************************************************
       200111-HASSYO-COMMENT-DATE-SEC          SECTION.
      *
           INITIALIZE                         STS-AREA-DAY
           INITIALIZE                         LNK-DAY2-AREA
           MOVE    "21"                   TO  LNK-DAY2-IRAI
           MOVE    WRK-KYUSEIYMD          TO  LNK-DAY2-YMD
           CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                          LNK-DAY2-AREA
           IF      STS-DAY-RC1            =   ZERO
              MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                       TO  WRK-RECE85XX-NAME(IDX-RECE85 1)(IDC1:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                       TO  WRK-RECE85XX-NAME(IDX-RECE85 1)(IDC2:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                       TO  WRK-RECE85XX-NAME(IDX-RECE85 1)(IDC3:4)
              END-IF
              IF   RECE82-SRYYM >= "201905"
                 MOVE    LNK-DAY2-EDTYMD2-G
                       TO  WRK-RECE85XX-NAME(IDX-RECE85 1)(IDC4:4)
              END-IF
           END-IF
      *
           .
       200111-HASSYO-COMMENT-DATE-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集
      *  ＃202008選択式コメント対応
      *****************************************************************
       20011-HASSYO-COM-202008-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO        TO  IDX-RECE85
           MOVE    SPACE       TO  WRK-RECE85XX-REC
           INITIALIZE              WRK-RECE85XX-REC
      *
           MOVE    SPACE       TO  WRK-OKIKAEFLG
      *
           MOVE    ZERO        TO  FLG-COM-HENSYU
           MOVE    ZERO        TO  FLG-COM-HENSYU2
           EVALUATE      WRK-SRYCD
             WHEN       CONS-SINDAI
               MOVE   68            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-SINDAI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   IF   RECE82-RSKSN-SYOKI-SIN  =  1
                     MOVE   74            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-SIN  =  1
                     MOVE   75            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       1
                   IF   RECE82-RSKSN-SYOKI-SIN  =  1
                     MOVE   574           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-SIN  =  1
                     MOVE   575           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       2
                   IF   RECE82-RSKSN-SYOKI-SIN  =  1
                     MOVE   1074          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-SIN  =  1
                     MOVE   1075          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-NOUKE
               IF  RECE82-SRYYM >= "202010"
                 EVALUATE   FLG-COMOKIKAE2
                   WHEN       0
                   WHEN       3
                     IF  (RECE82-SRYYM   >= "202204")
                     AND (FLG-COMOKIKAE2  =  3      )
                       MOVE 2070      TO  IDX-JIDO
                     ELSE
                       MOVE   70      TO  IDX-JIDO
                     END-IF
                   WHEN       1
                     MOVE   1070      TO  IDX-JIDO
                   WHEN       2
                     MOVE   1570      TO  IDX-JIDO
                 END-EVALUATE
               ELSE
                     MOVE     70      TO  IDX-JIDO
               END-IF
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-HAIYO
               MOVE   73            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99980800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99980800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99980800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-HAIYO-K
               MOVE     1   TO  FLG-COM-HENSYU
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   IF   RECE82-RSKSN-SYOKI-HAI  =  1
                     MOVE   74            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     1           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-HAI  =  1
                     MOVE   75            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     2           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                 WHEN       1
                   IF   RECE82-RSKSN-SYOKI-HAI  =  1
                     MOVE   574           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     1           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-HAI  =  1
                     MOVE   575           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     2           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                 WHEN       2
                   IF   RECE82-RSKSN-SYOKI-HAI  =  1
                     MOVE   1074          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     1           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-HAI  =  1
                     MOVE   1075          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                     MOVE     2           TO  FLG-COM-HENSYU2
                     PERFORM  200111-HASSYO-COM-202008X-SEC
                   END-IF
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981000 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981000 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981000
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-UNDOKI
               IF  RECE82-SRYYM >= "202010"
                 EVALUATE   FLG-COMOKIKAE2
                   WHEN       0
                   WHEN       3
                     IF  (RECE82-SRYYM   >= "202204")
                     AND (FLG-COMOKIKAE2  =  3      )
                       MOVE 2071      TO  IDX-JIDO
                     ELSE
                       MOVE   71      TO  IDX-JIDO
                     END-IF
                   WHEN       1
                     MOVE   1071      TO  IDX-JIDO
                   WHEN       2
                     MOVE   1571      TO  IDX-JIDO
                 END-EVALUATE
               ELSE
                     MOVE     71      TO  IDX-JIDO
               END-IF
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981200 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981200 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981200
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-KOKYUKI
               MOVE   69            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981400 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981400 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981400
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-KOKYUKI-K
               EVALUATE   FLG-COMOKIKAE2
                 WHEN       0
                 WHEN       3
                   IF   RECE82-RSKSN-SYOKI-KOK  =  1
                     MOVE   74            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-KOK  =  1
                     MOVE   75            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       1
                   IF   RECE82-RSKSN-SYOKI-KOK  =  1
                     MOVE   574           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-KOK  =  1
                     MOVE   575           TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                 WHEN       2
                   IF   RECE82-RSKSN-SYOKI-KOK  =  1
                     MOVE   1074          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
                   IF   RECE82-RSKSN-SOUKI-KOK  =  1
                     MOVE   1075          TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU2-SEC
                   END-IF
               END-EVALUATE
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981600 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981600 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981600
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
             WHEN       CONS-SESSYOKU
               MOVE   72            TO  IDX-JIDO
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-KYUSEIYMD TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU2-SEC
               EVALUATE    FLG-RIHA
                 WHEN        ZERO
                   COMPUTE WRK-ZAINUM    =  99981800 + 1
                 WHEN        1
                   COMPUTE WRK-ZAINUM    =  99981800 + 10 + 1
                 WHEN        2
                   COMPUTE WRK-ZAINUM    =  99981800
                                         + (IDX16 + (1 * 31))
               END-EVALUATE
           END-EVALUATE
      *
      *    疾患名編集
           IF  FLG-COM-HENSYU = ZERO
             PERFORM 200111-HASSYO-COM-202008X-SEC
           END-IF
      *
           IF   RECE82-HKNKBN  NOT =  "4" AND "6"
                 MOVE    "80"  TO  WRK-SRYKBN
           ELSE
             EVALUATE  WRK-PARA-JIBAIPRTKBN
               WHEN     "0"
                 MOVE    "40"  TO  WRK-SRYKBN
                 MOVE    "1"   TO  WRK-OKIKAEFLG
               WHEN     "1"
               WHEN     "2"
                 MOVE    "80"  TO  WRK-SRYKBN
             END-EVALUATE
           END-IF
      *
      *    科・日付の編集を含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
                PERFORM 800-RECE82-SET859-SEC
                MOVE    WRK-ZAINUM           TO  RECE859-ZAINUM
                MOVE    WRK-SRYKBN           TO  RECE859-SRYKBN
                ADD     1                    TO  WRK-RENNUM
                MOVE    WRK-RENNUM           TO  RECE859-RENNUM
                PERFORM  VARYING   IDX   FROM   1   BY   1
                          UNTIL   (IDX             >    5)   OR
                                  (FLG-WRKRECE85   =    1)
                   ADD         1             TO    IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE    1             TO    FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL (IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL (IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
                END-PERFORM
                IF   RECE859-SRYCD(1)  NOT =  SPACE
                     PERFORM 800-RECE859-WRITE-SEC
                END-IF
           END-PERFORM
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    WRK-ZAINUM          TO  RECE849-ZAINUM
           MOVE    WRK-SRYKBN          TO  RECE849-SRYKBN
           MOVE    WRK-OKIKAEFLG       TO  RECE849-OKIKAEFLG
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       20011-HASSYO-COM-202008-EXT.
           EXIT.
      *
      *****************************************************************
      *    発症日のコメント編集（疾患名編集）
      *  ＃202008選択式コメント対応
      *****************************************************************
       200111-HASSYO-COM-202008X-SEC          SECTION.
      *
           PERFORM  VARYING  IDX12  FROM  1  BY  1
                     UNTIL  (IDX12                >   50  )
                       OR   (WK-FREE-NAME2(IDX12) =  SPACE)
               IF  WK-FREE-SRYCD2(IDX12) = "999999999"
                 MOVE    ZERO      TO  IDX-JIDO
                 EVALUATE  WRK-SRYCD
                   WHEN     CONS-SINDAI
                      MOVE    568  TO  IDX-JIDO
                   WHEN     CONS-NOUKE
                      MOVE    570  TO  IDX-JIDO
                   WHEN     CONS-HAIYO
                      MOVE    573  TO  IDX-JIDO
                   WHEN     CONS-UNDOKI
                      MOVE    571  TO  IDX-JIDO
                   WHEN     CONS-KOKYUKI
                      MOVE    569  TO  IDX-JIDO
                   WHEN     CONS-SESSYOKU
                      MOVE    572  TO  IDX-JIDO
                   WHEN     CONS-HAIYO-K
                     IF  RECE82-SRYYM >= "202204"
                      IF   FLG-COM-HENSYU2  =  1
                       MOVE  1574  TO  IDX-JIDO
                      END-IF
                      IF   FLG-COM-HENSYU2  =  2
                       MOVE  1575  TO  IDX-JIDO
                      END-IF
                     END-IF
                 END-EVALUATE
                 PERFORM  200111-RECECOMMENT-IDXGET-SEC
                 MOVE   WK-FREE-INPUTCOMENT2(IDX12)
                                   TO  WRK-RECECOM-COMMENT
      *
                 INITIALIZE                  ORCSRECECOMMENTAREA
                 MOVE  WRK-RECECOM-AREA   TO ORCSRECECOMMENT-IN-AREA
                 CALL  "ORCSRECECOMMENT"  USING  ORCSRECECOMMENTAREA
                                                 SPA-AREA
                 IF    LNK-RECECOMMENT-RC  =  ZERO
                   ADD  1     TO  IDX-RECE85
                   MOVE LNK-RECECOMMENT-SRYCD
                              TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                   MOVE ZERO  TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                   MOVE LNK-RECECOMMENT-YUKOKETA
                              TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                   MOVE LNK-RECECOMMENT-NAME
                              TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                   MOVE LNK-RECECOMMENT-INPUTCOMMENT
                              TO  WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)
                   MOVE "1"   TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
                 END-IF
               ELSE
                 ADD    1     TO  IDX-RECE85
                 MOVE   WK-FREE-SRYCD2(IDX12)
                              TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                 MOVE   ZERO  TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                 MOVE   WK-FREE-YUKOKETA2(IDX12)
                              TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                 MOVE   WK-FREE-NAME2(IDX12)
                              TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                 MOVE   WK-FREE-INPUTCOMENT2(IDX12)
                              TO  WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)
                 MOVE   "1"   TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
               END-IF
           END-PERFORM
      *
           .
       200111-HASSYO-COM-202008X-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ発症日があるか判定
      *****************************************************************
       20011-RIHABIRIHASSYO-HANTEI-SEC          SECTION.
      *
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT2
           MOVE     SPACE    TO     WRK-RIHASANTEI-END
           INITIALIZE               TBL-RIHASANTEI-DAY-END
           INITIALIZE               TBL-RIHASANTEI-DAY-END2
           INITIALIZE               TBL-RIHASANTEI-DAY-END3
      *
      *    リハ終了日
      *
      *    算定履歴検索
           INITIALIZE                  SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    WRK-SRYCD2          TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    RECE82-HKNCOMBI     TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
      *
                MOVE    "tbl_santei"   TO  MCP-TABLE
                MOVE    "key3"         TO  MCP-PATHNAME
                PERFORM  900-SANTEI-READ-SEC
      *
                PERFORM   UNTIL  ( FLG-SANTEI          =  1 ) OR
                                 ( FLG-KYUSEI-COMMENT2 =  1 )
      *
                 IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                  IF   SANTEI-SRYYM  =  RECE82-SRYYM
                   PERFORM   VARYING   IDX3   FROM   1  BY   1
                              UNTIL    IDX3    >    31
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                        MOVE    1   TO   TB-RIHASANTEI-DAY-END(IDX3)
      *
                     END-IF
      *
                   END-PERFORM
                  ELSE
                   PERFORM   VARYING   IDX3   FROM  31  BY  -1
                              UNTIL  ( IDX3                <   1 )
                                OR   ( FLG-KYUSEI-COMMENT2 =   1 )
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                        MOVE  SANTEI-SRYYM  TO  WRK-RIHASANTEI-END(1:6)
                        MOVE  IDX3          TO  WRK-RIHASANTEI-END(7:2)
      *
                        MOVE  1             TO  FLG-KYUSEI-COMMENT2
      *
                     END-IF
      *
                   END-PERFORM
                  END-IF
                 END-IF
      *
                 MOVE    "tbl_santei"   TO  MCP-TABLE
                 MOVE    "key3"         TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
      *
                END-PERFORM
      *
           END-IF
      *
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
      ********
      *
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT
           MOVE     ZERO     TO     FLG-KYUSEI-COMMENT2
           MOVE     ZERO     TO     WRK-KYUSEIYMD
           INITIALIZE               TBL-RIHASANTEI-DAY
           MOVE     SPACE    TO     WRK-RIHASANTEI-YMD
           MOVE     SPACE    TO     WRK-RIHASANTEI-YMD2
           MOVE     SPACE    TO     WRK-RIHASANTEI-YMD3
           MOVE     ZERO     TO     WRK-RIHASANTEI41-FLG
      *
      *    リハ開始日
      *
      *    当月の先頭のリハビリ算定日
           MOVE     ZERO           TO  RIHA-ST2
           PERFORM  VARYING  RIHA-IDX  FROM   1  BY   1
                     UNTIL   RIHA-IDX    >   31
             IF     TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO
               MOVE     RIHA-IDX   TO  RIHA-ST2
               MOVE     31         TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    算定履歴検索
           INITIALIZE                  SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    WRK-SRYCD           TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    RECE82-HKNCOMBI     TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
      *
                MOVE    "tbl_santei"   TO  MCP-TABLE
                MOVE    "key3"         TO  MCP-PATHNAME
                PERFORM  900-SANTEI-READ-SEC
      *
                PERFORM   UNTIL  ( FLG-SANTEI          =  1 ) OR
                                 ( FLG-KYUSEI-COMMENT2 =  1 )
      *
                 IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                  IF   SANTEI-SRYYM  =  RECE82-SRYYM
                   PERFORM  VARYING   IDX3   FROM   1  BY  1
                             UNTIL    IDX3    >    31
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
      *
                         MOVE   1     TO  TB-RIHASANTEI-DAY(IDX3)
      *
                         MOVE   1     TO  FLG-KYUSEI-COMMENT
      *
                         IF    (SANTEI-SRYYM = "200604")
                         AND   (IDX3         =  1      )
                            MOVE    1    TO   WRK-RIHASANTEI41-FLG
                         END-IF
      **>                IF    (SANTEI-SRYYM  NOT = "200604")
      **>                AND   (IDX3              =  1      )
      **>                   MOVE   1     TO   FLG-KYUSEI-COMMENT2
      **>                END-IF
      *
                     END-IF
      *
                   END-PERFORM
                  ELSE
                   PERFORM  VARYING   IDX3   FROM  31  BY  -1
                             UNTIL   ( IDX3                <   1 )
                               OR    ( FLG-KYUSEI-COMMENT2 =   1 )
      *
                     IF   SANTEI-DAY(IDX3)  NOT =  ZERO
                       PERFORM  200111-RIHA-SANTEIPLUS-SEC
                     END-IF
      *
                     IF  (SANTEI-DAY(IDX3)  NOT =  ZERO)
                     AND (FLG-SANTEIPLUS-HANTEI =  ZERO)
                       MOVE  SANTEI-SRYYM    TO WRK-RIHASANTEI-YMD2(1:6)
                       MOVE  IDX3            TO WRK-RIHASANTEI-YMD2(7:2)
                       IF   (WRK-RIHASANTEI-YMD   = SPACE     )
                       OR   (WRK-RIHASANTEI-YMD   = "20060401")
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           MOVE  WRK-RIHASANTEI-YMD2
                                             TO WRK-RIHASANTEI-YMD
                           MOVE  1           TO FLG-KYUSEI-COMMENT
                           IF  (SANTEIPLUS-ENDYMD   NOT =  SPACE       )
                           AND (SANTEIPLUS-ENDYMD(1:6)  =  RECE82-SRYYM)
                           AND (IDX43                  >=  RIHA-ST2    )
                             MOVE   1   TO TB-RIHASANTEI-DAY-END3(IDX43)
                           END-IF
                         END-IF
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           IF   (WRK-RIHASANTEI41-FLG =  1        )
                           AND  (WRK-RIHASANTEI-YMD2  < "20060401")
                             MOVE  ZERO      TO TB-RIHASANTEI-DAY(1)
                           END-IF
                         END-IF
                       ELSE
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           MOVE  WRK-RIHASANTEI-YMD2
                                             TO WRK-RIHASANTEI-YMD3
                         END-IF
                         MOVE     1          TO FLG-KYUSEI-COMMENT2
                         IF  (WRK-RIHASANTEI-END  = SPACE              )
                         OR  (WRK-RIHASANTEI-END  < WRK-RIHASANTEI-YMD2)
                           IF    WRK-RIHASANTEI-YMD2  = "20060401"
                             MOVE  ZERO      TO FLG-KYUSEI-COMMENT2
                           END-IF
                         END-IF
                       END-IF
                     END-IF
      *
                   END-PERFORM
                  END-IF
                 END-IF
      *
                 MOVE    "tbl_santei"   TO  MCP-TABLE
                 MOVE    "key3"         TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
      *
                END-PERFORM
      *
           END-IF
      *
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
      ***
      *
      *    当月先頭のリハビリ算定日より前に当月のリハビリ終了日があれば
      *    前月以前の直近のリハビリ開始日をクリアする
      *    及び、
      *    当月のリハビリ終了日より前の当月のリハビリ開始日をクリアする
           IF    RIHA-ST2            NOT = ZERO
             PERFORM  VARYING  RIHA-IDX  FROM   1  BY   1
                       UNTIL   RIHA-IDX    >   31
               IF    (TB-RIHASANTEI-DAY-END(RIHA-IDX) NOT = ZERO)
               AND   (RIHA-ST2  >  RIHA-IDX                     )
                 MOVE   SPACE      TO  WRK-RIHASANTEI-YMD
                 MOVE   SPACE      TO  WRK-RIHASANTEI-YMD3
                 PERFORM  VARYING  RIHA-IDX2  FROM  1  BY  1
                           UNTIL   RIHA-IDX2    >  31
                   IF    (TB-RIHASANTEI-DAY(RIHA-IDX2)  NOT = ZERO)
                   AND   (RIHA-IDX  >= RIHA-IDX2                  )
                     MOVE  ZERO    TO  TB-RIHASANTEI-DAY(RIHA-IDX2)
                   END-IF
                 END-PERFORM
               END-IF
             END-PERFORM
           END-IF
      *
      *    リハビリ開始日を退避
           INITIALIZE                     WRK-CHECK-RIHASANTEI-AREA
           MOVE  TBL-RIHASANTEI-DAY   TO  WRK-CHECK-RIHASANTEI-DAY-OCC
           MOVE  WRK-RIHASANTEI-YMD   TO  WRK-CHECK-RIHASANTEI-YMD
           MOVE  WRK-RIHASANTEI-YMD3  TO  WRK-CHECK-RIHASANTEI-YMD3
      *
      *    当月のリハビリ開始日より後に当月のリハビリ算定日がなければ
      *    当月のリハビリ開始日をクリアする
           MOVE     ZERO       TO  FLG-OK
           PERFORM  VARYING  RIHA-IDX  FROM  31  BY  -1
                     UNTIL   RIHA-IDX    <    1
             IF     TB-RIHASANTEI-DAY(RIHA-IDX)  NOT = ZERO
               PERFORM   200111-RIHA-SANTEIPLUS2-SEC
               MOVE      ZERO  TO  FLG-OK
               PERFORM  VARYING  RIHA-IDX2  FROM  1  BY  1
                         UNTIL   RIHA-IDX2    >  31
                 IF    (TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX2) NOT = ZERO)
                 AND   (RIHA-IDX  <=  RIHA-IDX2                      )
                 AND   (IDX43     >=  RIHA-IDX2                      )
                   MOVE  ZERO  TO  TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX2)
                   MOVE  1     TO  FLG-OK
                 END-IF
               END-PERFORM
               IF   FLG-OK  =  ZERO
                 MOVE    ZERO  TO  TB-RIHASANTEI-DAY(RIHA-IDX)
               ELSE
                 IF  IDX43  NOT =  99
                   MOVE  1     TO  TB-RIHASANTEI-DAY-END2(IDX43)
                 END-IF
               END-IF
             END-IF
           END-PERFORM
      *
      *    当月の先頭のリハビリ開始日
           MOVE     ZERO           TO  RIHA-ST
           PERFORM  VARYING  RIHA-IDX  FROM   1  BY   1
                     UNTIL   RIHA-IDX    >   31
             IF     TB-RIHASANTEI-DAY(RIHA-IDX)  NOT = ZERO
               MOVE   RIHA-IDX     TO  RIHA-ST
               MOVE   31           TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    当月のリハビリ開始日に当月の終了日の入力（算定履歴で入力）
      *    があり、その中で一番月末に近い日
           MOVE     99             TO  RIHA-ED
           PERFORM  VARYING  RIHA-IDX  FROM  31  BY  -1
                     UNTIL   RIHA-IDX    <    1
             IF     TB-RIHASANTEI-DAY-END2(RIHA-IDX)  NOT = ZERO
               MOVE   RIHA-IDX     TO  RIHA-ED
               MOVE   1            TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    直近のリハビリ開始日に入力した当月の終了日（算定履歴で入力）
           MOVE     99             TO  RIHA-ED2
           PERFORM  VARYING  RIHA-IDX  FROM  31  BY  -1
                     UNTIL   RIHA-IDX    <    1
             IF     TB-RIHASANTEI-DAY-END3(RIHA-IDX)  NOT = ZERO
               MOVE   RIHA-IDX     TO  RIHA-ED2
               MOVE   1            TO  RIHA-IDX
             END-IF
           END-PERFORM
      *
      *    当月先頭のリハビリ開始日より前に当月のリハビリ算定日がなければ
      *    前月以前の直近のリハビリ開始日をクリアする
           MOVE     ZERO           TO  FLG-OK
           IF    WRK-RIHASANTEI-YMD  NOT = SPACE
             IF  RIHA-ST             NOT = ZERO
               PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                         UNTIL   RIHA-IDX    >  31
                 IF ((TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO) AND
                     (RIHA-ST   >  RIHA-IDX                       ))
                 OR ((TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO) AND
                     (RIHA-ED   <  RIHA-IDX                       ))
                   MOVE   1        TO  FLG-OK
                 END-IF
               END-PERFORM
               IF    FLG-OK  =  ZERO
                 MOVE     SPACE    TO  WRK-RIHASANTEI-YMD
                 MOVE     SPACE    TO  WRK-RIHASANTEI-YMD3
               ELSE
                 MOVE     ZERO     TO  FLG-OK
                 PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                           UNTIL   RIHA-IDX    >  31
                   IF  (TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO)
                   AND (RIHA-ED2  <  RIHA-IDX                       )
                     MOVE   1      TO  FLG-OK
                   END-IF
                 END-PERFORM
                 IF    FLG-OK  =  ZERO
                   MOVE     SPACE  TO  WRK-RIHASANTEI-YMD3
                 END-IF
               END-IF
             ELSE
               PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                         UNTIL   RIHA-IDX    >  31
                 IF  (TBL-HASSYO-TAIHI-SANTEI(RIHA-IDX) NOT = ZERO)
                 AND (RIHA-ED2  <  RIHA-IDX                       )
                   MOVE   1        TO  FLG-OK
                 END-IF
               END-PERFORM
               IF    FLG-OK  =  ZERO
                 MOVE     SPACE    TO  WRK-RIHASANTEI-YMD3
               END-IF
             END-IF
           END-IF
      *
           IF   (TBL-HASSYO-TAIHIYMD1-FLG  =  1)
           AND  (FLG-KYUSEI-COMMENT        =  1)
             INITIALIZE                     TBL-RIHASANTEI-DAY
             MOVE     SPACE            TO   WRK-RIHASANTEI-YMD
             MOVE     SPACE            TO   WRK-RIHASANTEI-YMD3
      *
             IF  (TBL-HASSYO-TAIHIYMD11(1) NOT = SPACE                )
             AND (TBL-HASSYO-TAIHIYMD11(1) = WRK-CHECK-RIHASANTEI-YMD
                                          OR WRK-CHECK-RIHASANTEI-YMD3)
                 CONTINUE
             ELSE
                 MOVE  SPACE  TO  TBL-HASSYO-TAIHIYMD11(1)
             END-IF
             IF  (TBL-HASSYO-TAIHIYMD11(2) NOT = SPACE                )
             AND (TBL-HASSYO-TAIHIYMD11(2) = WRK-CHECK-RIHASANTEI-YMD
                                          OR WRK-CHECK-RIHASANTEI-YMD3)
                 CONTINUE
             ELSE
                 MOVE  SPACE  TO  TBL-HASSYO-TAIHIYMD11(2)
             END-IF
      *
             IF  (TBL-HASSYO-TAIHIYMD11(1) NOT = SPACE)
             AND (TBL-HASSYO-TAIHIYMD11(2) NOT = SPACE)
               IF TBL-HASSYO-TAIHIYMD11(2) > TBL-HASSYO-TAIHIYMD11(1)
                 MOVE TBL-HASSYO-TAIHIYMD11(1) TO WRK-RIHASANTEI-YMD3
                 MOVE TBL-HASSYO-TAIHIYMD11(2) TO WRK-RIHASANTEI-YMD
               ELSE
                 MOVE TBL-HASSYO-TAIHIYMD11(2) TO WRK-RIHASANTEI-YMD3
                 MOVE TBL-HASSYO-TAIHIYMD11(1) TO WRK-RIHASANTEI-YMD
               END-IF
             ELSE
               IF TBL-HASSYO-TAIHIYMD11(1) NOT = SPACE
                 MOVE TBL-HASSYO-TAIHIYMD11(1) TO WRK-RIHASANTEI-YMD
               END-IF
               IF TBL-HASSYO-TAIHIYMD11(2) NOT = SPACE
                 MOVE TBL-HASSYO-TAIHIYMD11(2) TO WRK-RIHASANTEI-YMD
               END-IF
             END-IF
      *
             PERFORM  VARYING  RIHA-IDX  FROM  1  BY  1
                       UNTIL   RIHA-IDX    >  31
               IF    (TBL-HASSYO-TAIHIYMD12(RIHA-IDX)  NOT = ZERO)
               AND   (WRK-CHECK-RIHASANTEI-DAY(RIHA-IDX)   = ZERO)
                 MOVE  ZERO  TO  TBL-HASSYO-TAIHIYMD12(RIHA-IDX)
               END-IF
             END-PERFORM
             MOVE  TBL-HASSYO-TAIHIYMD1-DAY-OCC2
                             TO  TBL-RIHASANTEI-DAY
           END-IF
      *
      ***
      *
           IF      FLG-KYUSEI-COMMENT    =      1
               IF  WRK-RIHASANTEI-YMD3 NOT = SPACE
                     MOVE   ZERO   TO  FLG-RIHA
                     MOVE   WRK-RIHASANTEI-YMD3
                                   TO  WRK-KYUSEIYMD
                     PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
                     IF     RECE82-SRYYM >= "202008"
                       PERFORM    20011-HASSYO-COM-202008-SEC
                     ELSE
                       IF   RECE82-SRYYM >= "201905"
                         PERFORM  20011-HASSYO-COM-201905-SEC
                       ELSE
                         PERFORM  20011-HASSYO-COMMENT-SEC
                       END-IF
                     END-IF
               END-IF
               IF  WRK-RIHASANTEI-YMD  NOT = SPACE
                     MOVE   1      TO  FLG-RIHA
                     MOVE   WRK-RIHASANTEI-YMD
                                   TO  WRK-KYUSEIYMD
                     PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
                     IF     RECE82-SRYYM >= "202008"
                       PERFORM    20011-HASSYO-COM-202008-SEC
                     ELSE
                       IF   RECE82-SRYYM >= "201905"
                         PERFORM  20011-HASSYO-COM-201905-SEC
                       ELSE
                         PERFORM  20011-HASSYO-COMMENT-SEC
                       END-IF
                     END-IF
               END-IF
               PERFORM   VARYING   IDX16    FROM   1   BY   1
                          UNTIL    IDX16      >   31
                 IF  TB-RIHASANTEI-DAY(IDX16)  NOT = ZERO
                     MOVE   2      TO  FLG-RIHA
                     MOVE   RECE82-SRYYM
                                   TO  WRK-KYUSEIYMD(1:6)
                     MOVE   IDX16  TO  WRK-KYUSEIYMD(7:2)
                     PERFORM    20011-KYUSEIHASSYO-KENSAKU-SEC
                     IF     RECE82-SRYYM >= "202008"
                       PERFORM    20011-HASSYO-COM-202008-SEC
                     ELSE
                       IF   RECE82-SRYYM >= "201905"
                         PERFORM  20011-HASSYO-COM-201905-SEC
                       ELSE
                         PERFORM  20011-HASSYO-COMMENT-SEC
                       END-IF
                     END-IF
                 END-IF
               END-PERFORM
           END-IF
      *
           .
       20011-RIHABIRIHASSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ・算定履歴付加判定
      *    （リハ開始日の終了日と診療月をチェック）（履歴番号＝０のデータ）
      *****************************************************************
       200111-RIHA-SANTEIPLUS-SEC          SECTION.
      *
           MOVE    ZERO                TO  FLG-SANTEIPLUS-HANTEI
           MOVE    ZERO                TO  IDX43
      *
           INITIALIZE                      SANTEIPLUS-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEIPLUS-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEIPLUS-PTID
           MOVE    SANTEI-SRYYM        TO  SANTEIPLUS-SRYYM
           MOVE    WRK-SRYCD           TO  SANTEIPLUS-SRYCD
           MOVE    ZERO                TO  SANTEIPLUS-NYUGAIKBN
           MOVE    ZERO                TO  SANTEIPLUS-SRYKA
           MOVE    RECE82-HKNCOMBI     TO  SANTEIPLUS-HKNCOMBINUM
           MOVE    IDX3                TO  SANTEIPLUS-DAYKEY
           MOVE    SANTEIPLUS-REC      TO  MCPDATA-REC
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC           =  ZERO
             MOVE  "tbl_santeiplus"    TO  MCP-TABLE
             MOVE  "key4"              TO  MCP-PATHNAME
             PERFORM  900-SANTEIPLUS-READ-SEC
             IF    FLG-SANTEIPLUS   =  ZERO
               MOVE  SANTEIPLUS-ENDYMD(7:2)  TO  IDX43
               IF  ((SANTEIPLUS-ENDYMD   NOT =  SPACE       ) AND
                    (SANTEIPLUS-ENDYMD(1:6)  <  RECE82-SRYYM))
               OR  ((SANTEIPLUS-ENDYMD   NOT =  SPACE       ) AND
                    (SANTEIPLUS-ENDYMD(1:6)  =  RECE82-SRYYM) AND
                    (IDX43                   <  RIHA-ST2    ))
                  MOVE     1           TO  FLG-SANTEIPLUS-HANTEI
               END-IF
             END-IF
           END-IF
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       200111-RIHA-SANTEIPLUS-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ・算定履歴付加判定
      *    （リハ開始日の終了日と診療月をチェック）（履歴番号＝０のデータ）
      *****************************************************************
       200111-RIHA-SANTEIPLUS2-SEC          SECTION.
      *
           MOVE    99                  TO  IDX43
      *
           INITIALIZE                      SANTEIPLUS-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEIPLUS-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEIPLUS-PTID
           MOVE    RECE82-SRYYM        TO  SANTEIPLUS-SRYYM
           MOVE    WRK-SRYCD           TO  SANTEIPLUS-SRYCD
           MOVE    ZERO                TO  SANTEIPLUS-NYUGAIKBN
           MOVE    ZERO                TO  SANTEIPLUS-SRYKA
           MOVE    RECE82-HKNCOMBI     TO  SANTEIPLUS-HKNCOMBINUM
           MOVE    RIHA-IDX            TO  SANTEIPLUS-DAYKEY
           MOVE    SANTEIPLUS-REC      TO  MCPDATA-REC
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC           =  ZERO
             MOVE  "tbl_santeiplus"    TO  MCP-TABLE
             MOVE  "key4"              TO  MCP-PATHNAME
             PERFORM  900-SANTEIPLUS-READ-SEC
             IF    FLG-SANTEIPLUS   =  ZERO
               IF   (SANTEIPLUS-ENDYMD   NOT =  SPACE       )
               AND  (SANTEIPLUS-ENDYMD(1:6)  =  RECE82-SRYYM)
                 MOVE  SANTEIPLUS-ENDYMD(7:2)  TO  IDX43
               END-IF
             END-IF
           END-IF
           MOVE    "tbl_santeiplus"    TO  MCP-TABLE
           MOVE    "key4"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       200111-RIHA-SANTEIPLUS2-EXT.
           EXIT.
      *
      *****************************************************************
      *    自賠責従来様式：加算率 のコメント編集
      *****************************************************************
       2001-KASANRITU-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999998            TO  RECE849-ZAINUM
           MOVE    "99"                TO  RECE849-SRYKBN
           MOVE    1                   TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999998            TO  RECE859-ZAINUM
           MOVE    "99"                TO  RECE859-SRYKBN
      *    加算率のコメントの挿入
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
           MOVE   "810000001"          TO  WRK-RECE85XX-SRYCD(1 1)
           MOVE    ZERO                TO  WRK-RECE85XX-SRYSURYO(1 1)
           MOVE    9                   TO  WRK-RECE85XX-YUKOKETA(1 1)
           MOVE   "加算率（　．　　）"
                                       TO  WRK-RECE85XX-NAME(1 1)
      *
           MOVE    RECE82-KSNRATE(1:1) TO  DAY-IDX3
           PERFORM    20011-KASANRITU-HENSYU-SEC
           MOVE    WRK-HENSYU-KASANRITU2 TO WRK-RECE85XX-NAME(1 1)(9:2)
           MOVE    RECE82-KSNRATE(2:1) TO  DAY-IDX3
           PERFORM    20011-KASANRITU-HENSYU-SEC
           MOVE    WRK-HENSYU-KASANRITU2 TO WRK-RECE85XX-NAME(1 1)(13:2)
           MOVE    RECE82-KSNRATE(3:1) TO  DAY-IDX3
           PERFORM    20011-KASANRITU-HENSYU-SEC
           MOVE    WRK-HENSYU-KASANRITU2 TO WRK-RECE85XX-NAME(1 1)(15:2)
      *
           MOVE     "1"                TO  WRK-RECE85XX-SIKFLG(1 1)
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       2001-KASANRITU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    加算率編集
      *****************************************************************
       20011-KASANRITU-HENSYU-SEC          SECTION.
      *
           MOVE    SPACE                TO  WRK-HENSYU-KASANRITU
           MOVE    SPACE                TO  WRK-HENSYU-KASANRITU2
      *
           MOVE    DAY-IDX3             TO  WRK-HENSYU-KASANRITU
      *
           INITIALIZE                       ORCSKANACHKAREA
           MOVE    "2"                  TO  KANACHK-SYORI
           MOVE    WRK-HENSYU-KASANRITU TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
           IF      KANACHK-RC      =   ZERO
                MOVE    KANACHK-OUT-INPUT(1:2)
                                        TO  WRK-HENSYU-KASANRITU2
           END-IF
      *
           .
       20011-KASANRITU-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    自賠責従来様式：薬剤等点単価 のコメント編集
      *****************************************************************
       2001-YKZTENTANKA-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999998            TO  RECE849-ZAINUM
           MOVE    "99"                TO  RECE849-SRYKBN
           MOVE    1                   TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999998            TO  RECE859-ZAINUM
           MOVE    "99"                TO  RECE859-SRYKBN
      *    薬剤等点単価のコメントの挿入
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
           MOVE   "810000001"          TO  WRK-RECE85XX-SRYCD(1 1)
           MOVE    ZERO                TO  WRK-RECE85XX-SRYSURYO(1 1)
           MOVE    13                  TO  WRK-RECE85XX-YUKOKETA(1 1)
           MOVE    "薬剤等（１点単価　　　円）"
                                       TO  WRK-RECE85XX-NAME(1 1)
      *
           MOVE    RECE82-YKZTENTANKA(1:1)  TO  DAY-IDX3
           PERFORM    20011-KASANRITU-HENSYU-SEC
           IF      WRK-HENSYU-KASANRITU2   =   "０"
              MOVE   "　"   TO   WRK-HENSYU-KASANRITU2
           END-IF
           MOVE    WRK-HENSYU-KASANRITU2 TO WRK-RECE85XX-NAME(1 1)(19:2)
           MOVE    RECE82-YKZTENTANKA(2:1)  TO  DAY-IDX3
           PERFORM    20011-KASANRITU-HENSYU-SEC
           MOVE    WRK-HENSYU-KASANRITU2 TO WRK-RECE85XX-NAME(1 1)(21:2)
      *
           MOVE     "1"                TO  WRK-RECE85XX-SIKFLG(1 1)
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       2001-YKZTENTANKA-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    在支援のコメント編集
      *****************************************************************
       2001-ZAISIEN-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999965            TO  RECE849-ZAINUM
           MOVE    WRK-RECE84-SRYKBN   TO  RECE849-SRYKBN
      *
           MOVE    1                   TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999965            TO  RECE859-ZAINUM
           MOVE    WRK-RECE84-SRYKBN   TO  RECE859-SRYKBN
      *    在支援コメントの挿入
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
           MOVE    "810000001"         TO  WRK-RECE85XX-SRYCD(1 1)
           MOVE     ZERO               TO  WRK-RECE85XX-SRYSURYO(1 1)
           MOVE     3                  TO  WRK-RECE85XX-YUKOKETA(1 1)
           EVALUATE  TBL-ZAISIEN-COMMENT
             WHEN      1
               MOVE    "在支援"        TO  WRK-RECE85XX-NAME(1 1)
             WHEN      2
               MOVE    "在支病"        TO  WRK-RECE85XX-NAME(1 1)
           END-EVALUATE
           MOVE     "1"                TO  WRK-RECE85XX-SIKFLG(1 1)
      *
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       2001-ZAISIEN-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    特別のコメント（特別な関係にある他院）
      *****************************************************************
       2001-TAIN-TOKUBETU-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999990            TO  RECE849-ZAINUM
           MOVE    "99"                TO  RECE849-SRYKBN
           MOVE    1                   TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999990            TO  RECE859-ZAINUM
           MOVE    "99"                TO  RECE859-SRYKBN
      *
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
           MOVE   "810000001"          TO  WRK-RECE85XX-SRYCD(1 1)
           MOVE    ZERO                TO  WRK-RECE85XX-SRYSURYO(1 1)
           MOVE    4                   TO  WRK-RECE85XX-YUKOKETA(1 1)
           MOVE   "（特別）"           TO  WRK-RECE85XX-NAME(1 1)
      *
           MOVE     "1"                TO  WRK-RECE85XX-SIKFLG(1 1)
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       2001-TAIN-TOKUBETU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    標準負担額経過措置（精神）入院年月日のコメント
      *****************************************************************
       2001-SEISIN-SKJ-COMMENT-SEC          SECTION.
      *
           PERFORM 800-RECE82-SET849-SEC
           MOVE    99999975            TO  RECE849-ZAINUM
           MOVE    "99"                TO  RECE849-SRYKBN
           MOVE    "991"               TO  RECE849-SRYSYUKBN
           MOVE    1                   TO  RECE849-MEISAISU
      *
           MOVE    RECE82-HKNCOMBI     TO  RECE849-HKNCOMBI
           WRITE   RECE849-REC
           ADD     1                   TO  CNT-RECE849
      *
           PERFORM 800-RECE82-SET859-SEC
           MOVE    99999975            TO  RECE859-ZAINUM
           MOVE    "99"                TO  RECE859-SRYKBN
           MOVE    "991"               TO  RECE859-SRYSYUKBN
      *
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
           EVALUATE   LNK-DAY2-EDTYMD1-G
             WHEN       "H"
               MOVE  "840000136" TO  WRK-RECE85XX-SRYCD(1 1)
               MOVE   ZERO       TO  WRK-RECE85XX-SRYSURYO(1 1)
               MOVE   31         TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE  "標準負担額経過措置（精神）入院年月日："
                                 TO  WRK-RECE85XX-NAME(1 1)(1:38)
               MOVE  "平成　　　年　　月　　日"
                                 TO  WRK-RECE85XX-NAME(1 1)(39:24)
             WHEN       "S"
               MOVE  "840000140" TO  WRK-RECE85XX-SRYCD(1 1)
               MOVE   ZERO       TO  WRK-RECE85XX-SRYSURYO(1 1)
               MOVE   31         TO  WRK-RECE85XX-YUKOKETA(1 1)
               MOVE  "標準負担額経過措置（精神）入院年月日："
                                 TO  WRK-RECE85XX-NAME(1 1)(1:38)
               MOVE  "昭和　　　年　　月　　日"
                                 TO  WRK-RECE85XX-NAME(1 1)(39:24)
           END-EVALUATE
      *
      ***  INITIALIZE                         STS-AREA-DAY
      ***  INITIALIZE                         LNK-DAY2-AREA
      ***  MOVE    "21"                   TO  LNK-DAY2-IRAI
      ***  MOVE  RECE82-SEISIN-NYUINYMD   TO  LNK-DAY2-YMD
      ***  CALL    "ORCSDAY"    USING     STS-AREA-DAY
      ***                                 LNK-DAY2-AREA
      ***  IF      STS-DAY-RC1            =   ZERO
              MOVE    LNK-DAY2-EDTYMD1-Y  TO  WRK-TAIHI-XX
              INITIALIZE                      ORCSKANACHKAREA
              MOVE    "2"                 TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING  ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                                 TO  WRK-RECE85XX-NAME(1 1)(45:4)
                 MOVE    KANACHK-OUT-INPUT(1:4)
                          TO  WRK-RECE85XX-INPUTCOMENT(1 1)(1:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-M  TO  WRK-TAIHI-XX
              INITIALIZE                      ORCSKANACHKAREA
              MOVE    "2"                 TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING  ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                                 TO  WRK-RECE85XX-NAME(1 1)(51:4)
                 MOVE    KANACHK-OUT-INPUT(1:4)
                          TO  WRK-RECE85XX-INPUTCOMENT(1 1)(5:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-D  TO  WRK-TAIHI-XX
              INITIALIZE                      ORCSKANACHKAREA
              MOVE    "2"                 TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING  ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                                 TO  WRK-RECE85XX-NAME(1 1)(57:4)
                 MOVE    KANACHK-OUT-INPUT(1:4)
                          TO  WRK-RECE85XX-INPUTCOMENT(1 1)(9:4)
              END-IF
      *
              PERFORM  VARYING  IDX33  FROM  1  BY  2
                        UNTIL   IDX33    >  12
                 IF  WRK-RECE85XX-INPUTCOMENT(1 1)(IDX33:2) = "　"
                    MOVE  "０"   TO
                              WRK-RECE85XX-INPUTCOMENT(1 1)(IDX33:2)
                 END-IF
              END-PERFORM
      ***  END-IF
      *
           MOVE     "1"                TO  WRK-RECE85XX-SIKFLG(1 1)
           MOVE    WRK-RECE85XX-SRYACT-TBL(1 1)
                                       TO  RECE859-SRYACT-TBL(1)
           WRITE   RECE859-REC
           ADD     1                   TO  CNT-RECE859
      *
           .
       2001-SEISIN-SKJ-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    初診（同日複数診療科）があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SYODOU-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-SYODOU-COMMENT   =    "1"
                INITIALIZE             WRK-JIDO-SETCOM-AREA
      ***       労災マスタがtbl_recekisaiにない為の処置
      ***>      IF   RECE82-SRYYM  >= "202008"
      ***>        MOVE    "2"       TO     WRK-JIDO-SETCOMFLG
      ***>      ELSE
                  MOVE    "1"       TO     WRK-JIDO-SETCOMFLG
                  MOVE     1        TO     WRK-JIDO-SETCOMATFLG
      ***>      END-IF
                MOVE       99       TO     FLG-COMMENT
                PERFORM    20011-SYODOU-COMMENT-SEC
           END-IF
      *
           .
       2001-SYODOU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    初診（同日複数診療科）のコメント編集
      *****************************************************************
       20011-SYODOU-COMMENT-SEC          SECTION.
      *
           MOVE       ZERO       TO   IDZ
           INITIALIZE            WRK-FREE-AREA2
      *
           PERFORM   VARYING   IDX    FROM   1   BY   1
                      UNTIL   (IDX                       >   10  )
                       OR     (RECE84-SYODOU-SRYKA(IDX)  =  SPACE)
      *
      *      診療科の取得
             INITIALIZE                      SYS-1005-REC
             MOVE    "1005"              TO  SYS-1005-KANRICD
             MOVE    RECE84-SYODOU-SRYKA(IDX)
                                         TO  SYS-1005-KBNCD
             MOVE    RECE82-SRYYM        TO  SYS-1005-STYUKYMD(1:6)
             MOVE    "01"                TO  SYS-1005-STYUKYMD(7:2)
             MOVE    SYS-1005-STYUKYMD   TO  SYS-1005-EDYUKYMD
             MOVE    SPA-HOSPNUM         TO  SYS-1005-HOSPNUM
             MOVE    SYS-1005-REC        TO  MCPDATA-REC
             MOVE    "tbl_syskanri"      TO  MCP-TABLE
             MOVE    "key10"             TO  MCP-PATHNAME
             PERFORM   900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"      TO  MCP-TABLE
               MOVE    "key10"             TO  MCP-PATHNAME
               PERFORM  900-SYSKANRI-READ-SEC
               IF      FLG-SYSKANRI      =   ZERO
                IF   RECE82-SRYYM  >= "202008"
                  MOVE   1             TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   SYS-1005-SRYKANAME(1:40)
                                       TO  WRK-RECECOM-COMMENT
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
                ELSE
                  ADD   1                TO  IDZ
                  MOVE  "複初算定診療科："
                                         TO  WK-FREE-NAME2(IDZ)(1:16)
                  MOVE  SYS-1005-SRYKANAME(1:40)
                                         TO  WK-FREE-NAME2(IDZ)(17:40)
                  PERFORM  VARYING  IDW  FROM  300  BY  -1
                            UNTIL   IDW    <   1
                    IF   WK-FREE-NAME2(IDZ)(IDW:1)  NOT =  SPACE
                      COMPUTE WK-FREE-YUKOKETA2(IDZ) =  IDW  /   2
                      MOVE    1   TO    IDW
                    END-IF
                  END-PERFORM
                END-IF
               END-IF
             END-IF
      *
             INITIALIZE                        MCPAREA
             MOVE    "tbl_syskanri"      TO  MCP-TABLE
             MOVE    "key10"             TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
             PERFORM  200111-JIDOSET-HENSYU-SEC
      *
           END-PERFORM
      *
           PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           .
       20011-SYODOU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    薬剤管理指導料があるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-YAKUKANSIDO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-YAKUKAN-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                IF   RECE82-SRYYM  >= "202004"
                  MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
                END-IF
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-YAKUKANSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院栄養食事指導料があるか判定
      *****************************************************************
       2001-NYUEIYOSIDO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-NYUEIYO-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-NYUEIYOSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院前訪問指導料があるか判定
      *  （202006で自動記載取り止め）
      *****************************************************************
       2001-HOUMONSIDO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-HOUMON-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-HOUMONSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    傷病手当金意見書交付料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SYOBYO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-SYOBYO-COMMENT   =    "1"
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               IF   RECE82-SRYYM  >= "202008"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     99      TO     FLG-COMMENT
                 MOVE     5       TO     IDX-JIDO
                 PERFORM  200111-RECECOMMENT-IDXGET-SEC
               ELSE
                 MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                 MOVE     4       TO     FLG-COMMENT
               END-IF
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-SYOBYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養費同意書交付料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-RYOYO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-RYOYO-COMMENT    =    "1"
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               IF   RECE82-SRYYM  >= "202008"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     99      TO     FLG-COMMENT
                 MOVE     6       TO     IDX-JIDO
                 PERFORM  200111-RECECOMMENT-IDXGET-SEC
               ELSE
                 MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                 MOVE     4       TO     FLG-COMMENT
               END-IF
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-RYOYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院時服薬指導加算を算定時、当月に薬剤管理指導料がなく、前月
      *    に薬剤管理指導料があるか判定
      *****************************************************************
       2001-TAIIN-HANTEI-SEC          SECTION.
      *
           MOVE      ZERO            TO      WRK-TUKI-YAKUKAN
           MOVE      ZERO            TO      WRK-DAY-YAKUKAN
      *
           IF      RECE84-FLG-TAIIN-COMMENT   =    "1"
      *
             MOVE      ZERO            TO      FLG-YAKUKAN-COMMENT
      *
             IF    RECE82-SRYYM    >=  "200804"
               PERFORM   VARYING   IDX6   FROM    1   BY    1
                          UNTIL  ( IDX6   >   TBL-YAKUKAN-MAX       )
                            OR   ( FLG-YAKUKAN-COMMENT   =    1     )
                  MOVE   TBL-YAKUKAN(IDX6)     TO  WRK-YAKUKAN-SRYCD
                  PERFORM  2001X-TAIIN-HANTEI-TOUGETU-SEC
               END-PERFORM
             ELSE
                  MOVE   CONS-YAKUKAN-COMMENT  TO  WRK-YAKUKAN-SRYCD
                  PERFORM  2001X-TAIIN-HANTEI-TOUGETU-SEC
             END-IF
      *
             IF      FLG-YAKUKAN-COMMENT   =   ZERO
      *
               MOVE      ZERO            TO      WRK-ZENYYMM
      *
               INITIALIZE                      STS-AREA-DAY
               INITIALIZE                      LNK-DAY6-AREA
               MOVE    "61"                TO  LNK-DAY6-IRAI
               MOVE    RECE82-SRYYM        TO  LNK-DAY6-KIJUN(1:6)
               MOVE    "01"                TO  LNK-DAY6-KIJUN(7:2)
               MOVE    "2"                 TO  LNK-DAY6-ZOGENPTN
               MOVE     -1                 TO  LNK-DAY6-ZOGEN
               CALL    "ORCSDAY"           USING   STS-AREA-DAY
                                                   LNK-DAY6-AREA
               MOVE    LNK-DAY6-KEISAN(1:6)
                                           TO  WRK-ZENYYMM
      *
               IF    RECE82-SRYYM    >=  "200804"
                 PERFORM   VARYING   IDX6   FROM    1   BY    1
                            UNTIL    IDX6   >   TBL-YAKUKAN-MAX
                    MOVE   TBL-YAKUKAN(IDX6)     TO  WRK-YAKUKAN-SRYCD
                    PERFORM  2001Y-TAIIN-HANTEI-ZENGETU-SEC
                 END-PERFORM
               ELSE
                    MOVE   CONS-YAKUKAN-COMMENT  TO  WRK-YAKUKAN-SRYCD
                    PERFORM  2001Y-TAIIN-HANTEI-ZENGETU-SEC
               END-IF
      *
             END-IF
      *
             MOVE       99                TO     FLG-COMMENT
             IF    WRK-DAY-YAKUKAN    NOT   =   ZERO
                MOVE    2                 TO     FLG-HANTEI
                MOVE    WRK-ZENYYMM(5:2)  TO     WRK-TUKI-YAKUKAN
             ELSE
                MOVE    1                 TO     FLG-HANTEI
             END-IF
             PERFORM    20011-TAIIN-COMMENT-SEC
      *
           END-IF
      *
           .
       2001-TAIIN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    当月に薬剤管理指導料があるかチェック
      *****************************************************************
       2001X-TAIIN-HANTEI-TOUGETU-SEC          SECTION.
      *
           INITIALIZE                    SRYACT-REC
           MOVE    RECE82-HOSPNUM    TO  SRY-HOSPNUM
           MOVE    RECE82-NYUGAIKBN  TO  SRY-NYUGAIKBN
           MOVE    RECE82-PTID       TO  SRY-PTID
           MOVE    RECE82-SRYYM      TO  SRY-SRYYM
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (1)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (2)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (3)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (4)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (5)
           MOVE    SRYACT-REC        TO  MCPDATA-REC
           MOVE    "tbl_sryact"      TO  MCP-TABLE
           MOVE    "key7"            TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
      *
           IF      MCP-RC               =       ZERO
             MOVE    "tbl_sryact"    TO  MCP-TABLE
             MOVE    "key7"          TO  MCP-PATHNAME
             PERFORM  900-SRYACT-READ-SEC
             IF      FLG-SRYACT  =  ZERO
                   MOVE    1         TO  FLG-YAKUKAN-COMMENT
             END-IF
           END-IF
      *
           MOVE    "tbl_sryact"      TO  MCP-TABLE
           MOVE    "key7"            TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       2001X-TAIIN-HANTEI-TOUGETU-EXT.
           EXIT.
      *
      *****************************************************************
      *    前月に薬剤管理指導料があるかチェック
      *****************************************************************
       2001Y-TAIIN-HANTEI-ZENGETU-SEC          SECTION.
      *
           INITIALIZE                    SRYACT-REC
           MOVE    RECE82-HOSPNUM    TO  SRY-HOSPNUM
           MOVE    RECE82-NYUGAIKBN  TO  SRY-NYUGAIKBN
           MOVE    RECE82-PTID       TO  SRY-PTID
           MOVE    WRK-ZENYYMM       TO  SRY-SRYYM
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (1)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (2)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (3)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (4)
           MOVE    WRK-YAKUKAN-SRYCD TO  SRY-SRYCD (5)
           MOVE    SRYACT-REC        TO  MCPDATA-REC
           MOVE    "tbl_sryact"      TO  MCP-TABLE
           MOVE    "key7"            TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
      *
           IF      MCP-RC               =       ZERO
               MOVE    "tbl_sryact"     TO   MCP-TABLE
               MOVE    "key7"           TO   MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
      *
               PERFORM  UNTIL   FLG-SRYACT   =  1
      *
                 INITIALIZE                  SRYACCT-REC
                 MOVE    SRY-HOSPNUM    TO   ACCT-HOSPNUM
                 MOVE    SRY-NYUGAIKBN  TO   ACCT-NYUGAIKBN
                 MOVE    SRY-PTID       TO   ACCT-PTID
                 MOVE    SRY-SRYKA      TO   ACCT-SRYKA
                 MOVE    SRY-SRYYM      TO   ACCT-SRYYM
                 MOVE    SRY-ZAINUM     TO   ACCT-ZAINUM
                 MOVE    SRYACCT-REC    TO   MCPDATA-REC
                 MOVE    "tbl_sryacct"  TO   MCP-TABLE
                 MOVE    "key31"        TO   MCP-PATHNAME
                 PERFORM   900-DBSELECT-SEC
      *
                 IF  MCP-RC               =  ZERO
                     MOVE    "tbl_sryacct"  TO  MCP-TABLE
                     MOVE    "key31"        TO  MCP-PATHNAME
                     PERFORM   900-DBFETCH-SEC
                     IF      MCP-RC       =  ZERO
                       MOVE    MCPDATA-REC  TO  SRYACCT-REC
                       PERFORM   VARYING   IDX  FROM   1   BY   1
                                  UNTIL    IDX    >   31
                         IF    ACCT-DAY(1 IDX)  NOT =  ZERO
                            IF    IDX   >   WRK-DAY-YAKUKAN
                                MOVE  IDX   TO  WRK-DAY-YAKUKAN
                            END-IF
                         END-IF
                       END-PERFORM
                     END-IF
                 END-IF
      *
                 INITIALIZE                  MCPAREA
                 MOVE    "tbl_sryacct"  TO   MCP-TABLE
                 MOVE    "key31"        TO   MCP-PATHNAME
                 PERFORM   900-CLOSE-SEC
      *
                 MOVE    "tbl_sryact"   TO   MCP-TABLE
                 MOVE    "key7"         TO   MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
      *
               END-PERFORM
           END-IF
      *
           MOVE    "tbl_sryact"      TO      MCP-TABLE
           MOVE    "key7"            TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       2001Y-TAIIN-HANTEI-ZENGETU-EXT.
           EXIT.
      *
      *****************************************************************
      *    介護支援連携指導料があるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-KAISIEN-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-KAISIEN-COMMENT   =    "1"
               MOVE    ZERO                TO  FLG-KAISIEN
               MOVE    SPACE               TO  WRK-KAISIEN-FSANTEIYMD
               INITIALIZE                      SANTEI-REC
               MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID         TO  SANTEI-PTID
               MOVE    CONS-KAISIEN        TO  SANTEI-SRYCD
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM   900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"      TO  MCP-TABLE
                 MOVE    "key3"            TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI   =  1 )
                            OR    ( FLG-KAISIEN  =  1 )
                   IF   SANTEI-SRYYM  <  RECE82-SRYYM
                     PERFORM  VARYING   IDX3   FROM  31  BY  -1
                               UNTIL  ( IDX3        <   1 )
                                OR    ( FLG-KAISIEN =   1 )
                       IF   SANTEI-DAY(IDX3)  NOT =  ZERO
                         MOVE    1    TO  FLG-KAISIEN
                         MOVE   SANTEI-SRYYM
                                      TO  WRK-KAISIEN-FSANTEIYMD(1:6)
                         MOVE   IDX3  TO  WRK-KAISIEN-FSANTEIYMD(7:2)
                       END-IF
                     END-PERFORM
                   END-IF
                   MOVE    "tbl_santei"    TO  MCP-TABLE
                   MOVE    "key3"          TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM  900-CLOSE-SEC
      *
               IF   FLG-KAISIEN  =   1
      *           剤の最初の日検索
                  MOVE       SPACE         TO  WRK-KAISIEN-YMD
                  PERFORM  VARYING   IDX3   FROM  1  BY  1
                            UNTIL    IDX3  >   31
                    IF   RECE84-KAISU(1 IDX3)  NOT =  ZERO
                       MOVE  RECE82-SRYYM  TO  WRK-KAISIEN-YMD(1:6)
                       MOVE  IDX3          TO  WRK-KAISIEN-YMD(7:2)
                       MOVE  31            TO  IDX3
                    END-IF
                  END-PERFORM
      *
                  IF   WRK-KAISIEN-YMD   NOT =  SPACE
                    MOVE  WRK-KAISIEN-YMD     TO  WRK-KAISIEN-CHECKYMD
                    PERFORM  2001-KAISIEN-PTNYUINRRK-CHK-SEC
                    MOVE  WRK-KAISIEN-RRKNUM  TO  WRK-KAISIEN-RRKNUM-X
      *
                    MOVE  WRK-KAISIEN-FSANTEIYMD
                                              TO  WRK-KAISIEN-CHECKYMD
                    PERFORM  2001-KAISIEN-PTNYUINRRK-CHK-SEC
                    MOVE  WRK-KAISIEN-RRKNUM  TO  WRK-KAISIEN-RRKNUM-Y
      *
                    IF  (WRK-KAISIEN-RRKNUM-X  NOT = ZERO           )
                    AND (WRK-KAISIEN-RRKNUM-Y  NOT = ZERO           )
                    AND (WRK-KAISIEN-RRKNUM-X = WRK-KAISIEN-RRKNUM-Y)
                       CONTINUE
                    ELSE
                       MOVE   ZERO   TO   FLG-KAISIEN
                    END-IF
                  ELSE
                       MOVE   ZERO   TO   FLG-KAISIEN
                  END-IF
               END-IF
      *
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE       1       TO     WRK-JIDO-SETCOMATFLG
               IF   RECE82-SRYYM  >= "202004"
                 MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
               END-IF
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-KAISIEN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院履歴チェック
      *****************************************************************
       2001-KAISIEN-PTNYUINRRK-CHK-SEC          SECTION.
      *
           MOVE    ZERO                  TO  WRK-KAISIEN-RRKNUM
           INITIALIZE                        PTNYUINRRK-REC
           MOVE    RECE82-HOSPNUM        TO  PTNYUINRRK-HOSPNUM
           MOVE    RECE82-PTID           TO  PTNYUINRRK-PTID
           MOVE    WRK-KAISIEN-CHECKYMD  TO  PTNYUINRRK-NYUINYMD
           MOVE    WRK-KAISIEN-CHECKYMD  TO  PTNYUINRRK-TAIINYMD
           MOVE    PTNYUINRRK-REC        TO  MCPDATA-REC
           MOVE    "tbl_ptnyuinrrk"      TO  MCP-TABLE
           MOVE    "key11"               TO  MCP-PATHNAME
           PERFORM  900-DBSELECT-SEC
           IF      MCP-RC   =   ZERO
             MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
             MOVE    "key11"             TO  MCP-PATHNAME
             PERFORM  900-PTNYUINRRK-READ-SEC
             IF    FLG-PTNYUINRRK  =  ZERO
                MOVE  PTNYUINRRK-RRKNUM  TO  WRK-KAISIEN-RRKNUM
             END-IF
           END-IF
           MOVE    "tbl_ptnyuinrrk"      TO  MCP-TABLE
           MOVE    "key11"               TO  MCP-PATHNAME
           PERFORM  900-CLOSE-SEC
      *
           .
       2001-KAISIEN-PTNYUINRRK-CHK-EXT.
           EXIT.
      *
      *****************************************************************
      *    集団栄養食事指導料があるか判定
      *****************************************************************
       2001-SYUEIYO-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-SYUEIYO-COMMENT   =    "1"
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE       1       TO     WRK-JIDO-SETCOMATFLG
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-SYUEIYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    人工内耳機器調整加算があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-JINNAI-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-JINNAI-COMMENT   NOT =   SPACE
             MOVE      ZERO                TO  FLG-JINNAI-COMMENT
             MOVE      SPACE               TO  WRK-JINNAI-YMD
             PERFORM   VARYING   IDX   FROM    1   BY  1
                        UNTIL   (IDX                 >  2)
                         OR     (FLG-JINNAI-COMMENT  =  1)
               INITIALIZE                      SANTEI-REC
               MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID         TO  SANTEI-PTID
               EVALUATE  RECE84-FLG-JINNAI-COMMENT
                 WHEN      "1"
                       MOVE  CONS-JINNAI1  TO  SANTEI-SRYCD
                 WHEN      "2"
                   EVALUATE  IDX
                     WHEN     1
                       MOVE  CONS-JINNAI2  TO  SANTEI-SRYCD
                     WHEN     2
                       MOVE  CONS-JINNAI1  TO  SANTEI-SRYCD
                   END-EVALUATE
               END-EVALUATE
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"      TO  MCP-TABLE
                 MOVE    "key3"            TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                             OR   ( FLG-JINNAI-COMMENT  =   1 )
                   IF   SANTEI-SRYYM  <  RECE82-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-JINNAI-YMD(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-JINNAI-YMD(7:2)
                     MOVE    1              TO  FLG-JINNAI-COMMENT
                   END-IF
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               EVALUATE  RECE84-FLG-JINNAI-COMMENT
                 WHEN      "1"
                   MOVE     2              TO  IDX
               END-EVALUATE
             END-PERFORM
      *
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             IF   RECE82-SRYYM  >= "202008"
               MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
             ELSE
               MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE     1       TO     WRK-JIDO-SETCOMATFLG
             END-IF
             MOVE       99      TO     FLG-COMMENT
      *
             MOVE      ZERO     TO     IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             IF   RECE82-SRYYM  >= "202008"
              IF   WRK-JINNAI-YMD   NOT =  SPACE
                MOVE   17            TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                MOVE   WRK-JINNAI-YMD
                                     TO  WRK-RECECOM-YMD
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              ELSE
                MOVE   517           TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              END-IF
             ELSE
              IF   WRK-JINNAI-YMD   NOT =  SPACE
                ADD        1       TO     IDZ
                MOVE       19      TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "前回算定年月日　　　　　年　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
                MOVE       21      TO     IDX41
                MOVE       27      TO     IDX42
                MOVE       33      TO     IDX48
                MOVE       17      TO     IDX49
      *
                INITIALIZE                      STS-AREA-DAY
                INITIALIZE                      LNK-DAY2-AREA
                MOVE    "21"                TO  LNK-DAY2-IRAI
                MOVE    WRK-JINNAI-YMD      TO  LNK-DAY2-YMD
                CALL    "ORCSDAY"    USING      STS-AREA-DAY
                                                LNK-DAY2-AREA
                IF      STS-DAY-RC1  =  ZERO
                  MOVE  LNK-DAY2-EDTYMD1-Y  TO  WRK-TAIHI-XX
                  INITIALIZE                    ORCSKANACHKAREA
                  MOVE  "2"                 TO  KANACHK-SYORI
                  MOVE  WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
                  CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                  IF    KANACHK-RC  =  ZERO
                    MOVE  KANACHK-OUT-INPUT(1:4)
                               TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                  END-IF
      *
                  MOVE  LNK-DAY2-EDTYMD1-M  TO  WRK-TAIHI-XX
                  INITIALIZE                    ORCSKANACHKAREA
                  MOVE  "2"                 TO  KANACHK-SYORI
                  MOVE  WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
                  CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                  IF    KANACHK-RC  =  ZERO
                    MOVE  KANACHK-OUT-INPUT(1:4)
                               TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                  END-IF
      *
                  MOVE  LNK-DAY2-EDTYMD1-D  TO  WRK-TAIHI-XX
                  INITIALIZE                    ORCSKANACHKAREA
                  MOVE  "2"                 TO  KANACHK-SYORI
                  MOVE  WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
                  CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                  IF    KANACHK-RC  =  ZERO
                    MOVE  KANACHK-OUT-INPUT(1:4)
                               TO  WK-FREE-NAME2(IDZ)(IDX48:4)
                  END-IF
      *
                  MOVE  LNK-DAY2-EDTYMD2-G
                               TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                END-IF
              ELSE
                ADD        1       TO     IDZ
                MOVE       6       TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "（初回算定）"  TO     WK-FREE-NAME2(IDZ)
              END-IF
             END-IF
      *
             PERFORM  200111-JIDOSET-HENSYU-SEC
      *
             PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           END-IF
      *
           .
       2001-JINNAI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    心臓ペースメーカー指導管理料（ロ）があるか判定
      *    遠隔モニタリング加算があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SINPESUR-HANTEI-SEC          SECTION.
      *
           IF   ((RECE82-SRYYM                  <    "201804"  ) AND
                 (RECE84-FLG-SINPESUR-COMMENT   =    "1" OR "2"))
           OR   ((RECE82-SRYYM                 >=    "201804"  ) AND
                 (RECE84-FLG-SINPESUR-COMMENT   =    "1" OR "2") AND
                 (RECE84-FLG-SINPESU-COMMENT    =     SPACE    ))
           OR   ((RECE82-SRYYM                 >=    "201804"  ) AND
                 (RECE84-FLG-SINPESU-COMMENT    =    "A"       ) AND
                 (RECE84-FLG-SINPESUR-COMMENT   =    "A"       ))
           OR   ((RECE82-SRYYM                 >=    "201804"  ) AND
                 (RECE84-FLG-SINPESU-COMMENT    =    "B"       ) AND
                 (RECE84-FLG-SINPESUR-COMMENT   =    "B"       ) AND
                 (RECE84-FLG-YOUATU-COMMENT     =     SPACE    ))
             MOVE    ZERO                TO  FLG-SINPESUR-COMMENT
             MOVE    SPACE               TO  WRK-SINPESUR-YMD
             INITIALIZE                      SANTEI-REC
             MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID         TO  SANTEI-PTID
             EVALUATE  RECE84-FLG-SINPESUR-COMMENT
               WHEN     "1"
                 MOVE    CONS-SINPESUR1  TO  SANTEI-SRYCD
               WHEN     "2"
                 MOVE    CONS-SINPESUR2  TO  SANTEI-SRYCD
               WHEN     "A"
                 MOVE    CONS-ZAISAN     TO  SANTEI-SRYCD
               WHEN     "B"
                 MOVE    CONS-YOUATU2    TO  SANTEI-SRYCD
             END-EVALUATE
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI           =   1 )
                             OR   ( FLG-SINPESUR-COMMENT =   1 )
      *
                   IF   SANTEI-SRYYM  <  RECE82-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-SINPESUR-YMD(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-SINPESUR-YMD(7:2)
                     MOVE    1              TO  FLG-SINPESUR-COMMENT
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
      *
             IF   RECE84-FLG-SINPESUR-COMMENT  =  "A"
               MOVE    ZERO              TO  FLG-SINPESUR-COMMENT2
               MOVE    SPACE             TO  WRK-SINPESUR-YMD2
               INITIALIZE                    SANTEI-REC
               MOVE    RECE82-HOSPNUM    TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID       TO  SANTEI-PTID
               MOVE    CONS-ZAISAN2      TO  SANTEI-SRYCD
               MOVE    ZERO              TO  SANTEI-NYUGAIKBN
               MOVE    ZERO              TO  SANTEI-SRYKA
               MOVE    ZERO              TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC        TO  MCPDATA-REC
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC            =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI            =  1 )
                             OR   ( FLG-SINPESUR-COMMENT2 =  1 )
      *
                   IF   SANTEI-SRYYM  <  RECE82-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-SINPESUR-YMD2(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-SINPESUR-YMD2(7:2)
                     MOVE    1              TO  FLG-SINPESUR-COMMENT2
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               IF   WRK-SINPESUR-YMD2  NOT =  SPACE
                 IF  ( WRK-SINPESUR-YMD      =  SPACE          )
                 OR  ((WRK-SINPESUR-YMD  NOT =  SPACE         ) AND
                      (WRK-SINPESUR-YMD  <   WRK-SINPESUR-YMD2))
                   MOVE  WRK-SINPESUR-YMD2  TO  WRK-SINPESUR-YMD
                 END-IF
               END-IF
             END-IF
      *
             IF   WRK-SINPESUR-YMD   NOT =  SPACE
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE82-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                ELSE
                  MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                END-IF
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                IF   RECE82-SRYYM  >= "202008"
                 EVALUATE  RECE84-FLG-SINPESUR-COMMENT
                  WHEN     "2"
                     MOVE   20            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-SINPESUR-YMD
                                          TO  WRK-RECECOM-YMD
                     PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  WHEN     "A"
                     MOVE   25            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-SINPESUR-YMD(1:6)
                                          TO  WRK-RECECOM-YMD(1:6)
                     MOVE   "00"          TO  WRK-RECECOM-YMD(7:2)
                     PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  WHEN     "B"
                     MOVE   27            TO  IDX-JIDO
                     PERFORM  200111-RECECOMMENT-IDXGET-SEC
                     MOVE   WRK-SINPESUR-YMD(1:6)
                                          TO  WRK-RECECOM-YMD(1:6)
                     MOVE   "00"          TO  WRK-RECECOM-YMD(7:2)
                     PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 END-EVALUATE
                ELSE
                 ADD        1        TO     IDZ
                 EVALUATE  RECE84-FLG-SINPESUR-COMMENT
                  WHEN     "1"
                  WHEN     "2"
                     IF   RECE82-SRYYM >= "201905"
                       MOVE    15    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "前回算定年月　　　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    19    TO     IDX41
                       MOVE    25    TO     IDX42
                       MOVE    15    TO     IDX49
                     ELSE
                       MOVE    13    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "前回算定年月　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    15    TO     IDX41
                       MOVE    21    TO     IDX42
                     END-IF
                  WHEN     "A"
                  WHEN     "B"
                     IF   RECE82-SRYYM >= "201905"
                       MOVE    20    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "指導管理料前回算定年月　　　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    29    TO     IDX41
                       MOVE    35    TO     IDX42
                       MOVE    25    TO     IDX49
                     ELSE
                       MOVE    18    TO     WK-FREE-YUKOKETA2(IDZ)
                       MOVE   "指導管理料前回算定年月　　　年　　月"
                                     TO     WK-FREE-NAME2(IDZ)
                       MOVE    25    TO     IDX41
                       MOVE    31    TO     IDX42
                     END-IF
                 END-EVALUATE
      *
                 INITIALIZE                         STS-AREA-DAY
                 INITIALIZE                         LNK-DAY2-AREA
                 MOVE    "21"                   TO  LNK-DAY2-IRAI
                 MOVE    WRK-SINPESUR-YMD       TO  LNK-DAY2-YMD
                 CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                                LNK-DAY2-AREA
                 IF      STS-DAY-RC1            =   ZERO
                   MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                        TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                        TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                   END-IF
      *
                   IF   RECE82-SRYYM >= "201905"
                      MOVE    LNK-DAY2-EDTYMD2-G
                                        TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                   END-IF
                 END-IF
                END-IF
      *
                PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-SINPESUR-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    がん患者指導管理料２・３があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-GANSIDO-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-GANSIDO-COMMENT   =    "1" OR "2"
      *
             MOVE   ZERO   TO  IDX27
             INITIALIZE    WRK-GANSIDO-YMD-AREA
             EVALUATE    RECE84-FLG-GANSIDO-COMMENT
               WHEN       "1"
                 MOVE      CONS-GANSIDO1   TO  WRK-SRYCD
               WHEN       "2"
                 MOVE      CONS-GANSIDO2   TO  WRK-SRYCD
             END-EVALUATE
             PERFORM  2001-GANSIDO-HENSYU-SEC
      *
             IF   RECE82-SRYYM  >= "202204"
               EVALUATE  RECE84-FLG-GANSIDO-COMMENT
                 WHEN     "1"
                   MOVE    CONS-GANSIDO3   TO  WRK-SRYCD
                 WHEN     "2"
                   MOVE    CONS-GANSIDO4   TO  WRK-SRYCD
               END-EVALUATE
               PERFORM  2001-GANSIDO-HENSYU-SEC
             END-IF
      *
             IF   WRK-GANSIDO-YMD(1) NOT =  SPACE
      *
                IF   RECE82-SRYYM  >= "202204"
                  PERFORM   VARYING  IDX26  FROM  1  BY  1
                             UNTIL  (IDX26                  >   10  )
                              OR    (WRK-GANSIDO-YMD(IDX26) =  SPACE)
                   COMPUTE  IDZ  =  IDX26  +  1
                   PERFORM  VARYING  IDX27  FROM  IDZ  BY  1
                             UNTIL  (IDX27                  >   10  )
                              OR    (WRK-GANSIDO-YMD(IDX27) =  SPACE)
                     IF WRK-GANSIDO-YMD(IDX26) < WRK-GANSIDO-YMD(IDX27)
                       MOVE  WRK-GANSIDO-YMD(IDX26)
                                              TO WRK-GANSIDO-DATA
                       MOVE  WRK-GANSIDO-YMD(IDX27)
                                              TO WRK-GANSIDO-YMD(IDX26)
                       MOVE  WRK-GANSIDO-DATA TO WRK-GANSIDO-YMD(IDX27)
                     END-IF
                   END-PERFORM
                  END-PERFORM
                END-IF
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE82-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                ELSE
      ***         MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
      ***         MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                  CONTINUE
                END-IF
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                PERFORM  VARYING  IDX26  FROM  10  BY  -1
                          UNTIL   IDX26   <     1
                 IF  WRK-GANSIDO-YMD(IDX26)  NOT =  SPACE
                  IF   RECE82-SRYYM  >= "202008"
                   EVALUATE  RECE84-FLG-GANSIDO-COMMENT
                     WHEN      "1"
                       MOVE   29            TO  IDX-JIDO
                       PERFORM  200111-RECECOMMENT-IDXGET-SEC
                       MOVE   WRK-GANSIDO-YMD(IDX26)
                                            TO  WRK-RECECOM-YMD
                       PERFORM  200111-RECECOMMENT-HENSYU-SEC
                     WHEN      "2"
                       MOVE   30            TO  IDX-JIDO
                       PERFORM  200111-RECECOMMENT-IDXGET-SEC
                       MOVE   WRK-GANSIDO-YMD(IDX26)
                                            TO  WRK-RECECOM-YMD
                       PERFORM  200111-RECECOMMENT-HENSYU-SEC
                   END-EVALUATE
                   PERFORM  200111-JIDOSET-HENSYU-SEC
                  ELSE
                   ADD         1       TO     IDZ
                   IF   WRK-GANSIDO-YMD(IDX26)(1:6) = RECE82-SRYYM
                    IF   RECE82-SRYYM >= "201905"
                      MOVE     17      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "当月算定日　　　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     17      TO     IDX41
                      MOVE     23      TO     IDX42
                      MOVE     29      TO     IDX48
                      MOVE     13      TO     IDX49
                    ELSE
                      MOVE     15      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "当月算定日　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     13      TO     IDX41
                      MOVE     19      TO     IDX42
                      MOVE     25      TO     IDX48
                    END-IF
                   ELSE
                    IF   RECE82-SRYYM >= "201905"
                      MOVE     17      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "過去算定日　　　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     17      TO     IDX41
                      MOVE     23      TO     IDX42
                      MOVE     29      TO     IDX48
                      MOVE     13      TO     IDX49
                    ELSE
                      MOVE     15      TO     WK-FREE-YUKOKETA2(IDZ)
                      MOVE   "過去算定日　　　年　　月　　日"
                                       TO     WK-FREE-NAME2(IDZ)
                      MOVE     13      TO     IDX41
                      MOVE     19      TO     IDX42
                      MOVE     25      TO     IDX48
                    END-IF
                   END-IF
      *
                   INITIALIZE                         STS-AREA-DAY
                   INITIALIZE                         LNK-DAY2-AREA
                   MOVE    "21"                   TO  LNK-DAY2-IRAI
                   MOVE    WRK-GANSIDO-YMD(IDX26) TO  LNK-DAY2-YMD
                   CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                                  LNK-DAY2-AREA
                   IF      STS-DAY-RC1            =   ZERO
                     MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                     INITIALIZE                       ORCSKANACHKAREA
                     MOVE    "2"                  TO  KANACHK-SYORI
                     MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                     CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                        MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                     END-IF
      *
                     MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                     INITIALIZE                       ORCSKANACHKAREA
                     MOVE    "2"                  TO  KANACHK-SYORI
                     MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                     CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                        MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                     END-IF
      *
                     MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
                     INITIALIZE                       ORCSKANACHKAREA
                     MOVE    "2"                  TO  KANACHK-SYORI
                     MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                     CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                     IF      KANACHK-RC      =   ZERO
                        MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX48:4)
                     END-IF
      *
                     IF   RECE82-SRYYM >= "201905"
                        MOVE    LNK-DAY2-EDTYMD2-G
                                   TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                     END-IF
                   END-IF
                   PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-IF
                 END-IF
                END-PERFORM
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-GANSIDO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       2001-GANSIDO-HENSYU-SEC          SECTION.
      *
           INITIALIZE                      SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    WRK-SRYCD           TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL   FLG-SANTEI  =   1
      *
      ***>       IF   SANTEI-SRYYM  <= RECE82-SRYYM
                 IF   SANTEI-SRYYM  <  RECE82-SRYYM
                   PERFORM  VARYING  IDX26  FROM  31  BY  -1
                             UNTIL   IDX26   <     1
                     IF  (SANTEI-DAY(IDX26)  NOT =  ZERO)
                     AND (IDX27              <    10    )
                       ADD   1      TO  IDX27
                       MOVE  SANTEI-SRYYM
                                    TO  WRK-GANSIDO-YMD(IDX27)(1:6)
                       MOVE  IDX26  TO  WRK-GANSIDO-YMD(IDX27)(7:2)
                     END-IF
                   END-PERFORM
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       2001-GANSIDO-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    排尿自立指導料があるか判定
      *****************************************************************
       2001-HAIJRT-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-HAIJRT-COMMENT   =    "1"
             MOVE    SPACE               TO  WRK-HAIJRT-YMD
             INITIALIZE                      SANTEI-REC
             MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID         TO  SANTEI-PTID
             MOVE    RECE82-SRYYM        TO  SANTEI-SRYYM
             MOVE    CONS-HAIJRT         TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  WRK-MCP-TABLE
             MOVE    "key"               TO  WRK-MCP-PATHNAME
             PERFORM  900-SANTEI-INV-SEC
             IF       FLG-SANTEI        =   ZERO
                 MOVE SANTEI-FSANTEIYMD  TO  WRK-HAIJRT-YMD
             END-IF
      *
             IF   WRK-HAIJRT-YMD   NOT =  SPACE
      *
                MOVE    ZERO             TO  WRK-HAIJRT-KAISU
                INITIALIZE                   SANTEI-REC
                MOVE    RECE82-HOSPNUM   TO  SANTEI-HOSPNUM
                MOVE    RECE82-PTID      TO  SANTEI-PTID
                MOVE    CONS-HAIJRT      TO  SANTEI-SRYCD
                MOVE    ZERO             TO  SANTEI-NYUGAIKBN
                MOVE    ZERO             TO  SANTEI-SRYKA
                MOVE    ZERO             TO  SANTEI-HKNCOMBINUM
                MOVE    SANTEI-REC       TO  MCPDATA-REC
                MOVE    "tbl_santei"     TO  MCP-TABLE
                MOVE    "key3"           TO  MCP-PATHNAME
                PERFORM 900-DBSELECT-SEC
                IF      MCP-RC              =   ZERO
                  MOVE    "tbl_santei"      TO  MCP-TABLE
                  MOVE    "key3"            TO  MCP-PATHNAME
                  PERFORM  900-SANTEI-READ-SEC
                  PERFORM   UNTIL   FLG-SANTEI  =   1
                    IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                    AND  SANTEI-SRYYM  >=  WRK-HAIJRT-YMD(1:6)
                      MOVE  WRK-HAIJRT-YMD(7:2)  TO  IDX28
                      PERFORM  VARYING  IDX26  FROM  31  BY  -1
                                UNTIL   IDX26   <     1
                        IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                          IF  (SANTEI-SRYYM = WRK-HAIJRT-YMD(1:6))
                          AND (IDX26        < IDX28              )
                            CONTINUE
                          ELSE
                            ADD    1    TO   WRK-HAIJRT-KAISU
                          END-IF
                        END-IF
                      END-PERFORM
                    END-IF
                    MOVE    "tbl_santei"    TO  MCP-TABLE
                    MOVE    "key3"          TO  MCP-PATHNAME
                    PERFORM  900-SANTEI-READ-SEC
                  END-PERFORM
                END-IF
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM 900-CLOSE-SEC
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                ADD        1       TO     IDZ
      *
                MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "初回算定　　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
      *
                MOVE    WRK-HAIJRT-YMD(5:2)   TO  DAY-IDX2
                MOVE    TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(11:4)
                MOVE    WRK-HAIJRT-YMD(7:2)   TO  DAY-IDX2
                MOVE    TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(17:4)
      *
                PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                IF   WRK-HAIJRT-KAISU  NOT =  ZERO
                AND  WRK-HAIJRT-KAISU     <=   31
                  ADD        1       TO     IDZ
      *
                  MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE     "通算実施回数（　　回）"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE      WRK-HAIJRT-KAISU TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(15:4)
      *
                  PERFORM  200111-JIDOSET-HENSYU-SEC
                END-IF
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-HAIJRT-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院時共同指導料２があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-TAIKYO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-TAIKYO-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                IF   RECE82-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     99      TO     FLG-COMMENT
                  MOVE     79      TO     IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                ELSE
                  MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                  MOVE     10      TO     FLG-COMMENT
                END-IF
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-TAIKYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    訪問看護指示料があるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-HOUSIJI-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-HOUSIJI-COMMENT   =    "1"
           AND    RECE84-FLG-HOUSKSN-COMMENT   =    SPACE
               MOVE      ZERO     TO     IDZ
               INITIALIZE                WRK-FREE-AREA2
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE       1       TO     WRK-JIDO-SETCOMATFLG
               IF   RECE82-SRYYM  >= "202004"
                 MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
               END-IF
               MOVE       3       TO     FLG-COMMENT
               PERFORM   200111-SANTEI-DAY-SEC
               PERFORM   20011-FREE-COMMENT2-SEC
      *
               IF   RECE84-FLG-TEJHOU-COMMENT  =  "1"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 PERFORM   2001-TEJHOU-HENSYU-SEC
               END-IF
      *
               PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
           END-IF
      *
           .
       2001-HOUSIJI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    特別訪問看護指示加算があるか判定
      *  ＃202204コメント対応
      *****************************************************************
       2001-HOUSKSN-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-HOUSKSN-COMMENT   =    "1"
               MOVE      ZERO     TO     IDZ
               INITIALIZE                WRK-FREE-AREA2
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE       2       TO     WRK-JIDO-SETCOMATFLG
               MOVE       3       TO     FLG-COMMENT
               PERFORM   200111-SANTEI-DAY-SEC
               PERFORM   20011-FREE-COMMENT2-SEC
      *
               IF   RECE84-FLG-TEJHOU-COMMENT  =  "1"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 PERFORM   2001-TEJHOU-HENSYU-SEC
               END-IF
      *
               PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
           END-IF
      *
           .
       2001-HOUSKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    手順書加算（訪問看護指示料）があるか判定
      *  ＃202204コメント対応
      *****************************************************************
       2001-TEJHOU-HANTEI-SEC          SECTION.
      *
           IF   ((RECE84-FLG-HOUSIJI-COMMENT   =    SPACE) AND
                 (RECE84-FLG-HOUSKSN-COMMENT   =    SPACE) AND
                 (RECE84-FLG-TEJHOU-COMMENT    =    "1"  ))
           OR   ((RECE84-FLG-HOUSKSN-COMMENT   =    "2"  ) AND
                 (RECE84-FLG-TEJHOU-COMMENT    =    "1"  ))
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
             MOVE       99      TO     FLG-COMMENT
      *
             MOVE      ZERO     TO     IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             PERFORM   2001-TEJHOU-HENSYU-SEC
      *
             PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
           END-IF
      *
           .
       2001-TEJHOU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    手順書加算（訪問看護指示料）編集
      *  ＃202204コメント対応
      *****************************************************************
       2001-TEJHOU-HENSYU-SEC          SECTION.
      *
           MOVE    ZERO                TO  FLG-TEJHOU-COMMENT
           MOVE    SPACE               TO  WRK-TEJHOU-YMD
           INITIALIZE                      SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    CONS-TEJHOU         TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                           OR   ( FLG-TEJHOU-COMMENT  =   1 )
      *
                 IF   SANTEI-SRYYM  <  RECE82-SRYYM
                   MOVE  SANTEI-SRYYM     TO  WRK-TEJHOU-YMD(1:6)
                   MOVE  SANTEI-MSANTEID  TO  WRK-TEJHOU-YMD(7:2)
                   MOVE    1              TO  FLG-TEJHOU-COMMENT
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           IF   WRK-TEJHOU-YMD   NOT =  SPACE
             MOVE     137              TO  IDX-JIDO
             PERFORM  200111-RECECOMMENT-IDXGET-SEC
             MOVE     WRK-TEJHOU-YMD   TO  WRK-RECECOM-YMD
             PERFORM  200111-RECECOMMENT-HENSYU-SEC
           ELSE
             MOVE     637              TO  IDX-JIDO
             PERFORM  200111-RECECOMMENT-IDXGET-SEC
             PERFORM  200111-RECECOMMENT-HENSYU-SEC
           END-IF
      *
           .
       2001-TEJHOU-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅血液透析頻回指導管理料があるか判定
      *    在宅血液透析指導管理料算定日の歴月で２月以内か判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-HINKAI-HANTEI-SEC          SECTION.
      *
           IF   RECE84-FLG-HINKAI-COMMENT   =    "1"
      *
             MOVE    ZERO    TO   WRK-DAY
             PERFORM  VARYING   IDX3   FROM  1  BY  1
                       UNTIL    IDX3  >   31
                 IF   RECE84-KAISU(1 IDX3)  NOT =  ZERO
                        MOVE  IDX3  TO  WRK-DAY
                        MOVE  31    TO  IDX3
                 END-IF
             END-PERFORM
      *
             MOVE     ZERO     TO     FLG-HINKAI-COMMENT
             MOVE     ZERO     TO     WRK-TOSEKIYMD
      *
      *      算定履歴検索
             INITIALIZE                  SANTEI-REC
             MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID         TO  SANTEI-PTID
             MOVE    CONS-TOSEKI         TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
                    MOVE    "tbl_santei" TO  MCP-TABLE
                    MOVE    "key3"       TO  MCP-PATHNAME
                    PERFORM 900-SANTEI-READ-SEC
                    PERFORM   UNTIL  ( FLG-SANTEI         =   1 ) OR
                                     ( FLG-HINKAI-COMMENT =   1 )
      *
                      IF   SANTEI-SRYYM  <=  RECE82-SRYYM
      ***              MOVE   SANTEI-SRYYM     TO  WRK-FSANTEIYMD(1:6)
      ***              MOVE   SANTEI-MSANTEID  TO  WRK-FSANTEIYMD(7:2)
                       MOVE   SANTEI-FSANTEIYMD
                                               TO  WRK-FSANTEIYMD
      *
                       INITIALIZE                  STS-AREA-DAY
                       INITIALIZE                  LNK-DAY6-AREA
                       MOVE    "61"            TO  LNK-DAY6-IRAI
                       MOVE    WRK-FSANTEIYMD  TO  LNK-DAY6-KIJUN
                       MOVE    "2"             TO  LNK-DAY6-ZOGENPTN
                       MOVE     2              TO  LNK-DAY6-ZOGEN
                       CALL    "ORCSDAY"       USING   STS-AREA-DAY
                                                       LNK-DAY6-AREA
                       MOVE    LNK-DAY6-KEISAN TO  WRK-AFTER2
      *
                       MOVE    RECE82-SRYYM    TO  WRK-HINKAIYMD(1:6)
                       MOVE    WRK-DAY         TO  WRK-HINKAIYMD(7:2)
      *
                       IF     WRK-DAY      NOT  =  ZERO
                       AND    WRK-FSANTEIYMD   <=  WRK-HINKAIYMD
                         IF ((WRK-HINKAIYMD    <   WRK-AFTER2) AND
                             (RECE82-SRYYM     <= "201003"   ))
                         OR ( RECE82-SRYYM     >= "201004"    )
                             MOVE    1    TO   FLG-HINKAI-COMMENT
                             MOVE  WRK-FSANTEIYMD
                                          TO   WRK-TOSEKIYMD
                         END-IF
                       END-IF
                      END-IF
      * 
                      MOVE    "tbl_santei"     TO  MCP-TABLE
                      MOVE    "key3"           TO  MCP-PATHNAME
                      PERFORM 900-SANTEI-READ-SEC
                    END-PERFORM
             END-IF
      *
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
      *
             IF      FLG-HINKAI-COMMENT    =      1
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 IF   RECE82-SRYYM  >= "202008"
                   MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 ELSE
                   MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                   MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                 END-IF
                 MOVE       99      TO     FLG-COMMENT
                 PERFORM    20011-HINKAI-COMMENT-SEC
             END-IF
      *
           END-IF
      *
           .
       2001-HINKAI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅血液透析頻回指導管理料のコメント編集
      *****************************************************************
       20011-HINKAI-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *    コメントの挿入
           MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *
           IF   RECE82-SRYYM  >= "202008"
              MOVE   ZERO          TO   IDZ
              INITIALIZE           WRK-FREE-AREA2
              MOVE   34            TO  IDX-JIDO
              PERFORM  200111-RECECOMMENT-IDXGET-SEC
              MOVE   WRK-TOSEKIYMD TO  WRK-RECECOM-YMD
              PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE  WK-FREE-SRYCD2(1)
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
              MOVE  ZERO    TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE  WK-FREE-YUKOKETA2(1)
                            TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  WK-FREE-NAME2(1)
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              MOVE  WK-FREE-INPUTCOMENT2(1)
                            TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
              MOVE  "1"     TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           ELSE
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE  "810000001"
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
              MOVE  ZERO    TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE  16      TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "初回指導管理算定日　　　月　　日"
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              MOVE  WRK-TOSEKIYMD(5:2)   TO  DAY-IDX2
              MOVE  TBL-DAY(DAY-IDX2)
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(21:4)
              MOVE  WRK-TOSEKIYMD(7:2)   TO  DAY-IDX2
              MOVE  TBL-DAY(DAY-IDX2)
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(27:4)
              MOVE  "2"     TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
      *#      MOVE   12     TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
              MOVE   1      TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
              MOVE  SPACE   TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
              MOVE  "1"     TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-HINKAI-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    往診・特別往診があるか判定
      *****************************************************************
       2001-OSIN-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-OSIN-COMMENT   =    "1"
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE       6       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-OSIN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    介護職員等喀痰吸引等指示料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-KAISYOKU-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-KAISYOKU-COMMENT   =    "1"
             MOVE    ZERO                TO  FLG-KAISYOKU-COMMENT
             MOVE    SPACE               TO  WRK-KAISYOKU-YMD
             INITIALIZE                      SANTEI-REC
             MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID         TO  SANTEI-PTID
             MOVE    CONS-KAISYOKU       TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI           =   1 )
                             OR   ( FLG-KAISYOKU-COMMENT =   1 )
      *
                   IF   SANTEI-SRYYM  <  RECE82-SRYYM
                     MOVE  SANTEI-SRYYM     TO  WRK-KAISYOKU-YMD(1:6)
                     MOVE  SANTEI-MSANTEID  TO  WRK-KAISYOKU-YMD(7:2)
                     MOVE    1              TO  FLG-KAISYOKU-COMMENT
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
      *
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             IF   RECE82-SRYYM  >= "202008"
               MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
             ELSE
               MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE     1       TO     WRK-JIDO-SETCOMATFLG
             END-IF
             MOVE       99      TO     FLG-COMMENT
      *
             MOVE      ZERO     TO     IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             IF   RECE82-SRYYM  >= "202008"
              IF   WRK-KAISYOKU-YMD   NOT =  SPACE
                MOVE   38            TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                MOVE   WRK-KAISYOKU-YMD
                                     TO  WRK-RECECOM-YMD
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              ELSE
                MOVE   538           TO  IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                PERFORM  200111-RECECOMMENT-HENSYU-SEC
              END-IF
             ELSE
              IF   WRK-KAISYOKU-YMD   NOT =  SPACE
                ADD          1       TO     IDZ
                IF   RECE82-SRYYM >= "201905"
                  MOVE       19      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE   "前回交付年月日　　　　　年　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE       21      TO     IDX41
                  MOVE       27      TO     IDX42
                  MOVE       33      TO     IDX48
                  MOVE       17      TO     IDX49
                ELSE
                  MOVE       17      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE   "前回交付年月日　　　年　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE       17      TO     IDX41
                  MOVE       23      TO     IDX42
                  MOVE       29      TO     IDX48
                END-IF
      *
                INITIALIZE                         STS-AREA-DAY
                INITIALIZE                         LNK-DAY2-AREA
                MOVE    "21"                   TO  LNK-DAY2-IRAI
                MOVE    WRK-KAISYOKU-YMD       TO  LNK-DAY2-YMD
                CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                               LNK-DAY2-AREA
                IF      STS-DAY-RC1            =   ZERO
                   MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX48:4)
                   END-IF
      *
                   IF   RECE82-SRYYM >= "201905"
                      MOVE    LNK-DAY2-EDTYMD2-G
                                   TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                   END-IF
                END-IF
              ELSE
                ADD        1       TO     IDZ
                MOVE       6       TO     WK-FREE-YUKOKETA2(IDZ)
                MOVE   "（初回交付）"  TO     WK-FREE-NAME2(IDZ)
              END-IF
             END-IF
      *
             PERFORM  200111-JIDOSET-HENSYU-SEC
      *
             PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           END-IF
      *
           .
       2001-KAISYOKU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅持続陽圧呼吸療法指導管理料があるか判定
      *  ＃202202選択式コメント対応
      *****************************************************************
       2001-YOUATU-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-YOUATU-COMMENT   =    "1" OR "2"
             MOVE    SPACE                TO  WRK-YOUATU-FSANTEIYMD
             INITIALIZE                       SANTEI-REC
             MOVE    RECE82-HOSPNUM       TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID          TO  SANTEI-PTID
             MOVE    RECE82-SRYYM         TO  SANTEI-SRYYM
             EVALUATE  RECE84-FLG-YOUATU-COMMENT
               WHEN      "1"
                 MOVE    CONS-YOUATU1     TO  SANTEI-SRYCD
               WHEN      "2"
                 MOVE    CONS-YOUATU2     TO  SANTEI-SRYCD
             END-EVALUATE
             MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                 TO  SANTEI-SRYKA
             MOVE    ZERO                 TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC           TO  MCPDATA-REC
             MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
             MOVE    "key"                TO  WRK-MCP-PATHNAME
             PERFORM 900-SANTEI-INV-SEC
             IF      FLG-SANTEI  =  ZERO
               MOVE  SANTEI-FSANTEIYMD    TO  WRK-YOUATU-FSANTEIYMD
             END-IF
      *
             MOVE    ZERO                 TO  FLG-YOUATU-COMMENT
             INITIALIZE                       SANTEI-REC
             MOVE    RECE82-HOSPNUM       TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID          TO  SANTEI-PTID
             MOVE    CONS-YOUATU3         TO  SANTEI-SRYCD
             MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                 TO  SANTEI-SRYKA
             MOVE    ZERO                 TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC           TO  MCPDATA-REC
             MOVE    "tbl_santei"         TO  MCP-TABLE
             MOVE    "key3"               TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC  =  ZERO
               MOVE    "tbl_santei"       TO  MCP-TABLE
               MOVE    "key3"             TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM  UNTIL (FLG-SANTEI         =  1)
                         OR   (FLG-YOUATU-COMMENT =  1)
                 IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                   IF    SANTEI-FSANTEIYMD  NOT =  SPACE
                     MOVE  SANTEI-FSANTEIYMD
                                    TO  WRK-YOUATU-FSANTEIYMD
                   END-IF
                   MOVE     1       TO  FLG-YOUATU-COMMENT
                 END-IF
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM  900-CLOSE-SEC
      *
             MOVE         ZERO     TO     IDZ
             INITIALIZE                   WRK-FREE-AREA2
             IF   WRK-YOUATU-FSANTEIYMD   NOT =  SPACE
               INITIALIZE                 WRK-JIDO-SETCOM-AREA
               MOVE      "2"       TO     WRK-JIDO-SETCOMFLG
               MOVE       99       TO     FLG-COMMENT
      *
               EVALUATE  RECE84-FLG-YOUATU-COMMENT
                 WHEN      "1"
                   MOVE    115     TO     IDX-JIDO
                 WHEN      "2"
                   MOVE    116     TO     IDX-JIDO
               END-EVALUATE
               PERFORM    200111-RECECOMMENT-IDXGET-SEC
               MOVE       WRK-YOUATU-FSANTEIYMD
                                   TO     WRK-RECECOM-YMD
               PERFORM    200111-RECECOMMENT-HENSYU-SEC
             END-IF
      *
             IF   (RECE84-FLG-SINPESU-COMMENT    =    "B")
             AND  (RECE84-FLG-SINPESUR-COMMENT   =    "B")
               MOVE    ZERO                TO  FLG-SINPESUR-COMMENT
               MOVE    SPACE               TO  WRK-SINPESUR-YMD
               INITIALIZE                      SANTEI-REC
               MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID         TO  SANTEI-PTID
               MOVE    CONS-YOUATU2        TO  SANTEI-SRYCD
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"      TO  MCP-TABLE
                 MOVE    "key3"            TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI           =   1 )
                             OR   ( FLG-SINPESUR-COMMENT =   1 )
                   IF   SANTEI-SRYYM  <  RECE82-SRYYM
                     MOVE  SANTEI-SRYYM    TO  WRK-SINPESUR-YMD(1:6)
                     MOVE  SANTEI-MSANTEID TO  WRK-SINPESUR-YMD(7:2)
                     MOVE    1             TO  FLG-SINPESUR-COMMENT
                   END-IF
                   MOVE    "tbl_santei"    TO  MCP-TABLE
                   MOVE    "key3"          TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               IF   WRK-SINPESUR-YMD   NOT =  SPACE
                 INITIALIZE                 WRK-JIDO-SETCOM-AREA
                 MOVE      "2"       TO     WRK-JIDO-SETCOMFLG
                 MOVE       99       TO     FLG-COMMENT
      *
                 MOVE       27       TO     IDX-JIDO
                 PERFORM   200111-RECECOMMENT-IDXGET-SEC
                 MOVE      WRK-SINPESUR-YMD(1:6)
                                     TO     WRK-RECECOM-YMD(1:6)
                 MOVE      "00"      TO     WRK-RECECOM-YMD(7:2)
                 PERFORM   200111-RECECOMMENT-HENSYU-SEC
               END-IF
             END-IF
      *
             IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
             OR  WK-FREE-NAME2(1)   NOT =  SPACE
               PERFORM     200111-SRYACTINF-HENSYU-MAT-SEC
             END-IF
           END-IF
      *
           .
       2001-YOUATU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅患者共同診療料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-ZAIKYO-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-ZAIKYO-COMMENT   =    "1"
             MOVE   CONS-ZAIKYO   TO   WRK-CHECK-SRYCD
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
      *        在宅患者共同診療料開始日の剤検索
               MOVE       ZERO                  TO  WRK-ZAIKYO-KAISU
               MOVE       ZERO                  TO  FLG-ZAIKYOCOMARI
               PERFORM    20011-ZAIKYO-KENSAKU-SEC
               IF    FLG-ZAIKYOCOMARI  =  1
                  PERFORM  VARYING  IDX30  FROM  1  BY  1
                            UNTIL   IDX30   >   TBL-ZAIKYO-CHECK-MAX
                    INITIALIZE                      SANTEI-REC
                    MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
                    MOVE    RECE82-PTID         TO  SANTEI-PTID
                    MOVE    TBL-ZAIKYO-CHECK(IDX30)
                                                TO  SANTEI-SRYCD
                    MOVE    ZERO                TO  SANTEI-NYUGAIKBN
                    MOVE    ZERO                TO  SANTEI-SRYKA
                    MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
                    MOVE    SANTEI-REC          TO  MCPDATA-REC
                    MOVE    "tbl_santei"        TO  MCP-TABLE
                    MOVE    "key3"              TO  MCP-PATHNAME
                    PERFORM 900-DBSELECT-SEC
                    IF      MCP-RC              =   ZERO
                      MOVE    "tbl_santei"      TO  MCP-TABLE
                      MOVE    "key3"            TO  MCP-PATHNAME
                      PERFORM  900-SANTEI-READ-SEC
                      PERFORM   UNTIL   FLG-SANTEI  =   1
      *
                        IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                        AND  SANTEI-SRYYM  >=  WRK-ZAIKYO-YMD(1:6)
                          MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                          MOVE  WRK-ZAIKYO-YMD9(7:2) TO  IDX29
                          PERFORM  VARYING  IDX26  FROM  31  BY  -1
                                    UNTIL   IDX26   <     1
                            IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                              IF ((SANTEI-SRYYM =
                                          WRK-ZAIKYO-YMD(1:6) ) AND
                                  (IDX26        < IDX28       ))
                              OR ((SANTEI-SRYYM =
                                          WRK-ZAIKYO-YMD9(1:6)) AND
                                  (IDX26       >= IDX29       ))
                                CONTINUE
                              ELSE
                                ADD    1    TO   WRK-ZAIKYO-KAISU
                              END-IF
                            END-IF
                          END-PERFORM
                        END-IF
      *
                        MOVE    "tbl_santei"    TO  MCP-TABLE
                        MOVE    "key3"          TO  MCP-PATHNAME
                        PERFORM  900-SANTEI-READ-SEC
                      END-PERFORM
                    END-IF
                    MOVE    "tbl_santei"        TO  MCP-TABLE
                    MOVE    "key3"              TO  MCP-PATHNAME
                    PERFORM 900-CLOSE-SEC
                  END-PERFORM
               END-IF
      *
               INITIALIZE                WRK-JIDO-SETCOM-AREA
               IF   RECE82-SRYYM  >= "202008"
                 MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
               ELSE
                 MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     1       TO     WRK-JIDO-SETCOMATFLG
               END-IF
               MOVE       99      TO     FLG-COMMENT
      *
               MOVE      ZERO     TO     IDZ
               INITIALIZE                WRK-FREE-AREA2
      *
               IF   RECE82-SRYYM  >= "202008"
                  MOVE   39            TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   WRK-ZAIKYO-YMD
                                       TO  WRK-RECECOM-YMD
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                  PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                  IF    WRK-ZAIKYO-KAISU  NOT = ZERO
                    MOVE   539         TO  IDX-JIDO
                    PERFORM  200111-RECECOMMENT-IDXGET-SEC
                    MOVE   WRK-ZAIKYO-KAISU
                                       TO  WRK-RECECOM-NUM
                    PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                    PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-IF
               ELSE
                  ADD      1       TO     IDZ
                  MOVE     11      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE "初回算定　　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
                  MOVE  WRK-ZAIKYO-YMD(5:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(11:4)
                  MOVE  WRK-ZAIKYO-YMD(7:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(17:4)
      *
                  PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                  IF   (WRK-ZAIKYO-KAISU  NOT = ZERO)
                  AND  (WRK-ZAIKYO-KAISU     <=  31 )
                    ADD    1       TO  IDZ
                    MOVE   11      TO  WK-FREE-YUKOKETA2(IDZ)
                    MOVE "通算実施回数（　　回）"
                                   TO  WK-FREE-NAME2(IDZ)
                    MOVE  WRK-ZAIKYO-KAISU TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                   TO  WK-FREE-NAME2(IDZ)(15:4)
      *
                    PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-IF
               END-IF
      *
               PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-ZAIKYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       20011-ZAIKYO-CHECK-SEC          SECTION.
      *
           MOVE    RECE82-SRYYM        TO  WRK-ZAIKYO-YMD9(1:6)
           MOVE    "99"                TO  WRK-ZAIKYO-YMD9(7:2)
      *
           MOVE    ZERO                TO  FLG-ZAIKYO-COMMENT
           MOVE    SPACE               TO  WRK-ZAIKYO-YMD
           MOVE    ZERO                TO  FLG-RETRY
           INITIALIZE                      SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    WRK-CHECK-SRYCD     TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                           OR   ( FLG-ZAIKYO-COMMENT  =   1 )
      *
                 IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                   MOVE  SANTEI-SRYYM     TO  WRK-ZAIKYO-YMD(1:6)
                   MOVE  SANTEI-MSANTEID  TO  WRK-ZAIKYO-YMD(7:2)
                   MOVE    1              TO  FLG-ZAIKYO-COMMENT
      *
                   IF   SANTEI-SRYYM  =  RECE82-SRYYM
                     MOVE   ZERO  TO  FLG-CHECK-MAE
                     MOVE   ZERO  TO  FLG-CHECK-ATO
                     MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                     PERFORM  VARYING  IDX26  FROM   1  BY  1
                               UNTIL   IDX26   >    31
                       IF  RECE84-KAISU(1 IDX26)  NOT =  ZERO
                         IF    IDX26  <  IDX28
                           MOVE    1   TO  FLG-CHECK-MAE
                         ELSE
                           MOVE    1   TO  FLG-CHECK-ATO
                         END-IF
                       END-IF
                     END-PERFORM
                     IF  ((FLG-CHECK-MAE = 1   ) AND
                          (FLG-CHECK-ATO = ZERO))
                     OR  ((FLG-CHECK-MAE = 1   ) AND
                          (FLG-CHECK-ATO = 1   ))
                       MOVE    WRK-ZAIKYO-YMD
                                       TO  WRK-ZAIKYO-YMD9
                       MOVE    SPACE   TO  WRK-ZAIKYO-YMD
                       MOVE    1       TO  FLG-RETRY
                     END-IF
                   END-IF
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
           END-IF
           MOVE    "tbl_santei"        TO  MCP-TABLE
           MOVE    "key3"              TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           IF   FLG-RETRY =  1
             MOVE    ZERO                TO  FLG-ZAIKYO-COMMENT
             MOVE    SPACE               TO  WRK-ZAIKYO-YMD
             MOVE    ZERO                TO  FLG-RETRY
             INITIALIZE                      SANTEI-REC
             MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
             MOVE    RECE82-PTID         TO  SANTEI-PTID
             MOVE    WRK-CHECK-SRYCD     TO  SANTEI-SRYCD
             MOVE    ZERO                TO  SANTEI-NYUGAIKBN
             MOVE    ZERO                TO  SANTEI-SRYKA
             MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
             MOVE    SANTEI-REC          TO  MCPDATA-REC
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
               MOVE    "tbl_santei"    TO  MCP-TABLE
               MOVE    "key3"          TO  MCP-PATHNAME
               PERFORM  900-SANTEI-READ-SEC
               PERFORM   UNTIL  ( FLG-SANTEI          =   1 )
                           OR   ( FLG-ZAIKYO-COMMENT  =   1 )
      *
                 IF   SANTEI-SRYYM  <   RECE82-SRYYM
                   MOVE  SANTEI-SRYYM     TO  WRK-ZAIKYO-YMD(1:6)
                   MOVE  SANTEI-MSANTEID  TO  WRK-ZAIKYO-YMD(7:2)
                   MOVE    1              TO  FLG-ZAIKYO-COMMENT
                 END-IF
      *
                 MOVE    "tbl_santei"  TO  MCP-TABLE
                 MOVE    "key3"        TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_santei"        TO  MCP-TABLE
             MOVE    "key3"              TO  MCP-PATHNAME
             PERFORM 900-CLOSE-SEC
           END-IF
      *
           .
       20011-ZAIKYO-CHECK-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       20011-ZAIKYO-CHECK2-SEC          SECTION.
      *
      *    算定履歴検索
           MOVE    SPACE               TO  WRK-ZAIKYO-YMD2
           INITIALIZE                      SANTEI-REC
           MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID         TO  SANTEI-PTID
           MOVE    RECE82-SRYYM        TO  SANTEI-SRYYM
           MOVE    WRK-CHECK-SRYCD     TO  SANTEI-SRYCD
           MOVE    ZERO                TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                TO  SANTEI-SRYKA
           MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC          TO  MCPDATA-REC
           MOVE    "tbl_santei"        TO  WRK-MCP-TABLE
           MOVE    "key"               TO  WRK-MCP-PATHNAME
           PERFORM  900-SANTEI-INV-SEC
           IF       FLG-SANTEI        =   ZERO
             MOVE   SANTEI-SRYYM       TO  WRK-ZAIKYO-YMD2(1:6)
             MOVE   SANTEI-MSANTEID    TO  WRK-ZAIKYO-YMD2(7:2)
             IF     WRK-ZAIKYO-YMD     <=  WRK-ZAIKYO-YMD2
               MOVE   ZERO  TO  FLG-CHECK-MAE
               MOVE   ZERO  TO  FLG-CHECK-ATO
               MOVE   WRK-ZAIKYO-YMD2(7:2)  TO  IDX28
               PERFORM  VARYING  IDX26  FROM   1  BY  1
                         UNTIL   IDX26   >    31
                 IF  RECE84-KAISU(1 IDX26)  NOT =  ZERO
                   IF    IDX26  <=  IDX28
                     MOVE    1   TO  FLG-CHECK-MAE
                   ELSE
                     MOVE    1   TO  FLG-CHECK-ATO
                   END-IF
                 END-IF
               END-PERFORM
               IF    FLG-CHECK-MAE = ZERO
                 MOVE    SPACE   TO  WRK-ZAIKYO-YMD
                 MOVE    SPACE   TO  WRK-ZAIKYO-YMD2
               END-IF
             ELSE
                 MOVE    SPACE   TO  WRK-ZAIKYO-YMD2
             END-IF
           END-IF
      *
           .
       20011-ZAIKYO-CHECK2-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅患者共同診療料開始日の剤検索
      *****************************************************************
       20011-ZAIKYO-KENSAKU-SEC          SECTION.
      *
           MOVE    ZERO                  TO  FLG-ZAIKYO-OK
           MOVE    SPACE                 TO  WRK-ZAIKYO-NYUGAIKBN
           MOVE    SPACE                 TO  WRK-ZAIKYO-SRYKA
           MOVE    ZERO                  TO  WRK-ZAIKYO-ZAINUM
      *
           PERFORM   VARYING   IDX15    FROM   2   BY  -1
                      UNTIL   (IDX15          <    1)
                       OR     (FLG-ZAIKYO-OK  =    1)
             INITIALIZE                      SRYACT-REC
             MOVE    RECE82-HOSPNUM      TO  SRY-HOSPNUM
             MOVE    IDX15               TO  SRY-NYUGAIKBN
             MOVE    RECE82-PTID         TO  SRY-PTID
             MOVE    WRK-ZAIKYO-YMD(1:6) TO  SRY-SRYYM
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (1)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (2)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (3)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (4)
             MOVE    CONS-ZAIKYO         TO  SRY-SRYCD (5)
             MOVE    SRYACT-REC          TO  MCPDATA-REC
             MOVE    "tbl_sryact"        TO  MCP-TABLE
             MOVE    "key7"              TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC              =   ZERO
               MOVE    "tbl_sryact"      TO  MCP-TABLE
               MOVE    "key7"            TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT     =   1
                         OR     FLG-ZAIKYO-OK  =   1
                 INITIALIZE                  SRYACCT-REC
                 MOVE    SRY-HOSPNUM     TO  ACCT-HOSPNUM
                 MOVE    SRY-NYUGAIKBN   TO  ACCT-NYUGAIKBN
                 MOVE    SRY-PTID        TO  ACCT-PTID
                 MOVE    SRY-SRYKA       TO  ACCT-SRYKA
                 MOVE    SRY-SRYYM       TO  ACCT-SRYYM
                 MOVE    SRY-ZAINUM      TO  ACCT-ZAINUM
                 MOVE    SRYACCT-REC     TO  MCPDATA-REC
                 MOVE    "tbl_sryacct"   TO  MCP-TABLE
                 MOVE    "key31"         TO  MCP-PATHNAME
                 PERFORM 900-DBSELECT-SEC
                 IF      MCP-RC          =   ZERO
                    MOVE "tbl_sryacct"   TO  MCP-TABLE
                    MOVE "key31"         TO  MCP-PATHNAME
                    PERFORM 900-DBFETCH-SEC
                    IF      MCP-RC       =   ZERO
                      MOVE  MCPDATA-REC  TO  SRYACCT-REC
      *
                      MOVE  WRK-ZAIKYO-YMD(7:2)
                                         TO  DAY-IDX2
                      IF   ACCT-DAY(1 DAY-IDX2)  NOT =  ZERO
                        MOVE   1   TO  FLG-ZAIKYO-OK
                        MOVE   ACCT-NYUGAIKBN
                                   TO  WRK-ZAIKYO-NYUGAIKBN
                        MOVE   ACCT-SRYKA
                                   TO  WRK-ZAIKYO-SRYKA
                        MOVE   ACCT-ZAINUM
                                   TO  WRK-ZAIKYO-ZAINUM
                      END-IF
                    END-IF
                 END-IF
                 MOVE    "tbl_sryacct"   TO  MCP-TABLE
                 MOVE    "key31"         TO  MCP-PATHNAME
                 PERFORM   900-CLOSE-SEC
      *
                 MOVE    "tbl_sryact"    TO  MCP-TABLE
                 MOVE    "key7"          TO  MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_sryact"        TO  MCP-TABLE
             MOVE    "key7"              TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
           END-PERFORM
      *
      *++++
      *
           IF      WRK-ZAIKYO-ZAINUM    NOT =    ZERO
              INITIALIZE                         SRYACT-REC
              MOVE    RECE82-HOSPNUM         TO  SRY-HOSPNUM
              MOVE    WRK-ZAIKYO-NYUGAIKBN   TO  SRY-NYUGAIKBN
              MOVE    RECE82-PTID            TO  SRY-PTID
              MOVE    WRK-ZAIKYO-SRYKA       TO  SRY-SRYKA
              MOVE    WRK-ZAIKYO-YMD(1:6)    TO  SRY-SRYYM
              MOVE    WRK-ZAIKYO-ZAINUM      TO  SRY-ZAINUM
              MOVE    SRYACT-REC             TO  MCPDATA-REC
              MOVE    "tbl_sryact"           TO  MCP-TABLE
              MOVE    "key2"                 TO  MCP-PATHNAME
              PERFORM 900-DBSELECT-SEC
              IF      MCP-RC                 =   ZERO
                 MOVE    "tbl_sryact"        TO  MCP-TABLE
                 MOVE    "key2"              TO  MCP-PATHNAME
                 PERFORM  900-SRYACT-READ-SEC
                 PERFORM  UNTIL  (FLG-SRYACT       =  1)
                           OR    (FLG-ZAIKYOCOMARI =  1)
                   PERFORM  VARYING  IDX12  FROM  1  BY  1
                             UNTIL  (IDX12             >    5   )
                              OR    (SRY-SRYCD(IDX12)  =   SPACE)
                              OR    (FLG-ZAIKYOCOMARI  =    1   )
                      IF  SRY-SRYCD(IDX12)  =  "840000086"
                                            OR "842100043"
                         MOVE    1    TO   FLG-ZAIKYOCOMARI
                      END-IF
                   END-PERFORM
                   MOVE    "tbl_sryact"      TO  MCP-TABLE
                   MOVE    "key2"            TO  MCP-PATHNAME
                   PERFORM   900-SRYACT-READ-SEC
                 END-PERFORM
              END-IF
              MOVE    "tbl_sryact"           TO  MCP-TABLE
              MOVE    "key2"                 TO  MCP-PATHNAME
              PERFORM 900-CLOSE-SEC
           END-IF
      *
           .
       20011-ZAIKYO-KENSAKU-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅半固形栄養経管栄養法指導管理料があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-ZAIHANKO-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-ZAIHANKO-COMMENT   NOT =  SPACE
               MOVE    SPACE                TO  WRK-ZAIHANKO-FSANTEIYMD
               INITIALIZE                       SANTEI-REC
               MOVE    RECE82-HOSPNUM       TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID          TO  SANTEI-PTID
               MOVE    RECE82-SRYYM         TO  SANTEI-SRYYM
               EVALUATE  RECE84-FLG-ZAIHANKO-COMMENT
                 WHEN      "9"
                   MOVE  CONS-ZAIHANKO      TO  SANTEI-SRYCD
               END-EVALUATE
               MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                 TO  SANTEI-SRYKA
               MOVE    ZERO                 TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC           TO  MCPDATA-REC
               MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
               MOVE    "key"                TO  WRK-MCP-PATHNAME
               PERFORM  900-SANTEI-INV-SEC
               IF       FLG-SANTEI        =   ZERO
                  MOVE  SANTEI-FSANTEIYMD   TO  WRK-ZAIHANKO-FSANTEIYMD
               END-IF
      *
               IF   WRK-ZAIHANKO-FSANTEIYMD   NOT =  SPACE
      *
                  INITIALIZE                WRK-JIDO-SETCOM-AREA
                  IF   RECE82-SRYYM  >= "202008"
                    MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                  ELSE
                    MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                    MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                  END-IF
                  MOVE       99      TO     FLG-COMMENT
      *
                  MOVE      ZERO     TO     IDZ
                  INITIALIZE                WRK-FREE-AREA2
      *
                  IF   RECE82-SRYYM  >= "202008"
                    EVALUATE  RECE84-FLG-ZAIHANKO-COMMENT
                      WHEN     "9"
                        MOVE   57            TO  IDX-JIDO
                        PERFORM  200111-RECECOMMENT-IDXGET-SEC
                        MOVE   WRK-ZAIHANKO-FSANTEIYMD
                                             TO  WRK-RECECOM-YMD
                        PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    END-EVALUATE
                  ELSE
                    ADD       1       TO     IDZ
                    MOVE      11      TO     WK-FREE-YUKOKETA2(IDZ)
                    MOVE  "初回算定　　　月　　日"
                                      TO     WK-FREE-NAME2(IDZ)
                    MOVE  WRK-ZAIHANKO-FSANTEIYMD(5:2)   TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(11:4)
                    MOVE  WRK-ZAIHANKO-FSANTEIYMD(7:2)   TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(17:4)
                  END-IF
      *
                  PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                  PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
               END-IF
           END-IF
      *
           .
       2001-ZAIHANKO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    外来在宅共同指導料があるか判定
      *  ＃202204選択式コメント対応
      *****************************************************************
       2001-GAIZAI-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-GAIZAI-COMMENT   =    "1"
                INITIALIZE              WRK-JIDO-SETCOM-AREA
                MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                MOVE     99      TO     FLG-COMMENT
                MOVE     138     TO     IDX-JIDO
                PERFORM  200111-RECECOMMENT-IDXGET-SEC
                PERFORM  20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-GAIZAI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    在宅抗菌薬吸入療法用ネブライザ加算があるか判定
      *  ＃202204選択式コメント対応
      *****************************************************************
       2001-KOUYAK-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-KOUYAK-COMMENT  =  "1" OR "2"
      *
             IF   RECE84-FLG-KOUYAK-COMMENT  =  "2"
               MOVE    ZERO              TO  FLG-KOUYAK-COMMENT
               MOVE    SPACE             TO  WRK-KOUYAK-FSANTEIYMD
               INITIALIZE                    SANTEI-REC
               MOVE    RECE82-HOSPNUM    TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID       TO  SANTEI-PTID
               MOVE    CONS-KOUYAK       TO  SANTEI-SRYCD
               MOVE    ZERO              TO  SANTEI-NYUGAIKBN
               MOVE    ZERO              TO  SANTEI-SRYKA
               MOVE    ZERO              TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC        TO  MCPDATA-REC
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL  ( FLG-SANTEI         =   1 )
                             OR   ( FLG-KOUYAK-COMMENT =   1 )
                   IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                     MOVE    SANTEI-FSANTEIYMD
                                         TO  WRK-KOUYAK-FSANTEIYMD
                     MOVE      1         TO  FLG-KOUYAK-COMMENT
                   END-IF
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"      TO  MCP-TABLE
               MOVE    "key3"            TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
             END-IF
      *
             INITIALIZE                WRK-JIDO-SETCOM-AREA
             MOVE      "2"        TO   WRK-JIDO-SETCOMFLG
             MOVE       99        TO   FLG-COMMENT
      *
             MOVE      ZERO       TO   IDZ
             INITIALIZE                WRK-FREE-AREA2
      *
             EVALUATE  RECE84-FLG-KOUYAK-COMMENT
               WHEN      "1"
                 MOVE       139   TO   IDX-JIDO
                 PERFORM    200111-RECECOMMENT-IDXGET-SEC
                 PERFORM    200111-RECECOMMENT-HENSYU-SEC
               WHEN      "2"
                 IF    WRK-KOUYAK-FSANTEIYMD   NOT =  SPACE
                   MOVE     140   TO   IDX-JIDO
                   PERFORM  200111-RECECOMMENT-IDXGET-SEC
                   MOVE     WRK-KOUYAK-FSANTEIYMD
                                  TO  WRK-RECECOM-YMD
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 END-IF
             END-EVALUATE
      *
             PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
           END-IF
      *
           .
       2001-KOUYAK-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    磁気による膀胱等刺激法があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-BOKOHO-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-BOKOHO-COMMENT   =    "1"
             MOVE   CONS-BOKOHO1   TO   WRK-CHECK-SRYCD
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
               MOVE    ZERO                TO  IDX27
               INITIALIZE                      WRK-BOKOHO-YMD2-AREA
               MOVE    ZERO                TO  WRK-ZAIKYO-KAISU
               INITIALIZE                      SANTEI-REC
               MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
               MOVE    RECE82-PTID         TO  SANTEI-PTID
               MOVE    CONS-BOKOHO2        TO  SANTEI-SRYCD
               MOVE    ZERO                TO  SANTEI-NYUGAIKBN
               MOVE    ZERO                TO  SANTEI-SRYKA
               MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
               MOVE    SANTEI-REC          TO  MCPDATA-REC
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-DBSELECT-SEC
               IF      MCP-RC              =   ZERO
                 MOVE    "tbl_santei"    TO  MCP-TABLE
                 MOVE    "key3"          TO  MCP-PATHNAME
                 PERFORM  900-SANTEI-READ-SEC
                 PERFORM   UNTIL   FLG-SANTEI  =   1
      *
                   IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                   AND  SANTEI-SRYYM  >=  WRK-ZAIKYO-YMD(1:6)
                     MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                     MOVE  WRK-ZAIKYO-YMD9(7:2) TO  IDX29
                     PERFORM  VARYING  IDX26  FROM  31  BY  -1
                               UNTIL   IDX26   <     1
                      IF   RECE82-SRYYM  >= "202008"
                       IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                         IF ((SANTEI-SRYYM = WRK-ZAIKYO-YMD(1:6) ) AND
                             (IDX26        < IDX28               ))
                         OR ((SANTEI-SRYYM = WRK-ZAIKYO-YMD9(1:6)) AND
                             (IDX26       >= IDX29               ))
                            CONTINUE
                          ELSE
                           ADD   1      TO  WRK-ZAIKYO-KAISU
                         END-IF
                       END-IF
                      ELSE
                       IF  (SANTEI-DAY(IDX26)  NOT =  ZERO)
                       AND (IDX27              <    30    )
                         IF ((SANTEI-SRYYM = WRK-ZAIKYO-YMD(1:6) ) AND
                             (IDX26        < IDX28               ))
                         OR ((SANTEI-SRYYM = WRK-ZAIKYO-YMD9(1:6)) AND
                             (IDX26       >= IDX29               ))
      *                  初回実施日は通算実施日として記載しない
                         OR ((SANTEI-SRYYM = WRK-ZAIKYO-YMD(1:6) ) AND
                             (IDX26        = IDX28               ))
                           CONTINUE
                         ELSE
                           ADD   1      TO  IDX27
                           MOVE  SANTEI-SRYYM
                                        TO  WRK-BOKOHO-YMD2(IDX27)(1:6)
                           MOVE  IDX26  TO  WRK-BOKOHO-YMD2(IDX27)(7:2)
                         END-IF
                       END-IF
                      END-IF
                     END-PERFORM
                   END-IF
      *
                   MOVE    "tbl_santei"  TO  MCP-TABLE
                   MOVE    "key3"        TO  MCP-PATHNAME
                   PERFORM  900-SANTEI-READ-SEC
                 END-PERFORM
               END-IF
               MOVE    "tbl_santei"        TO  MCP-TABLE
               MOVE    "key3"              TO  MCP-PATHNAME
               PERFORM 900-CLOSE-SEC
      *
               IF  ((RECE82-SRYYM      >= "202008"   ) AND
                    (WRK-ZAIKYO-KAISU      NOT = ZERO))
               OR  ( RECE82-SRYYM      <  "202008"    )
                 INITIALIZE                WRK-JIDO-SETCOM-AREA
                 IF   RECE82-SRYYM  >= "202008"
                   MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 ELSE
      ***          MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
      ***          MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                   CONTINUE
                 END-IF
                 MOVE       99      TO     FLG-COMMENT
      *
                 MOVE      ZERO     TO     IDZ
                 INITIALIZE                WRK-FREE-AREA2
      *
                 IF   RECE82-SRYYM  >= "202008"
                   MOVE   60            TO  IDX-JIDO
                   PERFORM  200111-RECECOMMENT-IDXGET-SEC
                   MOVE   WRK-ZAIKYO-YMD
                                        TO  WRK-RECECOM-YMD
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                   PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                   MOVE   560           TO  IDX-JIDO
                   PERFORM  200111-RECECOMMENT-IDXGET-SEC
                   MOVE   WRK-ZAIKYO-KAISU
                                        TO  WRK-RECECOM-NUM
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                   PERFORM  200111-JIDOSET-HENSYU-SEC
                 ELSE
                   ADD        1       TO     IDZ
                   MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                   MOVE   "初回実施　　　月　　日"
                                      TO     WK-FREE-NAME2(IDZ)
                   MOVE    WRK-ZAIKYO-YMD(5:2)   TO  DAY-IDX2
                   MOVE    TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(11:4)
                   MOVE    WRK-ZAIKYO-YMD(7:2)   TO  DAY-IDX2
                   MOVE    TBL-DAY(DAY-IDX2)
                                      TO     WK-FREE-NAME2(IDZ)(17:4)
      *
                   PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                   IF   WRK-BOKOHO-YMD2(1) NOT =  SPACE
                     MOVE         1       TO     IDX27
                     PERFORM  VARYING  IDX26  FROM  30  BY  -1
                               UNTIL   IDX26   <     1
                      IF  WRK-BOKOHO-YMD2(IDX26)  NOT =  SPACE
                       ADD        1     TO     IDZ
      *
                       ADD        1     TO     IDX27
                       IF    IDX27   <  10
                         MOVE     11    TO     WK-FREE-YUKOKETA2(IDZ)
                         MOVE   "　回目　　　　月　　日"
                                        TO     WK-FREE-NAME2(IDZ)
                         MOVE    IDX27  TO     DAY-IDX2
                         MOVE    TBL-DAY(DAY-IDX2)(3:2)
                                        TO     WK-FREE-NAME2(IDZ)(1:2)
                       ELSE
                         MOVE     11    TO     WK-FREE-YUKOKETA2(IDZ)
                         MOVE   "　　回目　　　月　　日"
                                        TO     WK-FREE-NAME2(IDZ)
                         MOVE    IDX27  TO     DAY-IDX2
                         MOVE    TBL-DAY(DAY-IDX2)
                                        TO     WK-FREE-NAME2(IDZ)(1:4)
                       END-IF
                       MOVE    WRK-BOKOHO-YMD2(IDX26)(5:2) TO  DAY-IDX2
                       MOVE    TBL-DAY(DAY-IDX2)
                                        TO     WK-FREE-NAME2(IDZ)(11:4)
                       MOVE    WRK-BOKOHO-YMD2(IDX26)(7:2) TO  DAY-IDX2
                       MOVE    TBL-DAY(DAY-IDX2)
                                        TO     WK-FREE-NAME2(IDZ)(17:4)
      *
                       PERFORM  200111-JIDOSET-HENSYU-SEC
                      END-IF
                     END-PERFORM
                   END-IF
                 END-IF
      *
                 PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
               END-IF
             END-IF
           END-IF
      *
           .
       2001-BOKOHO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    高気圧酸素治療があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-KIATU-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-KIATU-COMMENT    NOT =  SPACE
             MOVE   CONS-KIATU3   TO   WRK-CHECK-SRYCD
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             MOVE       SPACE               TO  WRK-SJIYMD
             MOVE       ZERO                TO  WRK-ZAIKYO-KAISU
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
                INITIALIZE                      SANTEI-REC
                MOVE    RECE82-HOSPNUM      TO  SANTEI-HOSPNUM
                MOVE    RECE82-PTID         TO  SANTEI-PTID
                EVALUATE  RECE84-FLG-KIATU-COMMENT
                  WHEN      "1"
                    MOVE    CONS-KIATU      TO  SANTEI-SRYCD
                  WHEN      "2"
                    MOVE    CONS-KIATU2     TO  SANTEI-SRYCD
                END-EVALUATE
                MOVE    ZERO                TO  SANTEI-NYUGAIKBN
                MOVE    ZERO                TO  SANTEI-SRYKA
                MOVE    ZERO                TO  SANTEI-HKNCOMBINUM
                MOVE    SANTEI-REC          TO  MCPDATA-REC
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM 900-DBSELECT-SEC
                IF      MCP-RC              =   ZERO
                  MOVE    "tbl_santei"      TO  MCP-TABLE
                  MOVE    "key3"            TO  MCP-PATHNAME
                  PERFORM  900-SANTEI-READ-SEC
                  PERFORM   UNTIL   FLG-SANTEI  =   1
      *
                    IF   SANTEI-SRYYM  <=  RECE82-SRYYM
                    AND  SANTEI-SRYYM  >=  WRK-ZAIKYO-YMD(1:6)
                      MOVE  WRK-ZAIKYO-YMD(7:2)  TO  IDX28
                      MOVE  WRK-ZAIKYO-YMD9(7:2) TO  IDX29
                      PERFORM  VARYING  IDX26  FROM  31  BY  -1
                                UNTIL   IDX26   <     1
                        IF   SANTEI-DAY(IDX26)  NOT =  ZERO
                          IF ((SANTEI-SRYYM =
                                      WRK-ZAIKYO-YMD(1:6) ) AND
                              (IDX26        < IDX28       ))
                          OR ((SANTEI-SRYYM =
                                      WRK-ZAIKYO-YMD9(1:6)) AND
                              (IDX26       >= IDX29       ))
                            CONTINUE
                          ELSE
                            ADD   1       TO  WRK-ZAIKYO-KAISU
                            MOVE  SANTEI-SRYYM
                                          TO  WRK-SJIYMD(1:6)
                            MOVE  IDX26   TO  WRK-SJIYMD(7:2)
                          END-IF
                        END-IF
                      END-PERFORM
                    END-IF
      *
                    MOVE    "tbl_santei"    TO  MCP-TABLE
                    MOVE    "key3"          TO  MCP-PATHNAME
                    PERFORM  900-SANTEI-READ-SEC
                  END-PERFORM
                END-IF
                MOVE    "tbl_santei"        TO  MCP-TABLE
                MOVE    "key3"              TO  MCP-PATHNAME
                PERFORM 900-CLOSE-SEC
             END-IF
      *
             IF  ((RECE82-SRYYM      >= "202008") AND
                  (WRK-SJIYMD        NOT = SPACE) AND
                  (WRK-ZAIKYO-KAISU  NOT =  ZERO))
             OR  ((RECE82-SRYYM      <  "202008") AND
                  (WRK-SJIYMD        NOT = SPACE) AND
                  (WRK-ZAIKYO-KAISU  NOT =  ZERO) AND
                  (WRK-ZAIKYO-KAISU     <=   31 ))
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE82-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                ELSE
                  MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                  MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                END-IF
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                IF   RECE82-SRYYM  >= "202008"
                  EVALUATE  RECE84-FLG-KIATU-COMMENT
                    WHEN      "1"
                      MOVE   61            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-SJIYMD    TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                      MOVE   561           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-KAISU
                                           TO  WRK-RECECOM-NUM
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                      MOVE  1061           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      PERFORM  200111-JIDOSET-HENSYU-SEC
                    WHEN      "2"
                      MOVE   62            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-SJIYMD    TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                      MOVE   562           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-KAISU
                                           TO  WRK-RECECOM-NUM
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-EVALUATE
                ELSE
                  IF    RECE84-FLG-KIATU-COMMENT  =  "1"
                    ADD        1       TO   IDZ
                    MOVE       9       TO   WK-FREE-YUKOKETA2(IDZ)
                    MOVE   "発症　　　月　　日"
                                       TO   WK-FREE-NAME2(IDZ)
                    MOVE    WRK-ZAIKYO-YMD(5:2)  TO  DAY-IDX2
                    MOVE    TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(7:4)
                    MOVE    WRK-ZAIKYO-YMD(7:2)  TO  DAY-IDX2
                    MOVE    TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(13:4)
      *
                    PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-IF
      *
                  ADD          1       TO   IDZ
                  MOVE         11      TO   WK-FREE-YUKOKETA2(IDZ)
                  MOVE     "初回実施　　　月　　日"
                                       TO   WK-FREE-NAME2(IDZ)
                  MOVE      WRK-SJIYMD(5:2)   TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(11:4)
                  MOVE      WRK-SJIYMD(7:2)   TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(17:4)
      *
                  PERFORM    200111-JIDOSET-HENSYU-SEC
      *
                  ADD          1       TO   IDZ
                  MOVE         11      TO   WK-FREE-YUKOKETA2(IDZ)
                  MOVE     "通算実施回数（　　回）"
                                       TO   WK-FREE-NAME2(IDZ)
                  MOVE      WRK-ZAIKYO-KAISU  TO  DAY-IDX2
                  MOVE      TBL-DAY(DAY-IDX2)
                                       TO   WK-FREE-NAME2(IDZ)(15:4)
      *
                  PERFORM    200111-JIDOSET-HENSYU-SEC
                END-IF
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-KIATU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    人工腎臓等のコメントがあるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-JINZOUETC-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-JINZOU-COMMENT   =    "1"
             IF   RECE82-SRYYM  >= "201810"
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               IF   RECE82-SRYYM  >= "202004"
                 MOVE     2       TO     WRK-JIDO-JYOUGEFLG
               ELSE
                 MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                 MOVE     1       TO     WRK-JIDO-JYOUGEFLG
               END-IF
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
             ELSE
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
             END-IF
           END-IF
      *
           .
       2001-JINZOUETC-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    局所陰圧閉鎖処置のコメントがあるか判定
      *  ＃202008選択式コメント対応
      *  （202009で自動記載廃止）
      *  （再度202204から自動記載）
      *****************************************************************
       2001-KYOKUIN-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-KYOKUIN-COMMENT   =    "1" OR "2"
             IF     RECE82-SRYYM  >= "202008"
                 EVALUATE  RECE84-FLG-KYOKUIN-COMMENT
                   WHEN     "1"
                     INITIALIZE            WRK-JIDO-SETCOM-AREA
                     MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
                     MOVE       99      TO     FLG-COMMENT
                     MOVE       80      TO     IDX-JIDO
                     PERFORM    200111-RECECOMMENT-IDXGET-SEC
                     PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
                   WHEN     "2"
                     INITIALIZE            WRK-JIDO-SETCOM-AREA
                     MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
                     MOVE       99      TO     FLG-COMMENT
                     MOVE       142     TO     IDX-JIDO
                     PERFORM    200111-RECECOMMENT-IDXGET-SEC
                     PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
                 END-EVALUATE
             ELSE
               IF   RECE82-SRYYM  >= "201810"
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE       2       TO     WRK-JIDO-SETCOMATFLG
                 MOVE       1       TO     WRK-JIDO-JYOUGEFLG
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
               ELSE
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
               END-IF
             END-IF
           END-IF
      *
           .
       2001-KYOKUIN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日のコメントがあるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-SHUJUTSU-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-SHUJUTU-COMMENT   =    SPACE
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               IF   RECE82-SRYYM  >= "202004"
                 MOVE     2       TO     WRK-JIDO-JYOUGEFLG
               END-IF
               MOVE       1       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
           ELSE
               PERFORM    2099-RECE84-WRITE-SEC
           END-IF
      *
           .
       2001-SHUJUTSU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    麻酔日のコメントがあるか判定
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-MASUI-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-MASUI-COMMENT   =    SPACE
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               IF   RECE82-SRYYM  >= "202004"
                 MOVE     2       TO     WRK-JIDO-JYOUGEFLG
               END-IF
               MOVE       8       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
           ELSE
               PERFORM    2099-RECE84-WRITE-SEC
           END-IF
      *
           .
       2001-MASUI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    （検選）のコメントがあるか判定
      *****************************************************************
       2001-KENSEN-HANTEI-SEC          SECTION.
      *
           IF     RECE84-SAFLG   =    "2"
               MOVE       99      TO     FLG-COMMENT
               PERFORM    20011-KENSENTOU-COMMENT-SEC
           END-IF
      *
           .
       2001-KENSEN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    （検選）等のコメント編集
      *****************************************************************
       20011-KENSENTOU-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-RECE85-TAIHI-SEC
      *
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           PERFORM
             UNTIL  ( FLG-RECE85           =   1                   )
             OR     ( RECE84-HOSPNUM   NOT =   RECE85-HOSPNUM      )
             OR     ( RECE84-SRYYM     NOT =   RECE85-SRYYM        )
             OR     ( RECE84-NYUGAIKBN NOT =   RECE85-NYUGAIKBN    )
             OR     ( RECE84-PTID      NOT =   RECE85-PTID         )
             OR     ( RECE84-RECEKA    NOT =   RECE85-RECEKA       )
             OR     ( RECE84-HKNID     NOT =   RECE85-HKNID        )
             OR     ( RECE84-TEKSTYMD  NOT =   RECE85-TEKSTYMD     )
             OR     ( RECE84-ZAINUM    NOT =   RECE85-ZAINUM       )
      *
             PERFORM   VARYING   IDX   FROM    1   BY  1
                       UNTIL   ( IDX               >   5     )
                       OR      ( RECE85-SRYCD(IDX) =   SPACE )
                  ADD    1             TO      IDX-RECE85
                  MOVE   RECE85-SRYACT-TBL(IDX)
                             TO   WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
      *++++++
                  IF    IDX-RECE85  =  RECE84-MEISAISU
      *
                    IF  WRK-RECE85XX-SRYCD(IDX-RECE85 1)(1:1)  = "8"
                    OR  WRK-RECE85XX-SRYCD(IDX-RECE85 1)(1:3)  = "008"
      *
                        COMPUTE   IDV  =
                         (WRK-RECE85XX-YUKOKETA(IDX-RECE85 1) * 2) + 1
      *
                        MOVE    1    TO   IDV2
                        IF  WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)
                                                           NOT = SPACE
                          PERFORM  VARYING  IDV3  FROM  140  BY  -1
                                    UNTIL   IDV3    <     1
                            IF  WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)
                                                 (IDV3:1)  NOT = SPACE
                              COMPUTE  IDV2 = IDV2 + IDV3
                              MOVE     1   TO IDV3
                            END-IF
                          END-PERFORM
                        END-IF
      *
                        IF   IDV2  <= 131
                          MOVE    "　×"   TO
                          WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)(IDV2:4)
                        END-IF
                        IF   IDV   <= 291
                          MOVE    "　×"   TO
                          WRK-RECE85XX-NAME(IDX-RECE85 1)(IDV:4)
                        END-IF
      *
                        COMPUTE   IDV  =  IDV  +  4
                        COMPUTE   IDV2 =  IDV2 +  4
      *
                        MOVE    RECE84-ZAIKAISU   TO   DAY-IDX4
                        PERFORM 20011-KAISU-HENSYU2-SEC
                        IF   IDV2  <= 135
                          MOVE    WRK-HENSYU-KAISU4  TO
                          WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)(IDV2:6)
                        END-IF
                        IF   IDV   <= 295
                          MOVE    WRK-HENSYU-KAISU4  TO
                          WRK-RECE85XX-NAME(IDX-RECE85 1)(IDV:6)
                          COMPUTE WRK-RECE85XX-YUKOKETA(IDX-RECE85 1) =
                                  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1) +
                                  5
                        END-IF
      *
                    END-IF
      *
                  END-IF
      *++++++
             END-PERFORM 
      *
             PERFORM 990-RECE85-NEXT-SEC
      *
           END-PERFORM
      *
      *    手術日コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
      *
                  INITIALIZE                        RECE859-REC
                  MOVE    WRK-RECE85-KEY       TO   RECE859-KEY
                  ADD     1                    TO   WRK-RENNUM
                  MOVE    WRK-RENNUM           TO   RECE859-RENNUM
                  MOVE    WRK-RECE85-PTNUM     TO   RECE859-PTNUM
                  MOVE    WRK-RECE85-SRYKA     TO   RECE859-SRYKA
                  MOVE    WRK-RECE85-SRYKBN    TO   RECE859-SRYKBN
                  MOVE    WRK-RECE85-SRYSYUKBN TO   RECE859-SRYSYUKBN
                  MOVE    WRK-RECE85-JIHIMONEY TO   RECE859-JIHIMONEY
                  PERFORM  VARYING   IDX   FROM   1   BY   1
                           UNTIL   (IDX       >    5)   OR
                                   (FLG-WRKRECE85   =   1)
                     ADD         1             TO    IDX-RECE85
                     IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                     OR (IDX-RECE85                       >  100 )
                         MOVE    1             TO    FLG-WRKRECE85
                     ELSE
                         MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                          TO   RECE859-SRYACT-TBL(IDX)
      *
                         ADD    1    TO   WRK-CNT-MEISAI
      *
                     END-IF  
                  END-PERFORM
                  IF   RECE859-SRYCD(1)  NOT =  SPACE
                       PERFORM 800-RECE859-WRITE-SEC
                  END-IF
           END-PERFORM
      *
           MOVE    RECE84-REC        TO      RECE849-REC
           MOVE    WRK-CNT-MEISAI    TO      RECE849-MEISAISU
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       20011-KENSENTOU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    回数編集
      *****************************************************************
       20011-KAISU-HENSYU-SEC          SECTION.
      *
           MOVE    SPACE                TO  WRK-HENSYU-KAISU
           MOVE    SPACE                TO  WRK-HENSYU-KAISU2
      *
           MOVE    DAY-IDX2             TO  WRK-HENSYU-KAISU
           IF      WRK-HENSYU-KAISU(1:1) =  "0"
               MOVE      SPACE          TO  WRK-HENSYU-KAISU(1:1)
           END-IF
      *
           INITIALIZE                       ORCSKANACHKAREA
           MOVE    "2"                  TO  KANACHK-SYORI
           MOVE    WRK-HENSYU-KAISU     TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
           IF      KANACHK-RC      =   ZERO
                MOVE    KANACHK-OUT-INPUT(1:4)
                                        TO  WRK-HENSYU-KAISU2
           END-IF
      *
           .
       20011-KAISU-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    回数編集２
      *****************************************************************
       20011-KAISU-HENSYU2-SEC          SECTION.
      *
           MOVE    SPACE                TO  WRK-HENSYU-KAISU3
           MOVE    SPACE                TO  WRK-HENSYU-KAISU4
      *
           MOVE    DAY-IDX4             TO  WRK-HENSYU-KAISU3
           IF      WRK-HENSYU-KAISU3(1:1) =  "0"
               MOVE      SPACE          TO  WRK-HENSYU-KAISU3(1:1)
           END-IF
           IF      WRK-HENSYU-KAISU3(2:1) =  "0"
               MOVE      SPACE          TO  WRK-HENSYU-KAISU3(2:1)
           END-IF
      *
           INITIALIZE                       ORCSKANACHKAREA
           MOVE    "2"                  TO  KANACHK-SYORI
           MOVE    WRK-HENSYU-KAISU3    TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
           IF      KANACHK-RC      =   ZERO
                MOVE    KANACHK-OUT-INPUT(1:6)
                                        TO  WRK-HENSYU-KAISU4
           END-IF
      *
           .
       20011-KAISU-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    検査（ＢＮＰ、ＮＴ−ｐｒｏＢＮＰ、ＨＡＮＰ）があるか判定
      *  ＃202010選択式コメント対応
      *****************************************************************
       2001-KENSA-HANTEI-SEC          SECTION.
      *
           IF  ((RECE82-SRYYM  >= "201804"       ) AND
                (RECE84-FLG-KENSA-COMMENT  =  "1") AND
                (CNT-KENSA                >=   2 ))
           OR  ((RECE82-SRYYM  <= "201803"       ) AND
                (RECE84-FLG-KENSA-COMMENT  =  "1"))
               INITIALIZE            WRK-JIDO-SETCOM-AREA
      ***      MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
      ***      MOVE       1       TO     WRK-JIDO-SETCOMATFLG
               IF   RECE82-SRYYM  >= "202010"
                 MOVE    "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE     1       TO     WRK-JIDO-SETCOMATFLG
                 MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
               END-IF
               MOVE       7       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-KENSA-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    時間外緊急院内検査加算・外来迅速検体検査加算があるか判定
      *  ＃202007コメント対応「840000099」+「引き続き入院」
      *****************************************************************
       2001-KENKSN-HANTEI-SEC          SECTION.
      *
           MOVE   ZERO  TO   FLG-OK2
           IF     RECE84-FLG-KENKSN-COMMENT  =  "1"
               PERFORM  20011-NYUINRRK-KENSAKU-SEC
           END-IF
      *
           IF   RECE82-SRYYM  >=  "202007"
             IF   RECE84-FLG-KENKSN2-COMMENT =  "1"
             OR   FLG-OK2  =  1
               INITIALIZE          WRK-JIDO-SETCOM-AREA
               IF     RECE84-FLG-KENKSN2-COMMENT =  "1"
               AND    FLG-OK2                    =  ZERO
                 MOVE    "3"    TO     WRK-JIDO-SETCOMFLG
               ELSE
                 IF   RECE84-FLG-KENKSN2-COMMENT =  "1"
                 AND  FLG-OK2                    =   1
                   MOVE  "4"    TO     WRK-JIDO-SETCOMFLG
                 ELSE
                   MOVE  "5"    TO     WRK-JIDO-SETCOMFLG
                 END-IF
               END-IF
               MOVE     99      TO     FLG-COMMENT
               PERFORM  20011-SHUJUTSU-ETC2-COMMENT-SEC
             END-IF
           ELSE
             IF   FLG-OK2  =  1
                  INITIALIZE                WRK-JIDO-SETCOM-AREA
                  MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                  MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                  MOVE       99      TO     FLG-COMMENT
      *
                  PERFORM  200111-RECE85-TAIHI-SEC
      *
      *           ＲＥＣＥ０５ファイルの内容をテーブルに退避
                  MOVE    ZERO                 TO  IDX-RECE85
                  MOVE    SPACE                TO  WRK-RECE85XX-REC
                  INITIALIZE                       WRK-RECE85XX-REC
      *
                  MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *           「引き続き入院」
                  MOVE    "820100129"          TO  WRK-TENSU-SRYCD
                  MOVE    RECE82-SRYYM         TO  WRK-TENSU-SRYYM
                  PERFORM 900-TENSU-TBL-SEC
      *
                  COMPUTE MAX-MEISAISU = MAX-MEISAISU + 1
                  MOVE  TNS-SRYCD
                             TO WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                  MOVE  ZERO TO WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                  MOVE  TNS-YUKOKETA
                             TO WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                  MOVE  TNS-NAME
                             TO WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                                WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
                  MOVE  "2"  TO WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
                  MOVE  WRK-JIDO-SETCOMATFLG
                             TO WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
                  MOVE  WRK-JIDO-RECEDENFLG
                             TO WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
                  MOVE  "1"  TO WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
                  PERFORM 200111-SRYACTINF-HENSYU-SEC
             END-IF
           END-IF
      *
           .
       2001-KENKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院履歴検索
      *****************************************************************
       20011-NYUINRRK-KENSAKU-SEC          SECTION.
      *
           PERFORM  VARYING  IDX44  FROM  1  BY  1
                     UNTIL  (IDX44    >  31)
                      OR    (FLG-OK2  =   1)
             IF   RECE84-KAISU(1 IDX44)  NOT =  ZERO
               INITIALIZE                      PTNYUINRRK-REC
               MOVE    RECE82-HOSPNUM      TO  PTNYUINRRK-HOSPNUM
               MOVE    RECE82-PTID         TO  PTNYUINRRK-PTID
               MOVE    RECE82-SRYYM        TO  PTNYUINRRK-NYUINYMD(1:6)
               MOVE    IDX44               TO  PTNYUINRRK-NYUINYMD(7:2)
               MOVE    PTNYUINRRK-REC      TO  MCPDATA-REC
               MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
               MOVE    "key39"             TO  MCP-PATHNAME
               PERFORM  900-DBSELECT-SEC
               IF      MCP-RC   =   ZERO
                 MOVE    "tbl_ptnyuinrrk"  TO  MCP-TABLE
                 MOVE    "key39"           TO  MCP-PATHNAME
                 PERFORM  900-PTNYUINRRK-READ-SEC
                 IF    FLG-PTNYUINRRK  =  ZERO
                    MOVE    1              TO  FLG-OK2
                 END-IF
               END-IF
               MOVE    "tbl_ptnyuinrrk"    TO  MCP-TABLE
               MOVE    "key39"             TO  MCP-PATHNAME
               PERFORM  900-CLOSE-SEC
             END-IF
           END-PERFORM
      *
           .
       20011-NYUINRRK-KENSAKU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＣＴ・ＭＲＩがあるか判定
      *****************************************************************
       2001-CTMRI-HANTEI-SEC          SECTION.
      *
           IF    ( RECE84-FLG-CTMRI-COMMENT   =    "1"  )
           OR    ((RECE84-FLG-CTMRI-COMMENT   =   SPACE) AND
                  (RECE84-SENTAKUBUIFLG   NOT =   SPACE))
             IF    RECE84-FLG-CTMRI-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                MOVE       2       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC-COMMENT-SEC
             ELSE
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                MOVE       99      TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC3-COMMENT-SEC
             END-IF
           END-IF
      *
           .
       2001-CTMRI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    時間外緊急院内画像診断加算があるか判定
      *  ＃202007コメント対応「840000099」+「引き続き入院」
      *****************************************************************
       2001-KINGAZ-HANTEI-SEC          SECTION.
      *
           MOVE   ZERO  TO   FLG-OK2
           IF     RECE84-FLG-KINGAZ-COMMENT  =  "1"
               PERFORM  20011-NYUINRRK-KENSAKU-SEC
           END-IF
      *
           IF   RECE82-SRYYM  >=  "202007"
             IF   RECE84-FLG-KINGAZ2-COMMENT =  "1"
             OR   FLG-OK2  =  1
               INITIALIZE          WRK-JIDO-SETCOM-AREA
               IF     RECE84-FLG-KINGAZ2-COMMENT =  "1"
               AND    FLG-OK2                    =  ZERO
                 MOVE    "3"    TO     WRK-JIDO-SETCOMFLG
               ELSE
                 IF   RECE84-FLG-KINGAZ2-COMMENT =  "1"
                 AND  FLG-OK2                    =   1
                   MOVE  "4"    TO     WRK-JIDO-SETCOMFLG
                 ELSE
                   MOVE  "5"    TO     WRK-JIDO-SETCOMFLG
                 END-IF
               END-IF
               MOVE     99      TO     FLG-COMMENT
               PERFORM  20011-SHUJUTSU-ETC2-COMMENT-SEC
             END-IF
           ELSE
             IF   FLG-OK2  =  1
                  INITIALIZE                WRK-JIDO-SETCOM-AREA
                  MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                  MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                  MOVE       99      TO     FLG-COMMENT
      *
                  PERFORM  200111-RECE85-TAIHI-SEC
      *
      *           ＲＥＣＥ０５ファイルの内容をテーブルに退避
                  MOVE    ZERO                 TO  IDX-RECE85
                  MOVE    SPACE                TO  WRK-RECE85XX-REC
                  INITIALIZE                       WRK-RECE85XX-REC
      *
                  MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *           「引き続き入院」
                  MOVE    "820100129"          TO  WRK-TENSU-SRYCD
                  MOVE    RECE82-SRYYM         TO  WRK-TENSU-SRYYM
                  PERFORM 900-TENSU-TBL-SEC
      *
                  COMPUTE MAX-MEISAISU = MAX-MEISAISU + 1
                  MOVE  TNS-SRYCD
                             TO WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                  MOVE  ZERO TO WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                  MOVE  TNS-YUKOKETA
                             TO WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                  MOVE  TNS-NAME
                             TO WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                                WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
                  MOVE  "2"  TO WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
                  MOVE  WRK-JIDO-SETCOMATFLG
                             TO WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
                  MOVE  WRK-JIDO-RECEDENFLG
                             TO WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
                  MOVE  "1"  TO WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
                  PERFORM 200111-SRYACTINF-HENSYU-SEC
             END-IF
           END-IF
      *
           .
       2001-KINGAZ-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科退院前訪問指導料があるか判定
      *****************************************************************
       2001-HOUMONSIDO-SEI-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-HOUSEI-COMMENT   =    "1"
                INITIALIZE            WRK-JIDO-SETCOM-AREA
                MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                MOVE       3       TO     FLG-COMMENT
                PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
           END-IF
      *
           .
       2001-HOUMONSIDO-SEI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    退院時服薬指導加算を算定時の前月薬剤管理指導料のコメント編集
      *****************************************************************
       20011-TAIIN-COMMENT-SEC          SECTION.
      *
           MOVE       RECE84-REC       TO  RECE849-REC
           EVALUATE   FLG-HANTEI
             WHEN       1
                ADD     1              TO  RECE849-MEISAISU
             WHEN       2
                ADD     2              TO  RECE849-MEISAISU
           END-EVALUATE
           MOVE   "1"                  TO  RECE849-SETCOMFLG
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE84-SET85-SEC
           MOVE    RECE84-ZAINUM       TO  RECE85-ZAINUM
           START   RECE85-FILE
                 KEY IS    >=   RECE85-KEY
                 INVALID
                     MOVE    1           TO  FLG-RECE85
                 NOT INVALID
                     PERFORM 990-RECE85-NEXT-SEC
           END-START
      *
           MOVE    RECE85-REC           TO  RECE859-REC
           EVALUATE   FLG-HANTEI
             WHEN       1
               MOVE    RECE85-SRYACT-TBL(1) TO  RECE859-SRYACT-TBL(1)
               MOVE    RECE85-SRYACT-TBL(2) TO  RECE859-SRYACT-TBL(3)
               MOVE    RECE85-SRYACT-TBL(3) TO  RECE859-SRYACT-TBL(4)
               MOVE    RECE85-SRYACT-TBL(4) TO  RECE859-SRYACT-TBL(5)
      *
               MOVE    SPACE                TO  RECE859-SRYACT-TBL(2)
               INITIALIZE                       RECE859-SRYACT-TBL(2)
               MOVE    "810000001"          TO  RECE859-SRYCD(2)
               MOVE    ZERO                 TO  RECE859-SRYSURYO(2)
               PERFORM  200111-SANTEI-DAY-SEC
               PERFORM  200111-TAIIN-COMMENT-HENSYU-SEC
               MOVE     "2"                 TO  RECE859-MEISKYFLG(2)
      *#       MOVE     104                 TO  RECE859-SETCOMATFLG(2)
               MOVE      1                  TO  RECE859-SETCOMATFLG(2)
               MOVE     "1"                 TO  RECE859-SIKFLG(2)
             WHEN       2
               MOVE    RECE85-SRYACT-TBL(1) TO  RECE859-SRYACT-TBL(1)
               MOVE    RECE85-SRYACT-TBL(2) TO  RECE859-SRYACT-TBL(4)
               MOVE    RECE85-SRYACT-TBL(3) TO  RECE859-SRYACT-TBL(5)
      *
               MOVE    SPACE                TO  RECE859-SRYACT-TBL(2)
               INITIALIZE                       RECE859-SRYACT-TBL(2)
               MOVE    "810000001"          TO  RECE859-SRYCD(2)
               MOVE    ZERO                 TO  RECE859-SRYSURYO(2)
               PERFORM  200111-SANTEI-DAY-SEC
               PERFORM  200111-TAIIN-COMMENT-HENSYU-SEC
               MOVE     "2"                 TO  RECE859-MEISKYFLG(2)
      *#       MOVE     104                 TO  RECE859-SETCOMATFLG(2)
               MOVE      1                  TO  RECE859-SETCOMATFLG(2)
               MOVE     "1"                 TO  RECE859-SIKFLG(2)
      *
               MOVE    SPACE                TO  RECE859-SRYACT-TBL(3)
               INITIALIZE                       RECE859-SRYACT-TBL(3)
               MOVE    "810000001"          TO  RECE859-SRYCD(3)
               MOVE    ZERO                 TO  RECE859-SRYSURYO(3)
               MOVE    16                   TO  RECE859-YUKOKETA(3)
               MOVE    "薬剤管理指導料算定　　　月　　日"
                                            TO  RECE859-NAME(3)
               MOVE     WRK-TUKI-YAKUKAN    TO  DAY-IDX
               MOVE     TBL-DAY(DAY-IDX)    TO  RECE859-NAME(3)(21:4)
               MOVE     WRK-DAY-YAKUKAN     TO  DAY-IDX
               MOVE     TBL-DAY(DAY-IDX)    TO  RECE859-NAME(3)(27:4)
               MOVE     "2"                 TO  RECE859-MEISKYFLG(3)
      *#       MOVE     104                 TO  RECE859-SETCOMATFLG(3)
               MOVE      1                  TO  RECE859-SETCOMATFLG(3)
               MOVE     "1"                 TO  RECE859-SIKFLG(3)
           END-EVALUATE
      *
           PERFORM 800-RECE859-WRITE-SEC
      *
           .
       20011-TAIIN-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定日編集
      *****************************************************************
       200111-TAIIN-COMMENT-HENSYU-SEC          SECTION.
      *
           MOVE     TB-SANTEI-DAY(1)    TO  DAY-IDX
           IF       DAY-IDX  <  10
             MOVE    5                  TO  RECE859-YUKOKETA(2)
             MOVE    "算定　　日"       TO  RECE859-NAME(2)(1:10)
             MOVE   TBL-DAY(DAY-IDX)    TO  RECE859-NAME(2)(5:4)
             MOVE   11                  TO  IDX17
           ELSE
             MOVE    6                  TO  RECE859-YUKOKETA(2)
             MOVE    "算定　　　日"     TO  RECE859-NAME(2)(1:12)
             MOVE   TBL-DAY(DAY-IDX)    TO  RECE859-NAME(2)(7:4)
             MOVE   13                  TO  IDX17
           END-IF
           IF       TB-SANTEI-DAY(2)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(2)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE859-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE859-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE859-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE859-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE859-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE859-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
           IF       TB-SANTEI-DAY(3)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(3)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE859-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE859-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE859-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE859-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE859-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE859-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
           IF       TB-SANTEI-DAY(4)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(4)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE859-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE859-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE859-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE859-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE859-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE859-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
           IF       TB-SANTEI-DAY(5)  NOT = ZERO
             MOVE   TB-SANTEI-DAY(5)    TO  DAY-IDX
             IF       DAY-IDX  <  10
               ADD   3              TO  RECE859-YUKOKETA(2)
               MOVE  "、　日"       TO  RECE859-NAME(2)(IDX17:6)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)(3:2)
                                    TO  RECE859-NAME(2)(IDX18:2)
               COMPUTE  IDX17 = IDX17 + 6
             ELSE
               ADD   4              TO  RECE859-YUKOKETA(2)
               MOVE  "、　　日"     TO  RECE859-NAME(2)(IDX17:8)
               COMPUTE  IDX18 = IDX17 + 2
               MOVE TBL-DAY(DAY-IDX)
                                    TO  RECE859-NAME(2)(IDX18:4)
               COMPUTE  IDX17 = IDX17 + 8
             END-IF
           END-IF
      *
           .
       200111-TAIIN-COMMENT-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    コメント編集（差込：上）
      *****************************************************************
       20011-SHUJUTSU-ETC-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-SANTEI-DAY-SEC
      *
           MOVE       ZERO       TO   IDZ                               
           INITIALIZE            WRK-FREE-AREA2                         
      *
           PERFORM  20011-FREE-COMMENT2-SEC                              
      *
           PERFORM  200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                ADD    1       TO  IDX-RECE85
                MOVE   "810000001"
                               TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                MOVE   ZERO    TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                               TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                MOVE   WK-FREE-NAME2(IDX)
                               TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                MOVE    "1"    TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
                IF     WRK-JIDO-JYOUGEFLG  NOT = ZERO
                  MOVE  "1"    TO  WRK-RECE85XX-RECEDENFLG(IDX-RECE85 1)
                END-IF
           END-PERFORM 
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-SHUJUTSU-ETC-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    コメント編集２（差込：下）
      *****************************************************************
       20011-SHUJUTSU-ETC2-COMMENT-SEC          SECTION.
      *
           PERFORM   200111-SANTEI-DAY-SEC
      *
           MOVE       ZERO       TO   IDZ                               
           INITIALIZE            WRK-FREE-AREA2                         
      *
           IF  ((RECE82-SRYYM       >=  "202008"         ) AND
                (WRK-JIDO-SETCOMFLG  =  "2"              ))
           OR  ((RECE82-SRYYM       >=  "202007"         ) AND
                (WRK-JIDO-SETCOMFLG  =  "3" OR "4" OR "5"))
             PERFORM  VARYING  IDX  FROM  1  BY  1
                       UNTIL  (IDX                 >    31)
                         OR   (TB-SANTEI-DAY(IDX)  =  ZERO)
               EVALUATE  WRK-JIDO-SETCOMFLG
                 WHEN      "2"
                   MOVE  RECE82-SRYYM       TO  WRK-RECECOM-YMD(1:6)
                   MOVE  TB-SANTEI-DAY(IDX) TO  WRK-RECECOM-YMD(7:2)
                   PERFORM  200111-RECECOMMENT-HENSYU-SEC
                 WHEN      "3"
                 WHEN      "4"
                   INITIALIZE                   WRK-RECECOM-AREA
                   MOVE  RECE82-SRYYM       TO  WRK-RECECOM-YMD(1:6)
                   MOVE  TB-SANTEI-DAY(IDX) TO  WRK-RECECOM-YMD(7:2)
                   PERFORM  200111-RECECOMMENT-HENSYU3-SEC
               END-EVALUATE
             END-PERFORM
           ELSE
             PERFORM  20011-FREE-COMMENT2-SEC
           END-IF
      *
           IF   (RECE82-SRYYM       >=  "202007"  )
           AND  (WRK-JIDO-SETCOMFLG  =  "4" OR "5")
                   PERFORM  200111-RECECOMMENT-HENSYU4-SEC
           END-IF
      *
           PERFORM   200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
                IF  WK-FREE-SRYCD2(IDX) = SPACE
                  MOVE "810000001"
                              TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                ELSE
                  MOVE WK-FREE-SRYCD2(IDX)
                              TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                END-IF
                MOVE   ZERO   TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                              TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                MOVE   WK-FREE-INPUTCOMENT2(IDX)
                          TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
                MOVE   WK-FREE-MEISKYFLG2(IDX)
                          TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
                MOVE   WK-FREE-SETCOMATFLG2(IDX)
                          TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
                MOVE   WK-FREE-RECEDENFLG2(IDX)
                          TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
                MOVE    "1"   TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           END-PERFORM 
      *
           IF    FLG-KAISIEN  =  1
            IF   RECE82-SRYYM  >= "202008"
              MOVE   ZERO          TO  IDZ
              INITIALIZE           WRK-FREE-AREA2
              MOVE   78            TO  IDX-JIDO
              PERFORM  200111-RECECOMMENT-IDXGET-SEC
              MOVE   WRK-KAISIEN-FSANTEIYMD
                                   TO  WRK-RECECOM-YMD
              PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE  WK-FREE-SRYCD2(1)
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
              MOVE  ZERO    TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE  WK-FREE-YUKOKETA2(1)
                            TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  WK-FREE-NAME2(1)
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              MOVE  WK-FREE-INPUTCOMENT2(1)
                            TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
              MOVE  "1"     TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
              MOVE  ZERO    TO  FLG-KAISIEN
              MOVE  "2"     TO  WRK-JIDO-SETCOMFLG
            ELSE
              COMPUTE  MAX-MEISAISU  =   MAX-MEISAISU  +  1
              MOVE   "810000001"
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
              MOVE   ZERO   TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
              MOVE   12     TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE   "初回算定日　　　月　　日"
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              MOVE   WRK-KAISIEN-FSANTEIYMD(5:2)   TO  DAY-IDX2
              MOVE   TBL-DAY(DAY-IDX2)
                       TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(13:4)
              MOVE   WRK-KAISIEN-FSANTEIYMD(7:2)   TO  DAY-IDX2
              MOVE   TBL-DAY(DAY-IDX2)
                       TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(19:4)
              MOVE   "2"    TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
      *#      MOVE   106    TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
              MOVE    1     TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
              MOVE   SPACE  TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
              MOVE   "1"    TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
              MOVE   ZERO   TO  FLG-KAISIEN
            END-IF
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-SHUJUTSU-ETC2-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    手術日等のコメント編集（差込：上）
      *    ※剤先頭に部位コメントを差し込むために＠明細追加する
      *****************************************************************
       20011-SHUJUTSU-ETC3-COMMENT-SEC          SECTION.
      *
           PERFORM  200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           PERFORM  VARYING  IDX50  FROM  1  BY  1
                     UNTIL  (IDX50 >   10                )
                      OR    (IDX50 > RECE84-SENTAKUBUICNT)
             ADD   1           TO IDX-RECE85
             MOVE  "810000001" TO WRK-RECE85XX-SRYCD(IDX-RECE85 1)
             MOVE  ZERO        TO WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
             MOVE  ZERO        TO WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
             MOVE  SPACE       TO WRK-RECE85XX-NAME(IDX-RECE85 1)
             MOVE  "1"         TO WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
             MOVE  "1"         TO WRK-RECE85XX-RECEDENFLG(IDX-RECE85 1)
             MOVE  "1"         TO WRK-RECE85XX-RECEPTFLG(IDX-RECE85 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-SHUJUTSU-ETC3-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    包括診療分のコメント編集（差込：上）
      *****************************************************************
       20011-HOKATU-COMMENT-SEC          SECTION.
      *
           PERFORM  200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           ADD    1             TO  IDX-RECE85
           MOVE  "810000001"    TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
           MOVE   ZERO          TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
      *
           IF    RECE84-ZAIKBN  =  3 OR 4
             EVALUATE  RECE84-JISANYAKKBN
              WHEN     "1"
               MOVE  19    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療・自院処方分）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "2"
               MOVE  19    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療・他院処方分）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "3"
               MOVE  20    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療外・自院処方分）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "4"
               MOVE  20    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療外・他院処方分）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "5"
               MOVE  24    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療・自院処方分・数量不明）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "6"
               MOVE  24    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療・他院処方分・数量不明）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "7"
               MOVE  25    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療外・自院処方分・数量不明）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
              WHEN     "8"
               MOVE  25    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【持参薬】（入院契機治療外・他院処方分・数量不明）"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
             END-EVALUATE
           ELSE
               MOVE   6    TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
               MOVE "【包括診療】"
                           TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
           END-IF
      *
           MOVE  "1"            TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
      *
           IF    (RECE84-FLG-CTMRI-COMMENT   =   SPACE)
           AND   (RECE84-SENTAKUBUIFLG   NOT =   SPACE)
            PERFORM  VARYING  IDX50  FROM  1  BY  1
                      UNTIL  (IDX50 >    9                )
                       OR    (IDX50 > RECE84-SENTAKUBUICNT)
             ADD   1            TO  IDX-RECE85
             MOVE  "810000001"  TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
             MOVE  ZERO         TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
             MOVE  ZERO         TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
             MOVE  SPACE        TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
             MOVE  "1"          TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
             MOVE  "1"          TO  WRK-RECE85XX-RECEDENFLG
                                                     (IDX-RECE85 1)
             MOVE  "1"          TO  WRK-RECE85XX-RECEPTFLG(IDX-RECE85 1)
            END-PERFORM
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-HOKATU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索
      *****************************************************************
       20011-CYOJKSN-KAISHIDAY-SEC          SECTION.
      *
           MOVE   SPACE   TO  WRK-CYOJKSN-YMD-XXX
                              WRK-CYOJKSN-COM-XXX
                              WRK-CYOJKSN-COM2-XXX
           MOVE   SPACE   TO  WRK-CYOJKSN-YMD-YYY
                              WRK-CYOJKSN-COM-YYY
                              WRK-CYOJKSN-COM2-YYY
      *
           IF     RECE82-CYOJKSNFLG   =   "X" OR "Z"
      *
             MOVE     "key21"     TO   WRK-SRYACCT-PATHNAME
             MOVE      1          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY4-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-XXX(1)
                                  TO   WRK-CYOJKSN-YMD-XXX
             ELSE
               IF  WRK-CYOJKSN-KAISHIDAY-XXX(2)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-XXX(2)
                                  TO   WRK-CYOJKSN-YMD-XXX
               END-IF
             END-IF
      *
      ****   IF     FLG-CHECK-MAE  =  1
      ****       MOVE   SPACE   TO  WRK-CYOJKSN-YMD-XXX
      ****   END-IF
      *
      *      算定開始日コメントがあるか検索
      *
             MOVE     "key22"     TO   WRK-SRYACCT-PATHNAME
             MOVE      2          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY4-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)  NOT = SPACE
             AND   WRK-CYOJKSN-KAISHIDAY-XXX(2)  NOT = SPACE
               IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)(1:6) =
                           WRK-CYOJKSN-KAISHIDAY-XXX(2)(1:6)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(1)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(1)
                                  TO   WRK-CYOJKSN-COM2-XXX
               ELSE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(2)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(2)
                                  TO   WRK-CYOJKSN-COM2-XXX
               END-IF
             ELSE
               IF    WRK-CYOJKSN-KAISHIDAY-XXX(1)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(1)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(1)
                                  TO   WRK-CYOJKSN-COM2-XXX
               ELSE
                 IF  WRK-CYOJKSN-KAISHIDAY-XXX(2)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-XXX(2)
                                  TO   WRK-CYOJKSN-COM-XXX
                   MOVE  WRK-CYOJKSN-NAME-XXX(2)
                                  TO   WRK-CYOJKSN-COM2-XXX
                 END-IF
               END-IF
             END-IF
      *
           END-IF
      *
           IF     RECE82-CYOJKSNFLG   =   "Y" OR "Z"
      *
             MOVE     "key21"     TO   WRK-SRYACCT-PATHNAME
             MOVE      1          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY5-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-YYY(1)
                                  TO   WRK-CYOJKSN-YMD-YYY
             ELSE
               IF  WRK-CYOJKSN-KAISHIDAY-YYY(2)  NOT = SPACE
                 MOVE  WRK-CYOJKSN-KAISHIDAY-YYY(2)
                                  TO   WRK-CYOJKSN-YMD-YYY
               END-IF
             END-IF
      *
      ****   IF     FLG-CHECK-MAE  =  1
      ****       MOVE   SPACE   TO  WRK-CYOJKSN-YMD-YYY
      ****   END-IF
      *
      *      算定開始日コメントがあるか検索
      *
             MOVE     "key22"     TO   WRK-SRYACCT-PATHNAME
             MOVE      2          TO   FLG-CYOJKSN
             PERFORM  200111-CYOJKSN-KAISHIDAY5-SEC
      *
             IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)  NOT = SPACE
             AND   WRK-CYOJKSN-KAISHIDAY-YYY(2)  NOT = SPACE
               IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)(1:6) =
                           WRK-CYOJKSN-KAISHIDAY-YYY(2)(1:6)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(1)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(1)
                                  TO   WRK-CYOJKSN-COM2-YYY
               ELSE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(2)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(2)
                                  TO   WRK-CYOJKSN-COM2-YYY
               END-IF
             ELSE
               IF    WRK-CYOJKSN-KAISHIDAY-YYY(1)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(1)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(1)
                                  TO   WRK-CYOJKSN-COM2-YYY
               ELSE
                 IF  WRK-CYOJKSN-KAISHIDAY-YYY(2)  NOT = SPACE
                   MOVE  WRK-CYOJKSN-INPUTCOMENT-YYY(2)
                                  TO   WRK-CYOJKSN-COM-YYY
                   MOVE  WRK-CYOJKSN-NAME-YYY(2)
                                  TO   WRK-CYOJKSN-COM2-YYY
                 END-IF
               END-IF
             END-IF
      *
           END-IF
      *
           .
       20011-CYOJKSN-KAISHIDAY-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索２
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY2-SEC          SECTION.
      *
           INITIALIZE                   SRYACCT-REC
           MOVE    SRY-HOSPNUM      TO  ACCT-HOSPNUM
           MOVE    SRY-NYUGAIKBN    TO  ACCT-NYUGAIKBN
           MOVE    SRY-PTID         TO  ACCT-PTID
           MOVE    SRY-SRYKA        TO  ACCT-SRYKA
           MOVE    SRY-SRYYM        TO  ACCT-SRYYM
           MOVE    SRY-ZAINUM       TO  ACCT-ZAINUM
           MOVE    SRYACCT-REC      TO  MCPDATA-REC
           MOVE    "tbl_sryacct"    TO  MCP-TABLE
           MOVE    "key31"          TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC           =   ZERO
              MOVE "tbl_sryacct"    TO  MCP-TABLE
              MOVE "key31"          TO  MCP-PATHNAME
              PERFORM 900-DBFETCH-SEC
              IF      MCP-RC        =   ZERO
                MOVE  MCPDATA-REC   TO  SRYACCT-REC
                IF (WRK-CYOJKSN-TAIHIYM = SPACE     )
                OR (WRK-CYOJKSN-TAIHIYM = ACCT-SRYYM)
                 IF  ( ACCT-SRYYM   >  RECE82-SRYYM )
                 OR  ((FLG-CYOJKSN  =   2      ) AND
                      (ACCT-SRYYM   <  "201404")    )
                  CONTINUE
                 ELSE
                  MOVE    RECE82-NYUINYMD(7:2) TO  IDX28
                  PERFORM  VARYING  IDX26  FROM  1  BY  1
                            UNTIL   IDX26   >   31
                    IF   ACCT-DAY(1 IDX26)  NOT =  ZERO
                      IF  (ACCT-SRYYM = RECE82-NYUINYMD(1:6))
                      AND (IDX26      <  IDX28              )
                          MOVE   1           TO  FLG-CHECK-MAE
                      ELSE
                        EVALUATE  FLG-CYOJKSN
                          WHEN       1
                            IF   WRK-CYOJKSN-TAIHIYM = SPACE
                              MOVE  ACCT-SRYYM  TO  WRK-CYOJKSN-TAIHIYM
                              MOVE  IDX26       TO  WRK-CYOJKSN-TAIHIDD
                              MOVE  31          TO  IDX26
                            ELSE
                              IF   IDX26  <  WRK-CYOJKSN-TAIHIDD
                                MOVE   IDX26    TO  WRK-CYOJKSN-TAIHIDD
                                MOVE   31       TO  IDX26
                              END-IF
                            END-IF
                          WHEN       2
                            IF   WRK-CYOJKSN-TAIHIYM = SPACE
                               MOVE ZERO   TO FLG-CYOJKSNCOMARI
                               MOVE SPACE  TO WRK-CYOJKSN-INPUTCOMENT
                               MOVE SPACE  TO WRK-CYOJKSN-NAME
                               PERFORM 200111-CYOJKSN-KAISHIDAY3-SEC
                               IF   FLG-CYOJKSNCOMARI  =  1
                                 MOVE  WRK-CYOJKSN-INPUTCOMENT
                                           TO WRK-CYOJKSN-INPUTCOMENT2
                                 MOVE  WRK-CYOJKSN-NAME
                                           TO WRK-CYOJKSN-NAME2
      *
                                 MOVE ACCT-SRYYM TO WRK-CYOJKSN-TAIHIYM
                                 MOVE IDX26      TO WRK-CYOJKSN-TAIHIDD
                               END-IF
                               MOVE   31         TO IDX26
                            ELSE
                             IF   IDX26  <  WRK-CYOJKSN-TAIHIDD
                               MOVE ZERO   TO FLG-CYOJKSNCOMARI
                               MOVE SPACE  TO WRK-CYOJKSN-INPUTCOMENT
                               MOVE SPACE  TO WRK-CYOJKSN-NAME
                               PERFORM 200111-CYOJKSN-KAISHIDAY3-SEC
                               IF   FLG-CYOJKSNCOMARI  =  1
                                 MOVE  WRK-CYOJKSN-INPUTCOMENT
                                           TO WRK-CYOJKSN-INPUTCOMENT2
                                 MOVE  WRK-CYOJKSN-NAME
                                           TO WRK-CYOJKSN-NAME2
      *
                                 MOVE IDX26      TO WRK-CYOJKSN-TAIHIDD
                               END-IF
                               MOVE   31         TO IDX26
                             END-IF
                            END-IF
                        END-EVALUATE
                      END-IF
                    END-IF
                  END-PERFORM
                 END-IF
                ELSE
                  MOVE    1         TO  FLG-CYOJKSN-OK
                END-IF
              END-IF
           END-IF
           MOVE    "tbl_sryacct"    TO  MCP-TABLE
           MOVE    "key31"          TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       200111-CYOJKSN-KAISHIDAY2-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索３
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY3-SEC          SECTION.
      *
           INITIALIZE                         SRYACT-REC
           MOVE    ACCT-HOSPNUM           TO  SRY-HOSPNUM
           MOVE    ACCT-NYUGAIKBN         TO  SRY-NYUGAIKBN
           MOVE    ACCT-PTID              TO  SRY-PTID
           MOVE    ACCT-SRYKA             TO  SRY-SRYKA
           MOVE    ACCT-SRYYM             TO  SRY-SRYYM
           MOVE    ACCT-ZAINUM            TO  SRY-ZAINUM
           MOVE    SRYACT-REC             TO  MCPDATA-REC
           MOVE    "tbl_sryact"           TO  MCP-TABLE
           MOVE    "key2"                 TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC                 =   ZERO
              MOVE    "tbl_sryact"        TO  MCP-TABLE
              MOVE    "key2"              TO  MCP-PATHNAME
              PERFORM  900-SRYACT-READ-SEC
              PERFORM  UNTIL  (FLG-SRYACT        =  1)
                        OR    (FLG-CYOJKSNCOMARI =  1)
                PERFORM  VARYING  IDX12  FROM  1  BY  1
                          UNTIL  (IDX12             >    5   )
                           OR    (SRY-SRYCD(IDX12)  =   SPACE)
                           OR    (FLG-CYOJKSNCOMARI =    1   )
                   IF  SRY-SRYCD(IDX12)  =  "840000056" OR "840000556"
                                        OR  "850100020" OR "850100021"
                      MOVE    1    TO   FLG-CYOJKSNCOMARI
                      IF   SRY-INPUTNUM(IDX12)  NOT =  ZERO
                        INITIALIZE                    PTCOM-REC
                        MOVE  SRY-HOSPNUM         TO  PTCOM-HOSPNUM
                        MOVE  SRY-PTID            TO  PTCOM-PTID
                        MOVE  SRY-ZAINUM          TO  PTCOM-ZAINUM
                        MOVE  SRY-SRYCD(IDX12)    TO  PTCOM-SRYCD
                        MOVE  SRY-INPUTNUM(IDX12) TO  PTCOM-RENNUM
                        PERFORM 900-PTCOM-READ-SEC
                        IF    RECE82-SRYYM  >=  "202008"
                          IF  PTCOM-INPUTCHI1  NOT =  SPACE
                            INITIALIZE              ORCSKANACHKAREA
                            MOVE    "2"             TO  KANACHK-SYORI 
                            STRING  PTCOM-INPUTCHI1 DELIMITED  BY  SPACE
                                    PTCOM-INPUTCHI2 DELIMITED  BY  SPACE
                                    PTCOM-INPUTCHI3 DELIMITED  BY  SPACE
                                    PTCOM-INPUTCHI4 DELIMITED  BY  SPACE
                                    INTO   KANACHK-MAE-INPUT
                            END-STRING
                            CALL    "ORCSKANACHK"   USING
                                                        ORCSKANACHKAREA
                            IF      KANACHK-RC  =  ZERO
                              EVALUATE  SRY-SRYCD(IDX12)
                                WHEN    "840000056"
                                WHEN    "840000556"
                                  IF  SRY-SRYCD(IDX12) = "840000056"
                                    MOVE "４"
                                       TO WRK-CYOJKSN-INPUTCOMENT(1:2)
                                  ELSE
                                    MOVE "５"
                                       TO WRK-CYOJKSN-INPUTCOMENT(1:2)
                                  END-IF
                                  MOVE KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                       TO WRK-CYOJKSN-INPUTCOMENT(3:)
                                  MOVE PTCOM-INPUTCOMENT(11:)
                                       TO WRK-CYOJKSN-NAME
                                WHEN    "850100020"
                                  MOVE KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                       TO WRK-CYOJKSN-INPUTCOMENT
                                  MOVE PTCOM-INPUTCOMENT(47:)
                                       TO WRK-CYOJKSN-NAME
                                WHEN    "850100021"
                                  MOVE KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                       TO WRK-CYOJKSN-INPUTCOMENT
                                  MOVE PTCOM-INPUTCOMENT(49:)
                                       TO WRK-CYOJKSN-NAME
                              END-EVALUATE
                            END-IF
                          ELSE
                            MOVE SPACE TO WRK-CYOJKSN-INPUTCOMENT
                            MOVE SPACE TO WRK-CYOJKSN-NAME
                          END-IF
                        ELSE
                            MOVE PTCOM-INPUTCOMENT
                                       TO WRK-CYOJKSN-INPUTCOMENT
                        END-IF
                      END-IF
                   END-IF
                END-PERFORM
                MOVE    "tbl_sryact"      TO  MCP-TABLE
                MOVE    "key2"            TO  MCP-PATHNAME
                PERFORM   900-SRYACT-READ-SEC
              END-PERFORM
           END-IF
           MOVE    "tbl_sryact"           TO  MCP-TABLE
           MOVE    "key2"                 TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       200111-CYOJKSN-KAISHIDAY3-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索４
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY4-SEC          SECTION.
      *
           INITIALIZE         WRK-CYOJKSN-KAISHIDAY-XXX-AREA
      *
           MOVE      ZERO                 TO  FLG-CHECK-MAE
      *
           PERFORM  VARYING  IDX30  FROM  1  BY  1
                     UNTIL   IDX30   >   TBL-CYOJKSN-CHECK-XXX-MAX
      *
             MOVE    ZERO                 TO  FLG-CYOJKSN-OK
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIYM
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIDD
             MOVE    SPACE                TO  WRK-CYOJKSN-INPUTCOMENT2
             MOVE    SPACE                TO  WRK-CYOJKSN-NAME2
      *
             INITIALIZE                       SRYACT-REC
             MOVE    RECE82-HOSPNUM       TO  SRY-HOSPNUM
             MOVE    RECE82-NYUGAIKBN     TO  SRY-NYUGAIKBN
             MOVE    RECE82-PTID          TO  SRY-PTID
             MOVE    RECE82-NYUINYMD(1:6) TO  SRY-SRYYM
             MOVE    TBL-CYOJKSN-CHECK-XXX(IDX30)
                                          TO  SRY-SRYCD (1)
                                              SRY-SRYCD (2)
                                              SRY-SRYCD (3)
                                              SRY-SRYCD (4)
                                              SRY-SRYCD (5)
             MOVE    SRYACT-REC           TO  MCPDATA-REC
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC               =   ZERO
               MOVE    "tbl_sryact"       TO  MCP-TABLE
               MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT      =   1
                         OR     FLG-CYOJKSN-OK  =   1
      *
                 PERFORM  200111-CYOJKSN-KAISHIDAY2-SEC
      *
                 MOVE    "tbl_sryact"     TO  MCP-TABLE
                 MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
             IF   WRK-CYOJKSN-TAIHIYM  NOT = SPACE
             AND  WRK-CYOJKSN-TAIHIDD  NOT = SPACE
               MOVE  WRK-CYOJKSN-TAIHIYM
                           TO WRK-CYOJKSN-KAISHIDAY-XXX(IDX30)(1:6)
               MOVE  WRK-CYOJKSN-TAIHIDD
                           TO WRK-CYOJKSN-KAISHIDAY-XXX(IDX30)(7:2)
               MOVE  WRK-CYOJKSN-INPUTCOMENT2
                           TO WRK-CYOJKSN-INPUTCOMENT-XXX(IDX30)
               MOVE  WRK-CYOJKSN-NAME2
                           TO WRK-CYOJKSN-NAME-XXX(IDX30)
             END-IF
      *
           END-PERFORM
      *
           .
       200111-CYOJKSN-KAISHIDAY4-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日検索５
      *****************************************************************
       200111-CYOJKSN-KAISHIDAY5-SEC          SECTION.
      *
           INITIALIZE         WRK-CYOJKSN-KAISHIDAY-YYY-AREA
      *
           MOVE      ZERO                 TO  FLG-CHECK-MAE
      *
           PERFORM  VARYING  IDX30  FROM  1  BY  1
                     UNTIL   IDX30   >   TBL-CYOJKSN-CHECK-YYY-MAX
      *
             MOVE    ZERO                 TO  FLG-CYOJKSN-OK
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIYM
             MOVE    SPACE                TO  WRK-CYOJKSN-TAIHIDD
             MOVE    SPACE                TO  WRK-CYOJKSN-INPUTCOMENT2
             MOVE    SPACE                TO  WRK-CYOJKSN-NAME2
      *
             INITIALIZE                       SRYACT-REC
             MOVE    RECE82-HOSPNUM       TO  SRY-HOSPNUM
             MOVE    RECE82-NYUGAIKBN     TO  SRY-NYUGAIKBN
             MOVE    RECE82-PTID          TO  SRY-PTID
             MOVE    RECE82-NYUINYMD(1:6) TO  SRY-SRYYM
             MOVE    TBL-CYOJKSN-CHECK-YYY(IDX30)
                                          TO  SRY-SRYCD (1)
                                              SRY-SRYCD (2)
                                              SRY-SRYCD (3)
                                              SRY-SRYCD (4)
                                              SRY-SRYCD (5)
             MOVE    SRYACT-REC           TO  MCPDATA-REC
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM 900-DBSELECT-SEC
             IF      MCP-RC               =   ZERO
               MOVE    "tbl_sryact"       TO  MCP-TABLE
               MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
               PERFORM  900-SRYACT-READ-SEC
               PERFORM  UNTIL   FLG-SRYACT      =   1
                         OR     FLG-CYOJKSN-OK  =   1
      *
                 PERFORM  200111-CYOJKSN-KAISHIDAY2-SEC
      *
                 MOVE    "tbl_sryact"     TO  MCP-TABLE
                 MOVE    WRK-SRYACCT-PATHNAME
                                          TO  MCP-PATHNAME
                 PERFORM   900-SRYACT-READ-SEC
               END-PERFORM
             END-IF
             MOVE    "tbl_sryact"         TO  MCP-TABLE
             MOVE    WRK-SRYACCT-PATHNAME TO  MCP-PATHNAME
             PERFORM   900-CLOSE-SEC
      *
             IF   WRK-CYOJKSN-TAIHIYM  NOT = SPACE
             AND  WRK-CYOJKSN-TAIHIDD  NOT = SPACE
               MOVE  WRK-CYOJKSN-TAIHIYM
                           TO WRK-CYOJKSN-KAISHIDAY-YYY(IDX30)(1:6)
               MOVE  WRK-CYOJKSN-TAIHIDD
                           TO WRK-CYOJKSN-KAISHIDAY-YYY(IDX30)(7:2)
               MOVE  WRK-CYOJKSN-INPUTCOMENT2
                           TO WRK-CYOJKSN-INPUTCOMENT-YYY(IDX30)
               MOVE  WRK-CYOJKSN-NAME2
                           TO WRK-CYOJKSN-NAME-YYY(IDX30)
             END-IF
      *
           END-PERFORM
      *
           .
       200111-CYOJKSN-KAISHIDAY5-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定日の確定
      *****************************************************************
       200111-SANTEI-DAY-SEC          SECTION.
      *
           INITIALIZE                TBL-SANTEI-DAY
      *
           MOVE    ZERO          TO  DAY-IDX
           PERFORM    VARYING    IDX  FROM   1   BY   1
                      UNTIL     (IDX      >   31)  OR
                                (DAY-IDX  >   31)
               IF    RECE84-KAISU(1 IDX)  NOT =  ZERO
                   ADD   1     TO   DAY-IDX
                   MOVE  IDX   TO  TB-SANTEI-DAY(DAY-IDX)
               END-IF
           END-PERFORM
           .
       200111-SANTEI-DAY-EXT.
           EXIT.
      *
      *****************************************************************
      *    日付の編集
      *****************************************************************
       20011-FREE-COMMENT2-SEC          SECTION.                         
      *
           ADD      1          TO    IDZ
      *
           EVALUATE   FLG-COMMENT
              WHEN    1
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "手術"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    2
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "実施"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    3
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "算定"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    4
                 IF   RECE82-SRYYM >= "201905"
                   MOVE     22         TO    WRK-KETA
                                             WRK-KETA-TAIHI
                   MOVE     11         TO    WRK-KETA2
                   MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                   MOVE    "交付　　　　　年　　月"
                                 TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
                   MOVE     11         TO     IDX41
                   MOVE     17         TO     IDX42
                   MOVE      7         TO     IDX49
                 ELSE
                   MOVE     18         TO    WRK-KETA
                                             WRK-KETA-TAIHI
                   MOVE     9          TO    WRK-KETA2
                   MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                   MOVE    "交付　　　年　　月"
                                 TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
                   MOVE      7         TO     IDX41
                   MOVE     13         TO     IDX42
                 END-IF
      *
                 INITIALIZE                      STS-AREA-DAY
                 INITIALIZE                      LNK-DAY2-AREA
                 MOVE    "21"                TO  LNK-DAY2-IRAI
                 MOVE    RECE82-SRYYM        TO  WRK-HENYMD(1:6)
                 MOVE    "01"                TO  WRK-HENYMD(7:2)
                 MOVE    WRK-HENYMD          TO  LNK-DAY2-YMD
                 CALL    "ORCSDAY"   USING   STS-AREA-DAY
                                             LNK-DAY2-AREA
                 IF  STS-DAY-RC1             =   ZERO
                   MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX41:4)
                   END-IF
      *
                   MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                   INITIALIZE                       ORCSKANACHKAREA
                   MOVE    "2"                  TO  KANACHK-SYORI
                   MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                   CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                   IF      KANACHK-RC      =   ZERO
                      MOVE    KANACHK-OUT-INPUT(1:4)
                                   TO  WK-FREE-NAME2(IDZ)(IDX42:4)
                   END-IF
      *
                   IF   RECE82-SRYYM >= "201905"
                      MOVE    LNK-DAY2-EDTYMD2-G
                                   TO  WK-FREE-NAME2(IDZ)(IDX49:4)
                   END-IF
                 END-IF
              WHEN    6
                 MOVE     0          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     0          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
              WHEN    7
                 MOVE     8          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     4          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "検査実施"
                             TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    8
                 MOVE     4          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     2          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "麻酔"  TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
              WHEN    10
                 MOVE     6          TO    WRK-KETA
                                           WRK-KETA-TAIHI
                 MOVE     3          TO    WRK-KETA2
                 MOVE    WRK-KETA2   TO    WK-FREE-YUKOKETA2(IDZ)
                 MOVE    "指導日"
                                 TO    WK-FREE-NAME2(IDZ)(1:WRK-KETA)
           END-EVALUATE
      *
           PERFORM  200111-JIDOSET-HENSYU-SEC
      *
           MOVE      ZERO          TO  FLG-FIRST
      *
           PERFORM   VARYING   IDX    FROM   1   BY   1
                          UNTIL   (IDX                 >    31)
                           OR     (TB-SANTEI-DAY(IDX)  =  ZERO)
      *
                 IF  FLG-FIRST  =  ZERO
                    IF  TB-SANTEI-DAY(IDX)     <  10 
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                       MOVE    "　"
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                       MOVE    TBL-DAY(IDY)(3:2)     
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                       MOVE    "日"
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                    ELSE
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       IF   FLG-COMMENT   =   4 OR 6
                         ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                         COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                         MOVE    TBL-DAY(IDY)     
                             TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
                       ELSE
                         ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                         COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                         MOVE    "　"
                             TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                         ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                         COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                         MOVE    TBL-DAY(IDY)     
                             TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
                       END-IF
                       ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                       COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                       MOVE    "日"
                           TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                    END-IF
                    MOVE      1              TO  FLG-FIRST
                 ELSE
                    IF  TB-SANTEI-DAY(IDX)     <  10 
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    "、"
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       ELSE
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "、"
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                       END-IF
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  24 OR 25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    TBL-DAY(IDY)(3:2)     
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2) 
                       ELSE
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    TBL-DAY(IDY)(3:2)     
                                    TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2) 
                       END-IF
                    ELSE
      *
                       MOVE   TB-SANTEI-DAY(IDX)  TO  IDY
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    "、"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       ELSE
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    "、"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       END-IF
      *
                       IF    WK-FREE-YUKOKETA2(IDZ)  =  23 OR 24 OR 25
                          PERFORM  200111-FREE-COMMENT2-KAIGYO-SEC
                          ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  1
                          MOVE    TBL-DAY(IDY)     
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       ELSE
                          ADD   2  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                          MOVE    TBL-DAY(IDY)     
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:4)
      *
                          ADD   1  TO  WK-FREE-YUKOKETA2(IDZ)
                          COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                          MOVE    "日"
                                   TO  WK-FREE-NAME2(IDZ)(WRK-KETA:2)
                       END-IF
                    END-IF
                 END-IF
      *
           END-PERFORM
           .
       20011-FREE-COMMENT2-EXT.
           EXIT.
      *
      *****************************************************************
      *    日付の編集（改行）
      *****************************************************************
       200111-FREE-COMMENT2-KAIGYO-SEC          SECTION.                  
      *
           ADD      1              TO  IDZ
      *
           MOVE    WRK-KETA-TAIHI  TO  WRK-KETA
           MOVE    WRK-KETA2       TO  WK-FREE-YUKOKETA2(IDZ)
           MOVE    ALL "　"        TO  WK-FREE-NAME2(IDZ)(1:WRK-KETA)
      *
           PERFORM  200111-JIDOSET-HENSYU-SEC
      *
           .
       200111-FREE-COMMENT2-KAIGYO-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリのコメント編集
      *****************************************************************
       2001-RIHA-COMMENT-SEC          SECTION.
      *
             INITIALIZE            WRK-JIDO-SETCOM-AREA
             MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
             MOVE       1       TO     WRK-JIDO-SETCOMATFLG
      *
             PERFORM   200111-RECE85-TAIHI-SEC
      *
      *      ＲＥＣＥ０５ファイルの内容をテーブルに退避
             MOVE    ZERO                 TO  IDX-RECE85
             MOVE    SPACE                TO  WRK-RECE85XX-REC
             INITIALIZE                       WRK-RECE85XX-REC
      *      リハビリコメントの挿入
             COMPUTE  MAX-MEISAISU        =   RECE84-MEISAISU  +  1
      *
             MOVE    "810000001"
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
             MOVE    ZERO   TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
             MOVE    7      TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE    "実施日数　　日"
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
             MOVE    "1"    TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
             MOVE    ZERO                 TO  CNT-RIHA
             PERFORM  VARYING   IDX  FROM  1  BY  1
                       UNTIL    IDX   >   31
                 IF   RECE84-KAISU(1 IDX)  NOT = ZERO
                        ADD      1        TO  CNT-RIHA
                 END-IF
             END-PERFORM
             IF      CNT-RIHA             NOT =    ZERO
               MOVE    CNT-RIHA             TO  DAY-IDX
               MOVE    TBL-DAY(DAY-IDX)
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(9:4)
             END-IF
      *
             IF    WRK-JIDO-SETCOMATFLG  NOT = ZERO
               MOVE  "2"   TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
               MOVE  WRK-JIDO-SETCOMATFLG
                           TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
               MOVE  WRK-JIDO-RECEDENFLG
                           TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
             END-IF
      *
             PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       2001-RIHA-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ医学管理料のコメント編集
      *****************************************************************
       2001-RIHAIGAKU-COMMENT-SEC          SECTION.
      *
           INITIALIZE            WRK-JIDO-SETCOM-AREA
      *
           EVALUATE      RECE84-RIHABIRI-COMMENT
              WHEN           "2"
                  MOVE   CONS-SINDAI-IGAKU1   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-SINDAI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "3"
                  MOVE   CONS-SINDAI-IGAKU2   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-SINDAI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "4"
                  MOVE   CONS-KOKYUKI-IGAKU1  TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-KOKYUKI-DUMMY   TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "5"
                  MOVE   CONS-KOKYUKI-IGAKU2  TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-KOKYUKI-DUMMY   TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "6"
                  MOVE   CONS-NOUKE-IGAKU1    TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-NOUKE-DUMMY     TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "7"
                  MOVE   CONS-NOUKE-IGAKU2    TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-NOUKE-DUMMY     TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "8"
                  MOVE   CONS-UNDOKI-IGAKU1   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-UNDOKI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
              WHEN           "9"
                  MOVE   CONS-UNDOKI-IGAKU2   TO  WRK-RIHAIGAKU-SRYCD
                  MOVE   CONS-UNDOKI-DUMMY    TO  WRK-RIHAIGAKU-SRYCD2
           END-EVALUATE
      ***
           MOVE          SPACE          TO  WRK-RIHAIGAKU-FSANTEIYMD
      *    医学管理：算定履歴検索
           INITIALIZE                       SANTEI-REC
           MOVE    RECE82-HOSPNUM       TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID          TO  SANTEI-PTID
           MOVE    RECE82-SRYYM         TO  SANTEI-SRYYM
           MOVE    WRK-RIHAIGAKU-SRYCD  TO  SANTEI-SRYCD
           MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                 TO  SANTEI-SRYKA
           MOVE    RECE82-HKNCOMBI      TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC           TO  MCPDATA-REC
           MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
           MOVE    "key"                TO  WRK-MCP-PATHNAME
           PERFORM  900-SANTEI-INV-SEC
           IF       FLG-SANTEI        =   ZERO
                MOVE  SANTEI-FSANTEIYMD TO  WRK-RIHAIGAKU-FSANTEIYMD
           END-IF
      ***
           INITIALIZE      WRK-RIHAIGAKU-SANTEI-AREA
      *    リハ実施ダミー：算定履歴検索
           INITIALIZE                       SANTEI-REC
           MOVE    RECE82-HOSPNUM       TO  SANTEI-HOSPNUM
           MOVE    RECE82-PTID          TO  SANTEI-PTID
           MOVE    RECE82-SRYYM         TO  SANTEI-SRYYM
           MOVE    WRK-RIHAIGAKU-SRYCD2 TO  SANTEI-SRYCD
           MOVE    ZERO                 TO  SANTEI-NYUGAIKBN
           MOVE    ZERO                 TO  SANTEI-SRYKA
           MOVE    RECE82-HKNCOMBI      TO  SANTEI-HKNCOMBINUM
           MOVE    SANTEI-REC           TO  MCPDATA-REC
           MOVE    "tbl_santei"         TO  WRK-MCP-TABLE
           MOVE    "key"                TO  WRK-MCP-PATHNAME
           PERFORM  900-SANTEI-INV-SEC
           IF       FLG-SANTEI        =   ZERO
               PERFORM  VARYING  IDX  FROM  1  BY  1
                         UNTIL   IDX    >  31
                 IF   SANTEI-DAY(IDX)   NOT =  ZERO
                    MOVE  "1"  TO  WRK-RIHAIGAKU-SANTEI-FLG
                    MOVE  SANTEI-DAY(IDX)
                               TO  WRK-RIHAIGAKU-SANTEI-DAY(IDX)
                 END-IF
               END-PERFORM
           END-IF
      *
      ***
      *
           PERFORM  200111-RECE85-TAIHI-SEC
      *
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           COMPUTE  MAX-MEISAISU        =   RECE84-MEISAISU  +  1
      *
           MOVE    "810000001"
                         TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
           MOVE    9     TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
           MOVE    "開始　　　月　　日"
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           MOVE    "1"   TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           IF      WRK-RIHAIGAKU-FSANTEIYMD  NOT = SPACE
             MOVE    WRK-RIHAIGAKU-FSANTEIYMD(5:2)   TO  DAY-IDX2
             MOVE    TBL-DAY(DAY-IDX2)
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(7:4)
             MOVE    WRK-RIHAIGAKU-FSANTEIYMD(7:2)   TO  DAY-IDX2
             MOVE    TBL-DAY(DAY-IDX2)
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(13:4)
           END-IF
      *
           IF      WRK-RIHAIGAKU-SANTEI-FLG  NOT = SPACE
             PERFORM    20011-RIHAIGAKU-DUMMY-COM-SEC
           ELSE
             PERFORM    200111-SRYACTINF-HENSYU-SEC
           END-IF
      *
           .
       2001-RIHAIGAKU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    リハビリ医学管理料のコメント編集（リハ実施日）
      *****************************************************************
       20011-RIHAIGAKU-DUMMY-COM-SEC          SECTION.
      *
           INITIALIZE             TBL-SANTEI-DAY
      *
           MOVE     ZERO      TO   DAY-IDX
           PERFORM  VARYING  IDX  FROM   1   BY   1
                     UNTIL   IDX    >   31
             IF  WRK-RIHAIGAKU-SANTEI-DAY(IDX)  NOT = ZERO
                 ADD    1     TO   DAY-IDX
                 MOVE   IDX   TO   TB-SANTEI-DAY(DAY-IDX)
             END-IF
           END-PERFORM
      *
           MOVE     ZERO      TO   IDZ
           INITIALIZE         WRK-FREE-AREA2
      *
           MOVE     2         TO   FLG-COMMENT
           PERFORM  20011-FREE-COMMENT2-SEC
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
                MOVE   "810000001"
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                MOVE   ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                MOVE    "1"  TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       20011-RIHAIGAKU-DUMMY-COM-EXT.
           EXIT.
      *
      *****************************************************************
      *    （リハ選）のコメントがあるか判定
      *****************************************************************
       2001-RIHASEN-HANTEI-SEC          SECTION.
      *
           IF     RECE84-SAFLG   =    "2"
               MOVE       99      TO     FLG-COMMENT
               PERFORM    20011-KENSENTOU-COMMENT-SEC
           END-IF
      *
           .
       2001-RIHASEN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科ショート・ケア・精神科デイ・ケアがあるか判定
      *  ＃202004選択式コメント対応
      *  ＃202011選択式コメント対応
      *****************************************************************
       2001-SEIKEA-HANTEI-SEC          SECTION.
      *
           IF    ((RECE84-FLG-SEIKEA-COMMENT   =    "1") OR
                  (RECE84-FLG-SEIKEA2-COMMENT  =    "1"))
           AND   ( RECE84-FLG-SCPRO-COMMENT    =  SPACE )
             IF    RECE82-SRYYM  >=  "202011"
               MOVE      ZERO       TO     IDZ
               INITIALIZE                  WRK-FREE-AREA2
               IF   RECE84-FLG-SEIKEA2-COMMENT  =    "1"
                 PERFORM   2001-SEIKEA-HENSYU-SEC
               END-IF
               IF   RECE84-FLG-SEIKEA-COMMENT   =    "1"
                 INITIALIZE            WRK-JIDO-SETCOM-AREA
                 MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                 IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
                 OR  WK-FREE-NAME2(1)   NOT =  SPACE
                   MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                 END-IF
                 MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                 IF   RECE82-SRYYM  >= "202004"
                   MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
                 END-IF
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM   200111-SANTEI-DAY-SEC
                 PERFORM   20011-FREE-COMMENT2-SEC
               END-IF
               IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
               OR  WK-FREE-NAME2(1)   NOT =  SPACE
                 PERFORM   200111-SRYACTINF-HENSYU-MAT-SEC
               END-IF
             ELSE
               INITIALIZE            WRK-JIDO-SETCOM-AREA
               MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
               MOVE       1       TO     WRK-JIDO-SETCOMATFLG
               IF   RECE82-SRYYM  >= "202004"
                 MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
               END-IF
               MOVE       3       TO     FLG-COMMENT
               PERFORM    20011-SHUJUTSU-ETC2-COMMENT-SEC
             END-IF
           END-IF
      *
           .
       2001-SEIKEA-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科ショート・ケア・精神科デイ・ケア（初回年月日編集）
      *  ＃202011選択式コメント対応
      *****************************************************************
       2001-SEIKEA-HENSYU-SEC          SECTION.
      *
           MOVE  CONS-SEIKEA  TO  WRK-CHECK-SRYCD
           PERFORM       20011-ZAIKYO-CHECK-SEC
      *
           IF   WRK-ZAIKYO-YMD   NOT =  SPACE
              INITIALIZE                WRK-JIDO-SETCOM-AREA
              MOVE      "2"      TO     WRK-JIDO-SETCOMFLG
      *
              MOVE       99      TO     FLG-COMMENT
      *
              MOVE     114       TO     IDX-JIDO
              PERFORM  200111-RECECOMMENT-IDXGET-SEC
              MOVE     WRK-ZAIKYO-YMD
                                 TO     WRK-RECECOM-YMD
              PERFORM  200111-RECECOMMENT-HENSYU-SEC
           END-IF
      *
           .
       2001-SEIKEA-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    疾患別等専門プログラム加算があるか判定
      *    経頭蓋磁気刺激療法があるか判定
      *    心不全に対する遠赤外線温熱療法があるか判定
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-SCPRO-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-SCPRO-COMMENT   NOT =  SPACE
             MOVE         ZERO     TO     IDZ
             INITIALIZE                   WRK-FREE-AREA2
      *      ＃202011選択式コメント対応
             IF     RECE82-SRYYM  <  "202004"
               IF   RECE84-FLG-SEIKEA-COMMENT  =  "1"
                 INITIALIZE                WRK-JIDO-SETCOM-AREA
                 MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                 MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                 IF   RECE82-SRYYM  >= "202004"
                   MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
                 END-IF
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM   200111-SANTEI-DAY-SEC
                 PERFORM   20011-FREE-COMMENT2-SEC
               END-IF
             ELSE
               IF     RECE82-SRYYM  >= "202011"
                 IF   RECE84-FLG-SEIKEA2-COMMENT =  "1"
                   PERFORM   2001-SEIKEA-HENSYU-SEC
                 END-IF
               END-IF
             END-IF
      *
             EVALUATE  RECE84-FLG-SCPRO-COMMENT
               WHEN      "2"
                 MOVE  CONS-SCPRO  TO     WRK-CHECK-SRYCD
               WHEN      "4"
                 MOVE  CONS-JIKSGK TO     WRK-CHECK-SRYCD
               WHEN      "5"
                 MOVE  CONS-ONNETU TO     WRK-CHECK-SRYCD
             END-EVALUATE
             PERFORM       20011-ZAIKYO-CHECK-SEC
      *
             IF   RECE84-FLG-SCPRO-COMMENT    =  "4"
             AND  WRK-ZAIKYO-YMD          NOT =  SPACE
               MOVE    CONS-JIKSGK-E TO  WRK-CHECK-SRYCD
               PERFORM     20011-ZAIKYO-CHECK2-SEC
             END-IF
      *
             IF   WRK-ZAIKYO-YMD   NOT =  SPACE
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                IF   RECE82-SRYYM  >= "202008"
                  MOVE    "2"      TO     WRK-JIDO-SETCOMFLG
                ELSE
                  EVALUATE  RECE84-FLG-SCPRO-COMMENT
                    WHEN      "2"
                      MOVE  "1"    TO     WRK-JIDO-SETCOMFLG
                      MOVE   2     TO     WRK-JIDO-SETCOMATFLG
                    WHEN      "4"
                      MOVE  "1"    TO     WRK-JIDO-SETCOMFLG
                      MOVE   1     TO     WRK-JIDO-SETCOMATFLG
                    WHEN      "5"
                      MOVE  "1"    TO     WRK-JIDO-SETCOMFLG
                      MOVE   1     TO     WRK-JIDO-SETCOMATFLG
                  END-EVALUATE
                END-IF
      *
                MOVE       99      TO     FLG-COMMENT
      *
                IF   RECE82-SRYYM  >= "202008"
                  EVALUATE  RECE84-FLG-SCPRO-COMMENT
                    WHEN      "2"
                      MOVE   65            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    WHEN      "4"
                      MOVE   67            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                    WHEN      "5"
                      MOVE   81            TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
                  END-EVALUATE
                  PERFORM  200111-JIDOSET-HENSYU-SEC
                  IF  WRK-ZAIKYO-YMD2   NOT =  SPACE
                      MOVE   567           TO  IDX-JIDO
                      PERFORM  200111-RECECOMMENT-IDXGET-SEC
                      MOVE   WRK-ZAIKYO-YMD2
                                           TO  WRK-RECECOM-YMD
                      PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                      PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-IF
                ELSE
                  ADD      1       TO     IDZ
                  MOVE     12      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE "治療開始日　　　月　　日"
                                   TO     WK-FREE-NAME2(IDZ)
                  MOVE  WRK-ZAIKYO-YMD(5:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO     WK-FREE-NAME2(IDZ)(13:4)
                  MOVE  WRK-ZAIKYO-YMD(7:2)   TO  DAY-IDX2
                  MOVE  TBL-DAY(DAY-IDX2)
                                   TO     WK-FREE-NAME2(IDZ)(19:4)
      *
                  PERFORM  200111-JIDOSET-HENSYU-SEC
      *
                  IF   WRK-ZAIKYO-YMD2   NOT =  SPACE
                    ADD      1       TO     IDZ
                    MOVE     12      TO     WK-FREE-YUKOKETA2(IDZ)
                    MOVE "治療終了日　　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                    MOVE  WRK-ZAIKYO-YMD2(5:2)  TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(13:4)
                    MOVE  WRK-ZAIKYO-YMD2(7:2)  TO  DAY-IDX2
                    MOVE  TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(19:4)
      *
                    PERFORM  200111-JIDOSET-HENSYU-SEC
                  END-IF
                END-IF
             END-IF
      *
      *      ＃202011選択式コメント対応
             IF   RECE82-SRYYM  >= "202004"
               IF   RECE84-FLG-SEIKEA-COMMENT  =  "1"
                 INITIALIZE                WRK-JIDO-SETCOM-AREA
                 MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
                 IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
                 OR  WK-FREE-NAME2(1)   NOT =  SPACE
                     MOVE  "2"      TO     WRK-JIDO-SETCOMFLG
                 END-IF
                 MOVE       1       TO     WRK-JIDO-SETCOMATFLG
                 IF   RECE82-SRYYM  >= "202004"
                   MOVE    "1"      TO     WRK-JIDO-RECEDENFLG
                 END-IF
                 MOVE       3       TO     FLG-COMMENT
                 PERFORM   200111-SANTEI-DAY-SEC
                 PERFORM   20011-FREE-COMMENT2-SEC
               END-IF
             END-IF
      *
             IF  WK-FREE-SRYCD2(1)  NOT =  SPACE
             OR  WK-FREE-NAME2(1)   NOT =  SPACE
      *
                PERFORM  200111-SRYACTINF-HENSYU-MAT-SEC
      *
             END-IF
           END-IF
      *
           .
       2001-SCPRO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    救急医療管理加算の判定
      *****************************************************************
       2001-KYUKYU-HANTEI-SEC          SECTION.
      *
           IF (( RECE82-KYUKYU-PRTKBN    =      1         ) AND
               ( RECE84-SRYCDTOTAL(6:9)  =   CONS-KYUKYU  ) AND
               ( RECE82-SRYYM           <=   "201306"     ))
      ***  OR (( RECE82-KYUKYU-PRTKBN    =      1         ) AND
      ***      ( RECE84-SRYCDTOTAL(6:9)  =   CONS-KYUKYU2 ) AND
      ***      ( RECE82-SRYYM           >=   "201307"     ))
           OR (( RECE84-JIBAISYUKEIKBN   =      4         ) AND
               ( RECE84-SRYCDTOTAL(6:5)  =   "09593"      ) AND
               ( RECE82-SRYYM           <=   "201306"     ))
               IF   RECE82-SRYYM   >=  "200604"
                 MOVE      99            TO  FLG-COMMENT
                 PERFORM   2001-KYUKYU-COMMENT200604-SEC
               END-IF
           END-IF
      *
           .
       2001-KYUKYU-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    救急医療管理加算のコメント編集
      *****************************************************************
       2001-KYUKYU-COMMENT200604-SEC          SECTION.
      *
           INITIALIZE            WRK-JIDO-SETCOM-AREA
           MOVE      "1"       TO     WRK-JIDO-SETCOMFLG
           MOVE       1        TO     WRK-JIDO-SETCOMATFLG
      *
           PERFORM     20011-NYU-DAY-SEC
      *
           PERFORM     200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                TO  IDX-RECE85
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
      *
           MOVE    RECE84-MEISAISU     TO  MAX-MEISAISU
      *
      *    算定日コメントの挿入
           PERFORM  VARYING      IDX    FROM  1   BY   1
                    UNTIL       (IDX    >     31)      OR
                                (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               MOVE   "810000001"
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
               MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
               IF    TBL-NYU-DAY-CD(IDX)  =  CONS-SANTEI-COMMENT1
                 MOVE    8   TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "算定　　月　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE    RECE82-SRYYM(5:2)    TO  DAY-IDX2
                 MOVE    TBL-DAY(DAY-IDX2)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(5:4)
                 MOVE    TBL-NYU-DAY-ST(IDX)  TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(11:4)
               ELSE
                 MOVE    12  TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "算定　　月　　日〜　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE    RECE82-SRYYM(5:2)    TO  DAY-IDX2
                 MOVE    TBL-DAY(DAY-IDX2)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(5:4)
                 MOVE    TBL-NYU-DAY-ST(IDX)  TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(11:4)
                 MOVE    TBL-NYU-DAY-ED(IDX)  TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(19:4)
               END-IF
               IF    WRK-JIDO-SETCOMATFLG  NOT = ZERO
                 MOVE  "2" TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
                 MOVE  WRK-JIDO-SETCOMATFLG
                           TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
               END-IF
               MOVE    "1"   TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       2001-KYUKYU-COMMENT200604-EXT.
           EXIT.
      *
      *****************************************************************
      *    外泊日のコメント編集
      *    精神科隔離病室管理加算（入院料加算）のコメント編集
      *****************************************************************
       2001-NYU-COMMENT-SEC          SECTION.
      *
           INITIALIZE  WRK-JIDO-SETCOM-AREA
      *
           PERFORM     20011-NYU-DAY-SEC
      *
           PERFORM     200111-RECE85-TAIHI-SEC
      *
           MOVE     ZERO    TO    FLG-NG
           IF   (RECE84-ZAISKBKBN  =  "2"                          )
           AND  (FLG-RECE85        =  ZERO                         )
           AND  (WRK-RECE85-SRYCD(1)  =  "190108890" OR "190142190"
                                      OR "190108790" OR "190142090"
                                      OR "190109090"
                                      OR "190142290" OR "190141590"
                                      OR "190153190" OR "190153390"
                                      OR "190153290" OR "190153090"
                                      OR "190182990"
                                      OR "190213790" OR "190214290"
                                      OR "190213890" OR "190214090"
                                      OR "190214390" OR "190213990"
                                      OR "190214190"
                                      OR "190200970" OR "190214470"
                                      OR "190205270" OR "190205370"
                                      OR "190205470" OR "190205870"
                                      OR "190212670" OR "190836370")
              MOVE    1     TO    FLG-NG
           END-IF
           IF   (RECE84-ZAISKBKBN  =  "2"                          )
           AND  (FLG-RECE85        =  ZERO                         )
           AND  (WRK-RECE85-SRYCD(2)  =  "190107290" OR "190107390"
                                      OR "190107490" OR "190107590")
              MOVE  ZERO    TO    FLG-NG
           END-IF
           IF   (RECE84-ZAISKBKBN  =  "2"                          )
           AND  (FLG-RECE85        =  ZERO                         )
           AND  (WRK-RECE85-SRYCD(2)  =  "190161470" OR "190161570"
                                      OR "190161870" OR "190162070"
                                      OR "190161670" OR "190161770"
                                      OR "190161970" OR "190162170"
                                      OR "190198570" OR "190198670")
              MOVE  ZERO    TO    FLG-NG
           END-IF
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *
           IF    FLG-NG  =  ZERO
      *      算定日コメントの挿入
             PERFORM  VARYING      IDX    FROM  1   BY   1
                      UNTIL       (IDX    >     31)      OR
                                  (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
      ***      MOVE    TBL-NYU-DAY-CD(IDX)
               MOVE    "810000001"
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
               MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
               IF    TBL-NYU-DAY-CD(IDX)  =  CONS-SANTEI-COMMENT1
                 MOVE    3   TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE    TBL-NYU-DAY-ST(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(1:4)
               ELSE
                 MOVE    7   TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "　　日〜　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE    TBL-NYU-DAY-ST(IDX) 
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(1:4)
                 MOVE    TBL-NYU-DAY-ED(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(9:4)
               END-IF
               IF   RECE84-ZAITEN   NOT =   ZERO
                 MOVE  "1"   TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
               END-IF
               MOVE    "1"   TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
             END-PERFORM
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           IF     RECE84-ZAISKBKBN             =    "6"
           AND    RECE84-MEISAISU              =     1
             IF (RECE84-FLG-KAKURI-COMMENT = "1"                     )
             OR (RECE84-FLG-EISAPO-COMMENT = "1" OR "2"              )
             OR (RECE84-FLG-KOKKEA-COMMENT = "1"                     )
             OR (RECE84-FLG-JYUSYO-COMMENT = "1" OR "2" OR "3" OR "4")
             OR (RECE84-FLG-SEIRIE-COMMENT = "1"                     )
             OR (RECE84-FLG-BYOYAK-COMMENT = "1" OR "2" OR "3"       )
               PERFORM    20012-NYUKASAN-HENSYU-SEC
             END-IF
           END-IF
      *
           .
       2001-NYU-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    外泊日の確定
      *    精神科隔離病室管理加算日（入院料加算）の確定
      *****************************************************************
       20011-NYU-DAY-SEC          SECTION.
      *
           INITIALIZE                TBL-NYU-DAY
      *
           MOVE    ZERO          TO  DAY-IDX
           MOVE    ZERO          TO  FLG-NYU-RENZOKU
      *
           PERFORM    VARYING    IDX  FROM   1   BY   1
                      UNTIL     (IDX      >   31)  OR
                                (DAY-IDX  >   31)
                IF    RECE84-KAISU(1 IDX)   =  ZERO
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                ELSE
                  IF  (RECE84-ZAISKBKBN         =  "2")
                  AND (FLG-RYOCOM               =   1 )
                  AND (TBL-RYOCOM-NYUINKBN(IDX) =  "1")
                  AND (RECE82-SRYYM       >=  "201004")
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                  ELSE
                      IF    FLG-NYU-RENZOKU  =  ZERO
                         ADD   1     TO  DAY-IDX
                         MOVE  IDX   TO  TBL-NYU-DAY-ST(DAY-IDX)
                      END-IF
                      MOVE  IDX      TO  TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  1        TO  FLG-NYU-RENZOKU
                  END-IF
                END-IF
           END-PERFORM
      *
           PERFORM    VARYING    DAY-IDX  FROM   1   BY   1
                      UNTIL  (DAY-IDX                      >   31)  OR
                             (TBL-NYU-DAY-ST(DAY-IDX)  = ZERO)
                IF    TBL-NYU-DAY-ST(DAY-IDX) 
                                    =   TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  CONS-SANTEI-COMMENT1
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                ELSE
                      MOVE  CONS-SANTEI-COMMENT2
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                END-IF
           END-PERFORM
      *
           .
       20011-NYU-DAY-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日コメント編集
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-NYU-COMMENT2-SEC          SECTION.
      *
           INITIALIZE  WRK-JIDO-SETCOM-AREA
      *
           MOVE    SPACE                  TO  WRK-CYOJKSN-YMD
                                              WRK-CYOJKSN-INPUTCOMENT
                                              WRK-CYOJKSN-NAME
           EVALUATE  RECE84-FLG-CYOJKSN-COMMENT
             WHEN      "1"
             WHEN      "3"
               MOVE  WRK-CYOJKSN-YMD-XXX  TO  WRK-CYOJKSN-YMD
               MOVE  WRK-CYOJKSN-COM-XXX  TO  WRK-CYOJKSN-INPUTCOMENT
               MOVE  WRK-CYOJKSN-COM2-XXX TO  WRK-CYOJKSN-NAME
             WHEN      "2"
             WHEN      "4"
               MOVE  WRK-CYOJKSN-YMD-YYY  TO  WRK-CYOJKSN-YMD
               MOVE  WRK-CYOJKSN-COM-YYY  TO  WRK-CYOJKSN-INPUTCOMENT
               MOVE  WRK-CYOJKSN-COM2-YYY TO  WRK-CYOJKSN-NAME
           END-EVALUATE
      *
           PERFORM     200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *
           IF      RECE82-SRYYM >= "202008"
             IF    WRK-CYOJKSN-YMD  NOT =  SPACE
               MOVE      ZERO           TO  IDZ
               INITIALIZE                   WRK-FREE-AREA2
               EVALUATE  RECE84-FLG-CYOJKSN-COMMENT
                 WHEN      "1"
                 WHEN      "3"
                   MOVE   84  TO  IDX-JIDO
                 WHEN      "2"
                 WHEN      "4"
                   MOVE   85  TO  IDX-JIDO
               END-EVALUATE
               PERFORM  200111-RECECOMMENT-IDXGET-SEC
               MOVE   WRK-CYOJKSN-YMD  TO  WRK-RECECOM-YMD
               PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               MOVE     WK-FREE-SRYCD2(IDZ)
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
               MOVE     ZERO TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
               MOVE     WK-FREE-YUKOKETA2(IDZ)
                             TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
               MOVE     WK-FREE-NAME2(IDZ)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
               MOVE     WK-FREE-INPUTCOMENT2(IDZ)
                          TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
      *
               IF    WRK-CYOJKSN-INPUTCOMENT  NOT =  SPACE
                 MOVE  SPACE
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE  SPACE
                          TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
                 MOVE  WK-FREE-SRYCD2(IDZ)
                                     TO  WRK-TENSU-SRYCD
                 MOVE  RECE82-SRYYM  TO  WRK-TENSU-SRYYM
                 PERFORM 900-TENSU-TBL-SEC
                 STRING    TNS-NAME  DELIMITED   BY  SPACE
                           "；"      DELIMITED   BY  SIZE
                           WRK-CYOJKSN-NAME
                                     DELIMITED   BY  SPACE
                             INTO    WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 END-STRING
                 MOVE  WRK-CYOJKSN-INPUTCOMENT
                          TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
               END-IF
      *
               MOVE  "1"  TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
             END-IF
           ELSE
             IF    WRK-CYOJKSN-YMD  NOT =  SPACE
      *        算定日コメントの挿入
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               MOVE   "810000001"
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
               MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
               IF   RECE82-SRYYM >= "201905"
                 MOVE  16    TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE  "算定開始　　　　　年　　月　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE  15    TO  IDX41
                 MOVE  21    TO  IDX42
                 MOVE  27    TO  IDX48
                 MOVE  11    TO  IDX49
               ELSE
                 MOVE  14    TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE  "算定開始　　　年　　月　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE  11    TO  IDX41
                 MOVE  17    TO  IDX42
                 MOVE  23    TO  IDX48
               END-IF
      *
               INITIALIZE                         STS-AREA-DAY
               INITIALIZE                         LNK-DAY2-AREA
               MOVE    "21"                   TO  LNK-DAY2-IRAI
               MOVE    WRK-CYOJKSN-YMD        TO  LNK-DAY2-YMD
               CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                              LNK-DAY2-AREA
               IF      STS-DAY-RC1            =   ZERO
                  MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
                  INITIALIZE                       ORCSKANACHKAREA
                  MOVE    "2"                  TO  KANACHK-SYORI
                  MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                  CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                  IF      KANACHK-RC      =   ZERO
                     MOVE    KANACHK-OUT-INPUT(1:4)
                      TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX41:4)
                  END-IF
      *
                  MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
                  INITIALIZE                       ORCSKANACHKAREA
                  MOVE    "2"                  TO  KANACHK-SYORI
                  MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                  CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                  IF      KANACHK-RC      =   ZERO
                     MOVE    KANACHK-OUT-INPUT(1:4)
                      TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX42:4)
                  END-IF
      *
                  MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
                  INITIALIZE                       ORCSKANACHKAREA
                  MOVE    "2"                  TO  KANACHK-SYORI
                  MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
                  CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
                  IF      KANACHK-RC      =   ZERO
                     MOVE    KANACHK-OUT-INPUT(1:4)
                      TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX48:4)
                  END-IF
      *
                  IF   RECE82-SRYYM >= "201905"
                     MOVE    LNK-DAY2-EDTYMD2-G
                      TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX49:4)
                  END-IF
               END-IF
      *
               IF    WRK-CYOJKSN-INPUTCOMENT  NOT =  SPACE
                 MOVE  SPACE TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 IF    WRK-CYOJKSN-INPUTCOMENT(15:2) = "年"
                   MOVE  14  TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT(1:28)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 ELSE
                   MOVE  16  TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                   MOVE  WRK-CYOJKSN-INPUTCOMENT(1:32)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 END-IF
               END-IF
      *
               MOVE    "1"   TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
               MOVE    "1"   TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
             END-IF
           END-IF
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           IF    WRK-CYOJKSN-YMD  NOT =  SPACE
           AND   RECE82-SRYYM         < "202008"
             EVALUATE  RECE84-FLG-CYOJKSN-COMMENT
               WHEN      "1"
               WHEN      "3"
                 IF    TBL-CYOJKSN-X =  ZERO
                   PERFORM    20012-NYUKASAN-HENSYU2-SEC
                   MOVE   1   TO   TBL-CYOJKSN-X
                 END-IF
               WHEN      "2"
               WHEN      "4"
                 IF    TBL-CYOJKSN-Y =  ZERO
                   PERFORM    20012-NYUKASAN-HENSYU2-SEC
                   MOVE   1   TO   TBL-CYOJKSN-Y
                 END-IF
             END-EVALUATE
           END-IF
      *
           .
       2001-NYU-COMMENT2-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    の算定開始日コメント編集
      *****************************************************************
       2001-NYU-COMMENT3-SEC          SECTION.
      *
           MOVE        SPACE    TO    WRK-CYOJKSN-INPUTCOMENT3
      *
           PERFORM     200111-RECE85-TAIHI-SEC
      *
           PERFORM
             UNTIL  ( FLG-RECE85           =   1                   )
             OR     ( RECE84-HOSPNUM   NOT =   RECE85-HOSPNUM      )
             OR     ( RECE84-SRYYM     NOT =   RECE85-SRYYM        )
             OR     ( RECE84-NYUGAIKBN NOT =   RECE85-NYUGAIKBN    )
             OR     ( RECE84-PTID      NOT =   RECE85-PTID         )
             OR     ( RECE84-RECEKA    NOT =   RECE85-RECEKA       )
             OR     ( RECE84-HKNID     NOT =   RECE85-HKNID        )
             OR     ( RECE84-TEKSTYMD  NOT =   RECE85-TEKSTYMD     )
             OR     ( RECE84-ZAINUM    NOT =   RECE85-ZAINUM       )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX               >   5     )
                         OR      ( RECE85-SRYCD(IDX) =   SPACE )
                  IF  (RECE85-SRYCD(IDX) = "840000056" OR "840000556")
                  AND (WRK-CYOJKSN-INPUTCOMENT3  =  SPACE            )
                     MOVE  RECE85-NAME(IDX)(1:80)
                                     TO  WRK-CYOJKSN-INPUTCOMENT3
                  END-IF
               END-PERFORM
      *
               PERFORM 990-RECE85-NEXT-SEC
      *
           END-PERFORM
      *
           IF  WRK-CYOJKSN-INPUTCOMENT3  NOT = SPACE
               EVALUATE  RECE84-FLG-CYOJKSN-COMMENT
                 WHEN      "5"
                 WHEN      "7"
                   MOVE     ZERO     TO    FLG-ARI
                   PERFORM  VARYING  IDX32    FROM    1   BY  1
                             UNTIL  (IDX32                  >  10  )
                              OR    (TBL-CYOJKSN2-X-TAIHIYMD
                                                    (IDX32) = SPACE)
                              OR    (FLG-ARI                =   1  )
                     IF  TBL-CYOJKSN2-X-TAIHIYMD(IDX32)
                                     =  WRK-CYOJKSN-INPUTCOMENT3
                        MOVE   1     TO    FLG-ARI
                     END-IF
                   END-PERFORM
                   IF    FLG-ARI  =  ZERO
                   AND   IDX32   <=   10
                     PERFORM    20012-NYUKASAN-HENSYU3-SEC
                     MOVE   WRK-CYOJKSN-INPUTCOMENT3
                              TO  TBL-CYOJKSN2-X-TAIHIYMD(IDX32)
                   END-IF
                 WHEN      "6"
                 WHEN      "8"
                   MOVE     ZERO     TO    FLG-ARI
                   PERFORM  VARYING  IDX32    FROM    1   BY  1
                             UNTIL  (IDX32                  >  10  )
                              OR    (TBL-CYOJKSN2-Y-TAIHIYMD
                                                    (IDX32) = SPACE)
                              OR    (FLG-ARI                =   1  )
                     IF  TBL-CYOJKSN2-Y-TAIHIYMD(IDX32)
                                     =  WRK-CYOJKSN-INPUTCOMENT3
                        MOVE   1     TO    FLG-ARI
                     END-IF
                   END-PERFORM
                   IF    FLG-ARI  =  ZERO
                   AND   IDX32   <=   10
                     PERFORM    20012-NYUKASAN-HENSYU3-SEC
                     MOVE   WRK-CYOJKSN-INPUTCOMENT3
                              TO  TBL-CYOJKSN2-Y-TAIHIYMD(IDX32)
                   END-IF
               END-EVALUATE
           END-IF
      *
           .
       2001-NYU-COMMENT3-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科隔離病室管理加算（入院料加算）があるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-KAKURI-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-KAKURI-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-KAKURI-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    労災治療計画加算（入院料加算）があるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-CHIRYO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-CHIRYO-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   20011-CHIRYO-COMMENT-SEC
           END-IF
      *
           .
       2001-CHIRYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    栄養サポートチーム加算（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-EISAPO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-EISAPO-COMMENT    =    "1" OR "2"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-EISAPO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    呼吸ケアチーム加算（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-KOKKEA-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-KOKKEA-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-KOKKEA-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    重症者加算（精神療養病棟入院料）（入院料加算）のコメントがあるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-JYUSYO-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-JYUSYO-COMMENT     =
                                         "1" OR "2" OR "3" OR "4"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-JYUSYO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    精神科リエゾンチーム加算があるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-SEIRIE-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-SEIRIE-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-SEIRIE-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    病棟薬剤業務実施加算があるか判定
      *    （診療行為入力）
      *****************************************************************
       2001-BYOYAK-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-BYOYAK-COMMENT    =    "1" OR "2" OR "3"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-BYOYAK-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    超重症児（者）入院診療加算・準超重症児（者）入院診療加算
      *    があるか判定（診療行為入力）
      *****************************************************************
       2001-CYOJKSN-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-CYOJKSN-COMMENT   =
                   "1" OR "2" OR "3" OR "4" OR "5" OR "6" OR "7" OR "8"
             EVALUATE  RECE84-FLG-CYOJKSN-COMMENT
               WHEN      "1"
               WHEN      "2"
               WHEN      "3"
               WHEN      "4"
                 MOVE       99      TO     FLG-COMMENT
                 PERFORM   2001-NYU-COMMENT2-SEC
               WHEN      "5"
               WHEN      "6"
               WHEN      "7"
               WHEN      "8"
                 PERFORM   2001-NYU-COMMENT3-SEC
             END-EVALUATE
           END-IF
      *
           .
       2001-CYOJKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    排尿自立支援加算があるか判定（診療行為入力）
      *  ＃202008選択式コメント対応
      *****************************************************************
       2001-HAIJSK-HANTEI-SEC          SECTION.
      *
           IF     RECE84-FLG-HAIJSK-COMMENT   =    "1"
      *
             MOVE  SPACE             TO  WRK-HAIJSK-FSANTEIYM
             MOVE  ZERO              TO  WRK-HAIJSK-KAISU
      *
             INITIALIZE                  ORCSRECESRCHKAREA
             MOVE  "1"               TO  LNK-RECESRCHK-SYORI
             MOVE  RECE82-PTID       TO  LNK-RECESRCHK-PTID
             MOVE  RECE82-SRYYM      TO  LNK-RECESRCHK-SRYYM
             MOVE  RECE82-NYUGAIKBN  TO  LNK-RECESRCHK-NYUGAIKBN
             IF    RECE82-NYUINYMD   <   "20200401"
               MOVE  "20200401"      TO  LNK-RECESRCHK-SRYYMD(1)
             ELSE
               MOVE  RECE82-NYUINYMD TO  LNK-RECESRCHK-SRYYMD(1)
             END-IF
             IF    RECE82-HAIJSKYMD  <   LNK-RECESRCHK-SRYYMD(1)
               MOVE  RECE82-HAIJSKYMD  TO  LNK-RECESRCHK-SRYYMD(2)
             END-IF
             CALL  "ORCSRECESRCHK"   USING  SPA-AREA
                                            ORCSRECESRCHKAREA
             IF    LNK-RECESRCHK-RC  =  ZERO
                MOVE  LNK-RECESRCHK-FSANTEIYMD
                                           TO  WRK-HAIJSK-FSANTEIYM
                MOVE  LNK-RECESRCHK-KAISU  TO  WRK-HAIJSK-KAISU
             END-IF
      *
             IF   (WRK-HAIJSK-FSANTEIYM  NOT = SPACE)
             AND  (WRK-HAIJSK-KAISU      NOT = ZERO )
      *
                INITIALIZE                WRK-JIDO-SETCOM-AREA
                MOVE       99      TO     FLG-COMMENT
      *
                MOVE      ZERO     TO     IDZ
                INITIALIZE                WRK-FREE-AREA2
      *
                IF   RECE82-SRYYM  >= "202008"
                  MOVE   88          TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   WRK-HAIJSK-FSANTEIYM
                                     TO  WRK-RECECOM-YMD
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
      *
                  MOVE   588         TO  IDX-JIDO
                  PERFORM  200111-RECECOMMENT-IDXGET-SEC
                  MOVE   WRK-HAIJSK-KAISU
                                     TO  WRK-RECECOM-NUM
                  PERFORM  200111-RECECOMMENT-HENSYU-SEC
                ELSE
                  ADD        1       TO     IDZ
      *
                  MOVE       11      TO     WK-FREE-YUKOKETA2(IDZ)
                  MOVE   "初回算定　　　月　　日"
                                     TO     WK-FREE-NAME2(IDZ)
                  MOVE    WRK-HAIJSK-FSANTEIYM(5:2)  TO  DAY-IDX2
                  MOVE    TBL-DAY(DAY-IDX2)
                                     TO  WK-FREE-NAME2(IDZ)(11:4)
                  MOVE    WRK-HAIJSK-FSANTEIYM(7:2)  TO  DAY-IDX2
                  MOVE    TBL-DAY(DAY-IDX2)
                                     TO  WK-FREE-NAME2(IDZ)(17:4)
                  IF    WRK-HAIJSK-KAISU  <=  31
                    ADD      1       TO     IDZ
      *
                    MOVE     11      TO     WK-FREE-YUKOKETA2(IDZ)
                    MOVE   "通算実施回数（　　回）"
                                     TO     WK-FREE-NAME2(IDZ)
                    MOVE    WRK-HAIJSK-KAISU  TO  DAY-IDX2
                    MOVE    TBL-DAY(DAY-IDX2)
                                     TO     WK-FREE-NAME2(IDZ)(15:4)
                  END-IF
                END-IF
      *
                PERFORM    200111-RECE85-TAIHI-SEC
      *
      *         ＲＥＣＥ０５ファイルの内容をテーブルに退避
                MOVE    ZERO                 TO  IDX-RECE85
                MOVE    SPACE                TO  WRK-RECE85XX-REC
                INITIALIZE                       WRK-RECE85XX-REC
      *
                MOVE    RECE84-MEISAISU      TO  MAX-MEISAISU
      *
                PERFORM   VARYING   IDX   FROM    1   BY  1
                           UNTIL   (IDX                >   50   )
                             OR    (WK-FREE-NAME2(IDX) =   SPACE)
                  COMPUTE  MAX-MEISAISU = MAX-MEISAISU + 1
                  IF  WK-FREE-SRYCD2(IDX) = SPACE
                    MOVE "810000001"
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                  ELSE
                    MOVE WK-FREE-SRYCD2(IDX)
                            TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                  END-IF
                  MOVE ZERO TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                  MOVE WK-FREE-YUKOKETA2(IDX)
                            TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                  MOVE WK-FREE-NAME2(IDX)
                            TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                  MOVE WK-FREE-INPUTCOMENT2(IDX)
                            TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
                  MOVE "1"  TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
                  IF   RECE82-SRYYM  < "202008"
                   MOVE "1" TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
                  END-IF
                END-PERFORM
      *
                PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
                IF   RECE82-SRYYM  < "202008"
                  PERFORM  20012-NYUKASAN-HENSYU4-SEC
                END-IF
      *
             END-IF
      *
           END-IF
      *
           .
       2001-HAIJSK-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院料加算があるか判定（診療行為入力）
      *  ＃202004選択式コメント対応
      *****************************************************************
       2001-NYUKSN-HANTEI-SEC          SECTION.
      *
           IF      RECE84-FLG-NYUKSN-COMMENT    =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM   2001-NYU-COMMENT-SEC
           END-IF
      *
           .
       2001-NYUKSN-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    労災治療計画加算のコメント編集
      *****************************************************************
       20011-CHIRYO-COMMENT-SEC          SECTION.
      *
           INITIALIZE WRK-JIDO-SETCOM-AREA
      *
           PERFORM    200111-SANTEI-DAY-SEC
      *
           MOVE       RECE84-REC       TO  RECE849-REC
           ADD     1                   TO  RECE849-MEISAISU
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 800-RECE84-SET85-SEC
           MOVE    RECE84-ZAINUM       TO  RECE85-ZAINUM
           START   RECE85-FILE
                 KEY IS    >=   RECE85-KEY
                 INVALID
                     MOVE    1          TO  FLG-RECE85
                 NOT INVALID
                     PERFORM 990-RECE85-NEXT-SEC
           END-START
      *
           MOVE    RECE85-REC           TO  RECE859-REC
           MOVE    RECE85-SRYACT-TBL(1) TO  RECE859-SRYACT-TBL(1)
           MOVE    RECE85-SRYACT-TBL(2) TO  RECE859-SRYACT-TBL(3)
           MOVE    RECE85-SRYACT-TBL(3) TO  RECE859-SRYACT-TBL(4)
           MOVE    RECE85-SRYACT-TBL(4) TO  RECE859-SRYACT-TBL(5)
      *
           MOVE    SPACE                TO  RECE859-SRYACT-TBL(2)
           INITIALIZE                       RECE859-SRYACT-TBL(2)
           MOVE    "810000001"          TO  RECE859-SRYCD(2)
           MOVE    ZERO                 TO  RECE859-SRYSURYO(2)
           MOVE    9                    TO  RECE859-YUKOKETA(2)
           MOVE    "算定　　　月　　日" TO  RECE859-NAME(2)
           MOVE     RECE82-SRYYM(5:2)   TO  DAY-IDX2
           MOVE     TBL-DAY(DAY-IDX2)   TO  RECE859-NAME(2)(7:4)
           MOVE     TB-SANTEI-DAY(1)    TO  DAY-IDX2
           MOVE     TBL-DAY(DAY-IDX2)   TO  RECE859-NAME(2)(13:4)
           MOVE     "1"                 TO  RECE859-RECEDENFLG(2)
           MOVE     "1"                 TO  RECE859-SIKFLG(2)
      *
           PERFORM 800-RECE859-WRITE-SEC
      *
           IF     RECE84-ZAISKBKBN             =    "6"
           AND    RECE84-MEISAISU              =     1
               PERFORM    20011-NYU-DAY-SEC
               PERFORM    20012-NYUKASAN-HENSYU-SEC
           END-IF
      *
           .
       20011-CHIRYO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    （レセ電用）
      *****************************************************************
       20012-NYUKASAN-HENSYU-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    1                    TO  MAX-MEISAISU
      *
           MOVE  "810000001"  TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE   ZERO        TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
           IF  (RECE84-FLG-KAKURI-COMMENT    =    "1")
             MOVE   13        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "精神科隔離室管理加算算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-EISAPO-COMMENT    =    "1")
             MOVE   14        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "栄養サポートチーム加算算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-EISAPO-COMMENT    =    "2")
             MOVE   20        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "栄養サポートチーム加算（指定地域）算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-KOKKEA-COMMENT    =    "1")
             MOVE   12        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "呼吸ケアチーム加算算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-JYUSYO-COMMENT    =    "2")
            IF  RECE82-SRYYM   >=  "201404"
              MOVE   20       TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算１（精神療養病棟入院料）算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
            ELSE
              MOVE   9        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算１算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
            END-IF
           END-IF
           IF  (RECE84-FLG-JYUSYO-COMMENT    =    "1")
            IF  RECE82-SRYYM   >=  "201404"
              MOVE   20       TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算２（精神療養病棟入院料）算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
            ELSE
             IF  RECE82-SRYYM   >=  "201204"
              MOVE   9        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算２算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
             ELSE
              MOVE   19       TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算（精神療養病棟入院料）算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
             END-IF
            END-IF
           END-IF
           IF  (RECE84-FLG-JYUSYO-COMMENT    =    "3")
              MOVE   24       TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算１（地域移行機能強化病棟入院料）算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-JYUSYO-COMMENT    =    "4")
              MOVE   24       TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
              MOVE  "重症者加算２（地域移行機能強化病棟入院料）算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-SEIRIE-COMMENT    =    "1")
             MOVE   15        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "精神科リエゾンチーム加算算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-BYOYAK-COMMENT    =    "1")
             MOVE   13        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "病棟薬剤業務実施加算算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-BYOYAK-COMMENT    =    "2")
             MOVE   14        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "病棟薬剤業務実施加算１算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-BYOYAK-COMMENT    =    "3")
             MOVE   14        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "病棟薬剤業務実施加算２算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-CHIRYO-COMMENT    =    "1")
             MOVE   11        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "労災治療計画加算算定日"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           MOVE  "1"          TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
           MOVE  "1"          TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *    算定日コメントの挿入
           PERFORM  VARYING      IDX    FROM  1   BY   1
                    UNTIL       (IDX    >     31)      OR
                                (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
               MOVE    "810000001"
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
               MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
               IF    TBL-NYU-DAY-CD(IDX)  =  CONS-SANTEI-COMMENT1
                 MOVE    3   TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE    TBL-NYU-DAY-ST(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(1:4)
               ELSE
                 MOVE    7   TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                 MOVE    "　　日〜　　日"
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                 MOVE    TBL-NYU-DAY-ST(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(1:4)
                 MOVE    TBL-NYU-DAY-ED(IDX)
                             TO  DAY-IDX
                 MOVE    TBL-DAY(DAY-IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(9:4)
               END-IF
               MOVE   "1"    TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
               MOVE   "1"    TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           END-PERFORM
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
               PERFORM 800-RECE82-SET859-SEC
               EVALUATE  RECE84-SRYKBN
                 WHEN      "90"
                   IF  (RECE84-FLG-KAKURI-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994001
                   END-IF
                   IF  (RECE84-FLG-EISAPO-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994006
                   END-IF
                   IF  (RECE84-FLG-EISAPO-COMMENT    =    "2")
                     COMPUTE RECE859-ZAINUM =  99994011
                   END-IF
                   IF  (RECE84-FLG-KOKKEA-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994016
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "2")
                     COMPUTE RECE859-ZAINUM =  99994021
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994026
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "3")
                     COMPUTE RECE859-ZAINUM =  99994031
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "4")
                     COMPUTE RECE859-ZAINUM =  99994036
                   END-IF
                   IF  (RECE84-FLG-SEIRIE-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994041
                   END-IF
                   IF  (RECE84-FLG-BYOYAK-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994046
                   END-IF
                   IF  (RECE84-FLG-BYOYAK-COMMENT    =    "2")
                     COMPUTE RECE859-ZAINUM =  99994051
                   END-IF
                   IF  (RECE84-FLG-BYOYAK-COMMENT    =    "3")
                     COMPUTE RECE859-ZAINUM =  99994056
                   END-IF
                   IF  (RECE84-FLG-CHIRYO-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994061
                   END-IF
                   MOVE    "900"            TO   RECE859-SRYSYUKBN
                 WHEN      "92"
                   IF  (RECE84-FLG-KAKURI-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994501
                   END-IF
                   IF  (RECE84-FLG-EISAPO-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994506
                   END-IF
                   IF  (RECE84-FLG-EISAPO-COMMENT    =    "2")
                     COMPUTE RECE859-ZAINUM =  99994511
                   END-IF
                   IF  (RECE84-FLG-KOKKEA-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994516
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "2")
                     COMPUTE RECE859-ZAINUM =  99994521
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994526
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "3")
                     COMPUTE RECE859-ZAINUM =  99994531
                   END-IF
                   IF  (RECE84-FLG-JYUSYO-COMMENT    =    "4")
                     COMPUTE RECE859-ZAINUM =  99994536
                   END-IF
                   IF  (RECE84-FLG-SEIRIE-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994541
                   END-IF
                   IF  (RECE84-FLG-BYOYAK-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994546
                   END-IF
                   IF  (RECE84-FLG-BYOYAK-COMMENT    =    "2")
                     COMPUTE RECE859-ZAINUM =  99994551
                   END-IF
                   IF  (RECE84-FLG-BYOYAK-COMMENT    =    "3")
                     COMPUTE RECE859-ZAINUM =  99994556
                   END-IF
                   IF  (RECE84-FLG-CHIRYO-COMMENT    =    "1")
                     COMPUTE RECE859-ZAINUM =  99994561
                   END-IF
                   MOVE    "920"            TO   RECE859-SRYSYUKBN
               END-EVALUATE
               ADD     1                    TO   WRK-RENNUM
               MOVE    WRK-RENNUM           TO   RECE859-RENNUM
               MOVE    RECE84-PTNUM         TO   RECE859-PTNUM
               MOVE    RECE84-SRYKA         TO   RECE859-SRYKA
               MOVE    RECE84-SRYKBN        TO   RECE859-SRYKBN
               MOVE    ZERO                 TO   RECE859-JIHIMONEY
               PERFORM  VARYING   IDX   FROM   1   BY   1
                         UNTIL   (IDX       >    5)   OR
                                 (FLG-WRKRECE85   =   1)
                   ADD        1             TO    IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE   1             TO    FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
               END-PERFORM
               IF   RECE859-SRYCD(1)  NOT =  SPACE
                   PERFORM 800-RECE859-WRITE-SEC
               END-IF
           END-PERFORM
      *
           PERFORM 800-RECE82-SET849-SEC
           EVALUATE  RECE84-SRYKBN
             WHEN      "90"
               IF  (RECE84-FLG-KAKURI-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994001
               END-IF
               IF  (RECE84-FLG-EISAPO-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994006
               END-IF
               IF  (RECE84-FLG-EISAPO-COMMENT    =    "2")
                 COMPUTE RECE849-ZAINUM =  99994011
               END-IF
               IF  (RECE84-FLG-KOKKEA-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994016
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "2")
                 COMPUTE RECE849-ZAINUM =  99994021
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994026
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "3")
                 COMPUTE RECE849-ZAINUM =  99994031
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "4")
                 COMPUTE RECE849-ZAINUM =  99994036
               END-IF
               IF  (RECE84-FLG-SEIRIE-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994041
               END-IF
               IF  (RECE84-FLG-BYOYAK-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994046
               END-IF
               IF  (RECE84-FLG-BYOYAK-COMMENT    =    "2")
                 COMPUTE RECE849-ZAINUM =  99994051
               END-IF
               IF  (RECE84-FLG-BYOYAK-COMMENT    =    "3")
                 COMPUTE RECE849-ZAINUM =  99994056
               END-IF
               IF  (RECE84-FLG-CHIRYO-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994061
               END-IF
             WHEN      "92"
               IF  (RECE84-FLG-KAKURI-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994501
               END-IF
               IF  (RECE84-FLG-EISAPO-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994506
               END-IF
               IF  (RECE84-FLG-EISAPO-COMMENT    =    "2")
                 COMPUTE RECE849-ZAINUM =  99994511
               END-IF
               IF  (RECE84-FLG-KOKKEA-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994516
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "2")
                 COMPUTE RECE849-ZAINUM =  99994521
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994526
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "3")
                 COMPUTE RECE849-ZAINUM =  99994531
               END-IF
               IF  (RECE84-FLG-JYUSYO-COMMENT    =    "4")
                 COMPUTE RECE849-ZAINUM =  99994536
               END-IF
               IF  (RECE84-FLG-SEIRIE-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994541
               END-IF
               IF  (RECE84-FLG-BYOYAK-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994546
               END-IF
               IF  (RECE84-FLG-BYOYAK-COMMENT    =    "2")
                 COMPUTE RECE849-ZAINUM =  99994551
               END-IF
               IF  (RECE84-FLG-BYOYAK-COMMENT    =    "3")
                 COMPUTE RECE849-ZAINUM =  99994556
               END-IF
               IF  (RECE84-FLG-CHIRYO-COMMENT    =    "1")
                 COMPUTE RECE849-ZAINUM =  99994561
               END-IF
           END-EVALUATE
           MOVE    RECE84-SRYKBN       TO  RECE849-SRYKBN
           MOVE    "6"                 TO  RECE849-ZAISKBKBN
           MOVE    RECE84-PTNUM        TO  RECE849-PTNUM
           MOVE    RECE84-SRYKA        TO  RECE849-SRYKA
           MOVE    RECE84-HKNCOMBI     TO  RECE849-HKNCOMBI
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       20012-NYUKASAN-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    （レセ電用）
      *****************************************************************
       20012-NYUKASAN-HENSYU2-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    1                    TO  MAX-MEISAISU
      *
           MOVE  "810000001"  TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE   ZERO        TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
           IF  (RECE84-FLG-CYOJKSN-COMMENT    =    "1" OR "3")
             MOVE   17        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "超重症児（者）入院診療加算算定開始"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           IF  (RECE84-FLG-CYOJKSN-COMMENT    =    "2" OR "4")
             MOVE   18        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "準超重症児（者）入院診療加算算定開始"
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
           MOVE  "1"          TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
           MOVE  "1"          TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
      *    算定日コメントの挿入
           COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
           MOVE   "810000001"
                         TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
           IF   RECE82-SRYYM >= "201905"
             MOVE  11    TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "　　　　年　　月　　日"
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
             MOVE   5    TO  IDX41
             MOVE  11    TO  IDX42
             MOVE  17    TO  IDX48
             MOVE   1    TO  IDX49
           ELSE
             MOVE   9    TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "　　年　　月　　日"
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
             MOVE   1    TO  IDX41
             MOVE   7    TO  IDX42
             MOVE  13    TO  IDX48
           END-IF
      *
           INITIALIZE                         STS-AREA-DAY
           INITIALIZE                         LNK-DAY2-AREA
           MOVE    "21"                   TO  LNK-DAY2-IRAI
           MOVE    WRK-CYOJKSN-YMD        TO  LNK-DAY2-YMD
           CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                          LNK-DAY2-AREA
           IF      STS-DAY-RC1            =   ZERO
              MOVE    LNK-DAY2-EDTYMD1-Y   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                    TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX41:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-M   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                    TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX42:4)
              END-IF
      *
              MOVE    LNK-DAY2-EDTYMD1-D   TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                  TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX         TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                    TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX48:4)
              END-IF
      *
              IF   RECE82-SRYYM >= "201905"
                 MOVE    LNK-DAY2-EDTYMD2-G
                    TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(IDX49:4)
              END-IF
           END-IF
      *
           IF    WRK-CYOJKSN-INPUTCOMENT  NOT =  SPACE
              MOVE    SPACE  TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              IF    WRK-CYOJKSN-INPUTCOMENT(15:2) = "年"
                MOVE   9     TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE  WRK-CYOJKSN-INPUTCOMENT(11:18)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              ELSE
                MOVE  11     TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE  WRK-CYOJKSN-INPUTCOMENT(11:22)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
              END-IF
           END-IF
      *
           MOVE   "1"    TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
           MOVE   "1"    TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
               PERFORM 800-RECE82-SET859-SEC
               EVALUATE  RECE84-SRYKBN
                 WHEN      "90"
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "1" OR "3")
                     COMPUTE RECE859-ZAINUM =  99994201
                   END-IF
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "2" OR "4")
                     COMPUTE RECE859-ZAINUM =  99994206
                   END-IF
                   MOVE    "900"            TO   RECE859-SRYSYUKBN
                 WHEN      "92"
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "1" OR "3")
                     COMPUTE RECE859-ZAINUM =  99994701
                   END-IF
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "2" OR "4")
                     COMPUTE RECE859-ZAINUM =  99994706
                   END-IF
                   MOVE    "920"            TO   RECE859-SRYSYUKBN
               END-EVALUATE
               ADD     1                    TO   WRK-RENNUM
               MOVE    WRK-RENNUM           TO   RECE859-RENNUM
               MOVE    RECE84-PTNUM         TO   RECE859-PTNUM
               MOVE    RECE84-SRYKA         TO   RECE859-SRYKA
               MOVE    RECE84-SRYKBN        TO   RECE859-SRYKBN
               MOVE    ZERO                 TO   RECE859-JIHIMONEY
               PERFORM  VARYING   IDX   FROM   1   BY   1
                         UNTIL   (IDX       >    5)   OR
                                 (FLG-WRKRECE85   =   1)
                   ADD        1             TO    IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE   1             TO    FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
               END-PERFORM
               IF   RECE859-SRYCD(1)  NOT =  SPACE
                   WRITE   RECE859-REC
                   ADD     1            TO   CNT-RECE859
               END-IF
           END-PERFORM
      *
           PERFORM 800-RECE82-SET849-SEC
           EVALUATE  RECE84-SRYKBN
             WHEN      "90"
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "1" OR "3")
                 COMPUTE RECE849-ZAINUM =  99994201
               END-IF
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "2" OR "4")
                 COMPUTE RECE849-ZAINUM =  99994206
               END-IF
             WHEN      "92"
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "1" OR "3")
                 COMPUTE RECE849-ZAINUM =  99994701
               END-IF
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "2" OR "4")
                 COMPUTE RECE849-ZAINUM =  99994706
               END-IF
           END-EVALUATE
           MOVE    RECE84-SRYKBN       TO  RECE849-SRYKBN
           MOVE    "6"                 TO  RECE849-ZAISKBKBN
           MOVE    RECE84-PTNUM        TO  RECE849-PTNUM
           MOVE    RECE84-SRYKA        TO  RECE849-SRYKA
           MOVE    RECE84-HKNCOMBI     TO  RECE849-HKNCOMBI
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           WRITE   RECE849-REC
           ADD     1                   TO  CNT-RECE849
      *
           .
       20012-NYUKASAN-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    （レセ電用）
      *****************************************************************
       20012-NYUKASAN-HENSYU3-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    1                    TO  MAX-MEISAISU
      *
           MOVE  "810000001"  TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE   ZERO        TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
           IF  (RECE84-FLG-CYOJKSN-COMMENT    =    "5" OR "7")
             MOVE   30        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "超重症児（者）入院診療加算算定開始"
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(1:34)
             MOVE  "（入院年月日以前の算定分）"
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(35:26)
           END-IF
           IF  (RECE84-FLG-CYOJKSN-COMMENT    =    "6" OR "8")
             MOVE   31        TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "準超重症児（者）入院診療加算算定開始"
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(1:36)
             MOVE  "（入院年月日以前の算定分）"
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(37:26)
           END-IF
           MOVE  "1"          TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
           MOVE  "1"          TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
      *    算定日コメントの挿入
           COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
           MOVE   "810000001"
                         TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE    ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
      *
           IF    WRK-CYOJKSN-INPUTCOMENT3(15:2) = "年"
             MOVE   9    TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  WRK-CYOJKSN-INPUTCOMENT3(11:18)
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           ELSE
             MOVE  11    TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  WRK-CYOJKSN-INPUTCOMENT3(11:22)
                         TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           END-IF
      *
           MOVE   "1"    TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
           MOVE   "1"    TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
               PERFORM 800-RECE82-SET859-SEC
               EVALUATE  RECE84-SRYKBN
                 WHEN      "90"
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "5" OR "7")
                     COMPUTE RECE859-ZAINUM = 99994100 +  IDX32
                   END-IF
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "6" OR "8")
                     COMPUTE RECE859-ZAINUM = 99994150 +  IDX32
                   END-IF
                   MOVE    "900"            TO   RECE859-SRYSYUKBN
                 WHEN      "92"
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "5" OR "7")
                     COMPUTE RECE859-ZAINUM = 99994600 +  IDX32
                   END-IF
                   IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "6" OR "8")
                     COMPUTE RECE859-ZAINUM = 99994650 +  IDX32
                   END-IF
                   MOVE    "920"            TO   RECE859-SRYSYUKBN
               END-EVALUATE
               ADD     1                    TO   WRK-RENNUM
               MOVE    WRK-RENNUM           TO   RECE859-RENNUM
               MOVE    RECE84-PTNUM         TO   RECE859-PTNUM
               MOVE    RECE84-SRYKA         TO   RECE859-SRYKA
               MOVE    RECE84-SRYKBN        TO   RECE859-SRYKBN
               MOVE    ZERO                 TO   RECE859-JIHIMONEY
               PERFORM  VARYING   IDX   FROM   1   BY   1
                         UNTIL   (IDX       >    5)   OR
                                 (FLG-WRKRECE85   =   1)
                   ADD        1             TO    IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE   1             TO    FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
               END-PERFORM
               IF   RECE859-SRYCD(1)  NOT =  SPACE
                   WRITE   RECE859-REC
                   ADD     1            TO   CNT-RECE859
               END-IF
           END-PERFORM
      *
           PERFORM 800-RECE82-SET849-SEC
           EVALUATE  RECE84-SRYKBN
             WHEN      "90"
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "5" OR "7")
                 COMPUTE RECE849-ZAINUM = 99994100 +  IDX32
               END-IF
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "6" OR "8")
                 COMPUTE RECE849-ZAINUM = 99994150 +  IDX32
               END-IF
             WHEN      "92"
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "5" OR "7")
                 COMPUTE RECE849-ZAINUM = 99994600 +  IDX32
               END-IF
               IF  (RECE84-FLG-CYOJKSN-COMMENT   =    "6" OR "8")
                 COMPUTE RECE849-ZAINUM = 99994650 +  IDX32
               END-IF
           END-EVALUATE
           MOVE    RECE84-SRYKBN       TO  RECE849-SRYKBN
           MOVE    "6"                 TO  RECE849-ZAISKBKBN
           MOVE    RECE84-PTNUM        TO  RECE849-PTNUM
           MOVE    RECE84-SRYKA        TO  RECE849-SRYKA
           MOVE    RECE84-HKNCOMBI     TO  RECE849-HKNCOMBI
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           WRITE   RECE849-REC
           ADD     1                   TO  CNT-RECE849
      *
           .
       20012-NYUKASAN-HENSYU3-EXT.
           EXIT.
      *
      *****************************************************************
      *    （レセ電用）
      *****************************************************************
       20012-NYUKASAN-HENSYU4-SEC          SECTION.
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    1                    TO  MAX-MEISAISU
      *
           MOVE  "810000001"   TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
           MOVE   ZERO         TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
           MOVE   19           TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
           MOVE  "排尿自立支援加算初回算定　　　月　　日"
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
           MOVE    WRK-HAIJSK-FSANTEIYM(5:2)  TO  DAY-IDX2
           MOVE    TBL-DAY(DAY-IDX2)
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(27:4)
           MOVE    WRK-HAIJSK-FSANTEIYM(7:2)  TO  DAY-IDX2
           MOVE    TBL-DAY(DAY-IDX2)
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(33:4)
           MOVE  "1"      TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           MOVE  "1"      TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
      *
           IF    WRK-HAIJSK-KAISU  <=  31
             COMPUTE  MAX-MEISAISU = MAX-MEISAISU + 1
      *
             MOVE  "810000001" TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
             MOVE   ZERO       TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
             MOVE   19         TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
             MOVE  "排尿自立支援加算通算実施回数（　　回）"
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
             MOVE    WRK-HAIJSK-KAISU  TO  DAY-IDX2
             MOVE    TBL-DAY(DAY-IDX2)
                          TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)(31:4)
             MOVE  "1"    TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
             MOVE  "1"    TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
           END-IF
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
               PERFORM 800-RECE82-SET859-SEC
               EVALUATE  RECE84-SRYKBN
                 WHEN      "90"
                   COMPUTE RECE859-ZAINUM =  99994211
                   MOVE    "900"            TO   RECE859-SRYSYUKBN
                 WHEN      "92"
                   COMPUTE RECE859-ZAINUM =  99994711
                   MOVE    "920"            TO   RECE859-SRYSYUKBN
               END-EVALUATE
               ADD     1                    TO   WRK-RENNUM
               MOVE    WRK-RENNUM           TO   RECE859-RENNUM
               MOVE    RECE84-PTNUM         TO   RECE859-PTNUM
               MOVE    RECE84-SRYKA         TO   RECE859-SRYKA
               MOVE    RECE84-SRYKBN        TO   RECE859-SRYKBN
               MOVE    ZERO                 TO   RECE859-JIHIMONEY
               PERFORM  VARYING   IDX   FROM   1   BY   1
                         UNTIL   (IDX       >    5)   OR
                                 (FLG-WRKRECE85   =   1)
                   ADD        1             TO    IDX-RECE85
                   IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                   OR (IDX-RECE85                       >  100 )
                       MOVE   1             TO    FLG-WRKRECE85
                   ELSE
                       MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                        TO   RECE859-SRYACT-TBL(IDX)
                       ADD   1          TO   WRK-CNT-MEISAI
                   END-IF
               END-PERFORM
               IF   RECE859-SRYCD(1)  NOT =  SPACE
                   WRITE   RECE859-REC
                   ADD     1            TO   CNT-RECE859
               END-IF
           END-PERFORM
      *
           PERFORM 800-RECE82-SET849-SEC
           EVALUATE  RECE84-SRYKBN
             WHEN      "90"
               COMPUTE RECE849-ZAINUM =  99994211
             WHEN      "92"
               COMPUTE RECE849-ZAINUM =  99994711
           END-EVALUATE
           MOVE    RECE84-SRYKBN       TO  RECE849-SRYKBN
           MOVE    "6"                 TO  RECE849-ZAISKBKBN
           MOVE    RECE84-PTNUM        TO  RECE849-PTNUM
           MOVE    RECE84-SRYKA        TO  RECE849-SRYKA
           MOVE    RECE84-HKNCOMBI     TO  RECE849-HKNCOMBI
      *
           MOVE    WRK-CNT-MEISAI      TO  RECE849-MEISAISU
      *
           WRITE   RECE849-REC
           ADD     1                   TO  CNT-RECE849
      *
           .
       20012-NYUKASAN-HENSYU4-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイル出力処理
      *****************************************************************
       2099-RECE84-WRITE-SEC      SECTION.
      *
           MOVE    RECE84-REC      TO  RECE849-REC
           PERFORM 800-RECE849-WRITE-SEC
      *
           PERFORM 20991-RECE85-TENSOU-SEC
           .
       2099-RECE84-WRITE-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト０５出力処理
      *****************************************************************
       20991-RECE85-TENSOU-SEC     SECTION.
      *
           PERFORM 800-RECE84-SET85-SEC
           MOVE    RECE84-ZAINUM       TO  RECE85-ZAINUM
           START   RECE85-FILE
               KEY IS    >=   RECE85-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE85
               NOT INVALID
                   PERFORM 990-RECE85-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE85           =   1                   )
               OR     ( RECE84-HOSPNUM   NOT =   RECE85-HOSPNUM      )
               OR     ( RECE84-SRYYM     NOT =   RECE85-SRYYM        )
               OR     ( RECE84-NYUGAIKBN NOT =   RECE85-NYUGAIKBN    )
               OR     ( RECE84-PTID      NOT =   RECE85-PTID         )
               OR     ( RECE84-RECEKA    NOT =   RECE85-RECEKA       )
               OR     ( RECE84-HKNID     NOT =   RECE85-HKNID        )
               OR     ( RECE84-TEKSTYMD  NOT =   RECE85-TEKSTYMD     )
               OR     ( RECE84-ZAINUM    NOT =   RECE85-ZAINUM       )
      *
      *
               MOVE          RECE85-REC       TO      RECE859-REC
               PERFORM 800-RECE859-WRITE-SEC
      *
               PERFORM 990-RECE85-NEXT-SEC
      *
           END-PERFORM
      *
           .
       20991-RECE85-TENSOU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　退避処理
      *****************************************************************
       200111-RECE85-TAIHI-SEC     SECTION.
      *
           PERFORM 800-RECE84-SET85-SEC
           MOVE    RECE84-ZAINUM       TO  RECE85-ZAINUM
           START   RECE85-FILE
                 KEY IS    >=   RECE85-KEY
                 INVALID
                     MOVE    1           TO  FLG-RECE85
                 NOT INVALID
                     PERFORM 990-RECE85-NEXT-SEC
                     MOVE    RECE85-REC  TO  WRK-RECE85-REC
           END-START
      *
           .
       200111-RECE85-TAIHI-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       200111-SRYACTINF-HENSYU-SEC     SECTION.
      *
           PERFORM
             UNTIL  ( FLG-RECE85           =   1                   )
             OR     ( RECE84-HOSPNUM   NOT =   RECE85-HOSPNUM      )
             OR     ( RECE84-SRYYM     NOT =   RECE85-SRYYM        )
             OR     ( RECE84-NYUGAIKBN NOT =   RECE85-NYUGAIKBN    )
             OR     ( RECE84-PTID      NOT =   RECE85-PTID         )
             OR     ( RECE84-RECEKA    NOT =   RECE85-RECEKA       )
             OR     ( RECE84-HKNID     NOT =   RECE85-HKNID        )
             OR     ( RECE84-TEKSTYMD  NOT =   RECE85-TEKSTYMD     )
             OR     ( RECE84-ZAINUM    NOT =   RECE85-ZAINUM       )
      *
             PERFORM   VARYING   IDX   FROM    1   BY  1
                       UNTIL   ( IDX               >   5     )
                       OR      ( RECE85-SRYCD(IDX) =   SPACE )
                  ADD    1             TO      IDX-RECE85
                  MOVE   RECE85-SRYACT-TBL(IDX)
                             TO   WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                  IF   RECE84-ZAITEN   =   ZERO
                     PERFORM   2001111-SRYACTINF-NAME-HEN-SEC
                  END-IF
                  IF  (RECE84-JIHOKBN  NOT =  SPACE)
                  AND (RECE84-ZAIKBN       =   4   )
                     MOVE  ZERO
                             TO   WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                  END-IF
             END-PERFORM 
      *
             PERFORM 990-RECE85-NEXT-SEC
      *
           END-PERFORM
      *
           IF     WRK-JIDO-JYOUGEFLG  =  1
             PERFORM   VARYING   IDX   FROM    1   BY  1
                       UNTIL   ( IDX                >   50    )
                       OR      ( WK-FREE-NAME2(IDX) =   SPACE )
                ADD    1                  TO  IDX-RECE85
                MOVE   "810000001"
                              TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                MOVE   ZERO   TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                              TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                MOVE   WK-FREE-NAME2(IDX)
                              TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
                MOVE   WK-FREE-MEISKYFLG2(IDX)
                          TO  WRK-RECE85XX-MEISKYFLG(IDX-RECE85 1)
                MOVE   WK-FREE-SETCOMATFLG2(IDX)
                          TO  WRK-RECE85XX-SETCOMATFLG(IDX-RECE85 1)
                MOVE   WK-FREE-RECEDENFLG2(IDX)
                          TO  WRK-RECE85XX-RECEDENFLG(IDX-RECE85 1)
                MOVE   "1"    TO  WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
                MOVE   "1"    TO  WRK-RECE85XX-RECEPTFLG(IDX-RECE85 1)
             END-PERFORM
           END-IF
      *
      *    手術日コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
      *
                  INITIALIZE                        RECE859-REC
                  MOVE    WRK-RECE85-KEY       TO   RECE859-KEY
                  ADD     1                    TO   WRK-RENNUM
                  MOVE    WRK-RENNUM           TO   RECE859-RENNUM
                  MOVE    WRK-RECE85-PTNUM     TO   RECE859-PTNUM
                  MOVE    WRK-RECE85-SRYKA     TO   RECE859-SRYKA
                  MOVE    WRK-RECE85-SRYKBN    TO   RECE859-SRYKBN
                  MOVE    WRK-RECE85-SRYSYUKBN TO   RECE859-SRYSYUKBN
                  MOVE    WRK-RECE85-JIHIMONEY TO   RECE859-JIHIMONEY
                  PERFORM  VARYING   IDX   FROM   1   BY   1
                           UNTIL   (IDX       >    5)   OR
                                   (FLG-WRKRECE85   =   1)
                     ADD         1             TO    IDX-RECE85
                     IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                     OR (IDX-RECE85                       >  100 )
                         MOVE    1             TO    FLG-WRKRECE85
                     ELSE
                         MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                          TO   RECE859-SRYACT-TBL(IDX)
      *
                         ADD    1    TO   WRK-CNT-MEISAI
      *
                     END-IF  
                  END-PERFORM
                  IF   RECE859-SRYCD(1)  NOT =  SPACE
                      PERFORM 800-RECE859-WRITE-SEC
                  END-IF
           END-PERFORM
      *
           MOVE    RECE84-REC        TO      RECE849-REC
           MOVE    WRK-CNT-MEISAI    TO      RECE849-MEISAISU
           EVALUATE  WRK-JIDO-SETCOMFLG
             WHEN      "1"
             WHEN      "4"
             WHEN      "5"
               MOVE      "1"         TO      RECE849-SETCOMFLG
             WHEN      "2"
               MOVE      "1"         TO      RECE849-SENTAKUCOMFLG
           END-EVALUATE
           IF  (RECE84-JIHOKBN  NOT =  SPACE)
           AND (RECE84-ZAIKBN       =   4   )
             MOVE  ZERO              TO      RECE849-ZAITEN
             MOVE  ZERO              TO      RECE849-SYUTEN1
             MOVE  ZERO              TO      RECE849-SYUTEN2
             MOVE  ZERO              TO      RECE849-YKZTEN
             MOVE  ZERO              TO      RECE849-KIZAITEN
             MOVE  ZERO              TO      RECE849-HOKATU-ZAITEN
             MOVE  ZERO              TO      RECE849-HOKATU-SYUTEN1
             MOVE  ZERO              TO      RECE849-HOKATU-SYUTEN2
             MOVE  ZERO              TO      RECE849-HOKATU-YKZTEN
             MOVE  ZERO              TO      RECE849-HOKATU-KIZAITEN
           END-IF
           PERFORM 800-RECE849-WRITE-SEC
      *
           .
       200111-SRYACTINF-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　ＳＲＹＡＣＴＩＮＦ　名称編集処理
      *****************************************************************
       2001111-SRYACTINF-NAME-HEN-SEC     SECTION.
      *
           IF    RECE82-SRYYM      >=    "201604"
             EVALUATE   WRK-RECE85XX-SRYCD(IDX-RECE85 1)
      *
               WHEN   "190111590"
                 MOVE  "810000001" TO  WRK-RECE85XX-SRYCD(IDX-RECE85 1)
                 MOVE   ZERO    TO  WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
                 MOVE   8       TO  WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
                 MOVE  "外泊（選定療養）"
                                TO  WRK-RECE85XX-NAME(IDX-RECE85 1)
             END-EVALUATE
           END-IF
      *
           .
       2001111-SRYACTINF-NAME-HEN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ０５　ＳＲＹＡＣＴＩＮＦ編集処理　まとめ
      *****************************************************************
       200111-SRYACTINF-HENSYU-MAT-SEC     SECTION.
      *
           PERFORM    200111-RECE85-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                TO  IDX-RECE85
           MOVE    SPACE               TO  WRK-RECE85XX-REC
           INITIALIZE                      WRK-RECE85XX-REC
      *
           MOVE    RECE84-MEISAISU     TO  MAX-MEISAISU
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                      UNTIL   (IDX                >   50   )
                        OR    (WK-FREE-NAME2(IDX) =   SPACE)
                COMPUTE  MAX-MEISAISU        =   MAX-MEISAISU  +  1
                IF  WK-FREE-SRYCD2(IDX) = SPACE
                  MOVE "810000001"
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                ELSE
                  MOVE WK-FREE-SRYCD2(IDX)
                             TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                END-IF
                MOVE   ZERO  TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                             TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                             TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                MOVE   WK-FREE-INPUTCOMENT2(IDX)
                          TO  WRK-RECE85XX-INPUTCOMENT(MAX-MEISAISU 1)
                MOVE   WK-FREE-MEISKYFLG2(IDX)
                          TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
                MOVE   WK-FREE-SETCOMATFLG2(IDX)
                          TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
                MOVE   WK-FREE-RECEDENFLG2(IDX)
                          TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
                MOVE    "1"  TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
           END-PERFORM
      *
           PERFORM    200111-SRYACTINF-HENSYU-SEC
      *
           .
       200111-SRYACTINF-HENSYU-MAT-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-JIDOSET-HENSYU-SEC     SECTION.
      *
           IF    WRK-JIDO-SETCOMATFLG  NOT = ZERO
             MOVE  "2"                   TO  WK-FREE-MEISKYFLG2(IDZ)
             MOVE  WRK-JIDO-SETCOMATFLG  TO  WK-FREE-SETCOMATFLG2(IDZ)
             MOVE  WRK-JIDO-RECEDENFLG   TO  WK-FREE-RECEDENFLG2(IDZ)
           END-IF
      *
           .
       200111-JIDOSET-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU-SEC     SECTION.
      *
           INITIALIZE                  ORCSRECECOMMENTAREA
           MOVE  WRK-RECECOM-AREA   TO ORCSRECECOMMENT-IN-AREA
           CALL  "ORCSRECECOMMENT"  USING  ORCSRECECOMMENTAREA
                                           SPA-AREA
           IF    LNK-RECECOMMENT-RC  =  ZERO
             ADD   1                         TO IDZ
             MOVE  LNK-RECECOMMENT-SRYCD     TO WK-FREE-SRYCD2(IDZ)
             MOVE  LNK-RECECOMMENT-NAME      TO WK-FREE-NAME2(IDZ)
             MOVE  LNK-RECECOMMENT-YUKOKETA  TO WK-FREE-YUKOKETA2(IDZ)
             MOVE  LNK-RECECOMMENT-INPUTCOMMENT
                                         TO  WK-FREE-INPUTCOMENT2(IDZ)
           END-IF
      *
           .
       200111-RECECOMMENT-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU2-SEC     SECTION.
      *
           INITIALIZE                  ORCSRECECOMMENTAREA
           MOVE  WRK-RECECOM-AREA   TO ORCSRECECOMMENT-IN-AREA
           CALL  "ORCSRECECOMMENT"  USING  ORCSRECECOMMENTAREA
                                           SPA-AREA
           IF    LNK-RECECOMMENT-RC  =  ZERO
             ADD   1         TO IDX-RECE85
             MOVE  LNK-RECECOMMENT-SRYCD
                             TO WRK-RECE85XX-SRYCD(IDX-RECE85 1)
             MOVE  ZERO      TO WRK-RECE85XX-SRYSURYO(IDX-RECE85 1)
             MOVE  LNK-RECECOMMENT-NAME
                             TO WRK-RECE85XX-NAME(IDX-RECE85 1)
             MOVE  LNK-RECECOMMENT-YUKOKETA
                             TO WRK-RECE85XX-YUKOKETA(IDX-RECE85 1)
             MOVE  LNK-RECECOMMENT-INPUTCOMMENT
                             TO WRK-RECE85XX-INPUTCOMENT(IDX-RECE85 1)
             MOVE  "1"       TO WRK-RECE85XX-SIKFLG(IDX-RECE85 1)
           END-IF
      *
           .
       200111-RECECOMMENT-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU3-SEC     SECTION.
      *
           ADD    1               TO IDZ
           MOVE  "840000099"      TO WK-FREE-SRYCD2(IDZ)
           MOVE  "検査日　　　日" TO WK-FREE-NAME2(IDZ)
           MOVE   7               TO WK-FREE-YUKOKETA2(IDZ)
      *
           INITIALIZE                         STS-AREA-DAY
           INITIALIZE                         LNK-DAY2-AREA
           MOVE    "21"                   TO  LNK-DAY2-IRAI
           MOVE    WRK-RECECOM-YMD        TO  LNK-DAY2-YMD
           CALL    "ORCSDAY"    USING     STS-AREA-DAY
                                          LNK-DAY2-AREA
           IF      STS-DAY-RC1            =   ZERO
              MOVE    LNK-DAY2-EDTYMD1-D  TO  WRK-TAIHI-XX
              INITIALIZE                       ORCSKANACHKAREA
              MOVE    "2"                 TO  KANACHK-SYORI
              MOVE    WRK-TAIHI-XX        TO  KANACHK-MAE-INPUT
              CALL    "ORCSKANACHK"    USING   ORCSKANACHKAREA
              IF      KANACHK-RC      =   ZERO
                 MOVE    KANACHK-OUT-INPUT(1:4)
                                  TO WK-FREE-NAME2(IDZ)(9:4)
                                     WK-FREE-INPUTCOMENT2(IDZ)(1:4)
              END-IF
              PERFORM  VARYING  IDX53  FROM  1  BY  2
                        UNTIL   IDX53    >   4
                 IF  WK-FREE-INPUTCOMENT2(IDZ)(IDX53:2) = "　"
                     MOVE  "０"   TO WK-FREE-INPUTCOMENT2(IDZ)(IDX53:2)
                 END-IF
              END-PERFORM
           END-IF
      *
           MOVE  "1"              TO WK-FREE-RECEDENFLG2(IDZ)
      *
           .
       200111-RECECOMMENT-HENSYU3-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-HENSYU4-SEC     SECTION.
      *
      *    「引き続き入院」
           MOVE  "820100129"    TO  WRK-TENSU-SRYCD
           MOVE  RECE82-SRYYM   TO  WRK-TENSU-SRYYM
           PERFORM 900-TENSU-TBL-SEC
      *
           ADD    1             TO  IDZ
           MOVE  TNS-SRYCD      TO  WK-FREE-SRYCD2(IDZ)
           MOVE  TNS-NAME       TO  WK-FREE-NAME2(IDZ)
                                    WK-FREE-INPUTCOMENT2(IDZ)
           MOVE  TNS-YUKOKETA   TO  WK-FREE-YUKOKETA2(IDZ)
           MOVE  "2"            TO  WK-FREE-MEISKYFLG2(IDZ)
      *#   MOVE   43            TO  WK-FREE-SETCOMATFLG2(IDZ)
           MOVE   1             TO  WK-FREE-SETCOMATFLG2(IDZ)
           MOVE  SPACE          TO  WK-FREE-RECEDENFLG2(IDZ)
      *
           .
       200111-RECECOMMENT-HENSYU4-EXT.
           EXIT.
      *
      *****************************************************************
      *    
      *****************************************************************
       200111-RECECOMMENT-IDXGET-SEC     SECTION.
      *
           EVALUATE   IDX-JIDO
             WHEN        1
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100002"   TO   WRK-RCW-SRYCD
             WHEN        5
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100089"   TO   WRK-RCW-SRYCD
             WHEN        6
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100090"   TO   WRK-RCW-SRYCD
             WHEN       17
      *******WHEN       18
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850190043"   TO   WRK-RCW-SRYCD
             WHEN      517
      *******WHEN      518
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190043"   TO   WRK-RCW-SRYCD
             WHEN       20
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100054"   TO   WRK-RCW-SRYCD
             WHEN       25
                MOVE   "2"           TO   WRK-RCW-KBN
                MOVE   "850100140"   TO   WRK-RCW-SRYCD
             WHEN       27
                MOVE   "2"           TO   WRK-RCW-KBN
                MOVE   "850100145"   TO   WRK-RCW-SRYCD
             WHEN       29
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100060"   TO   WRK-RCW-SRYCD
             WHEN       30
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100061"   TO   WRK-RCW-SRYCD
             WHEN       34
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100137"   TO   WRK-RCW-SRYCD
             WHEN       38
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850190006"   TO   WRK-RCW-SRYCD
             WHEN      538
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190006"   TO   WRK-RCW-SRYCD
             WHEN       39
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100129"   TO   WRK-RCW-SRYCD
             WHEN      539
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100043"   TO   WRK-RCW-SRYCD
             WHEN       57
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100142"   TO   WRK-RCW-SRYCD
             WHEN       60
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100286"   TO   WRK-RCW-SRYCD
             WHEN      560
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100061"   TO   WRK-RCW-SRYCD
             WHEN       61
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100272"   TO   WRK-RCW-SRYCD
             WHEN      561
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100056"   TO   WRK-RCW-SRYCD
             WHEN     1061
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100273"   TO   WRK-RCW-SRYCD
             WHEN       62
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100272"   TO   WRK-RCW-SRYCD
             WHEN      562
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100056"   TO   WRK-RCW-SRYCD
             WHEN       65
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100249"   TO   WRK-RCW-SRYCD
             WHEN       67
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100235"   TO   WRK-RCW-SRYCD
             WHEN      567
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100236"   TO   WRK-RCW-SRYCD
             WHEN       68
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100209"   TO   WRK-RCW-SRYCD
             WHEN      568
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100208"   TO   WRK-RCW-SRYCD
             WHEN       69
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100227"   TO   WRK-RCW-SRYCD
             WHEN      569
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100220"   TO   WRK-RCW-SRYCD
             WHEN       70
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100218"   TO   WRK-RCW-SRYCD
             WHEN      570
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100211"   TO   WRK-RCW-SRYCD
             WHEN     1070
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100389"   TO   WRK-RCW-SRYCD
             WHEN     1570
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100390"   TO   WRK-RCW-SRYCD
             WHEN     2070
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100439"   TO   WRK-RCW-SRYCD
             WHEN       71
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100224"   TO   WRK-RCW-SRYCD
             WHEN      571
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100217"   TO   WRK-RCW-SRYCD
             WHEN     1071
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100391"   TO   WRK-RCW-SRYCD
             WHEN     1571
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100392"   TO   WRK-RCW-SRYCD
             WHEN     2071
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100440"   TO   WRK-RCW-SRYCD
             WHEN       72
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100230"   TO   WRK-RCW-SRYCD
             WHEN      572
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100224"   TO   WRK-RCW-SRYCD
             WHEN       73
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100221"   TO   WRK-RCW-SRYCD
             WHEN      573
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100214"   TO   WRK-RCW-SRYCD
             WHEN       74
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100215"   TO   WRK-RCW-SRYCD
             WHEN      574
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100216"   TO   WRK-RCW-SRYCD
             WHEN     1074
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100217"   TO   WRK-RCW-SRYCD
             WHEN     1574
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100799"   TO   WRK-RCW-SRYCD
             WHEN       75
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100212"   TO   WRK-RCW-SRYCD
             WHEN      575
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100213"   TO   WRK-RCW-SRYCD
             WHEN     1075
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100214"   TO   WRK-RCW-SRYCD
             WHEN     1575
                MOVE   "3"           TO   WRK-RCW-KBN
                MOVE   "830100531"   TO   WRK-RCW-SRYCD
             WHEN       77
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100084"   TO   WRK-RCW-SRYCD
             WHEN       78
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100073"   TO   WRK-RCW-SRYCD
             WHEN       79
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100071"   TO   WRK-RCW-SRYCD
             WHEN       80
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100269"   TO   WRK-RCW-SRYCD
             WHEN       81
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100282"   TO   WRK-RCW-SRYCD
             WHEN       84
      *******WHEN       86
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100020"   TO   WRK-RCW-SRYCD
             WHEN       85
      *******WHEN       87
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100021"   TO   WRK-RCW-SRYCD
             WHEN       88
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100027"   TO   WRK-RCW-SRYCD
             WHEN      588
                MOVE   "4"           TO   WRK-RCW-KBN
                MOVE   "842100022"   TO   WRK-RCW-SRYCD
             WHEN      114
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100246"   TO   WRK-RCW-SRYCD
             WHEN      115
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100143"   TO   WRK-RCW-SRYCD
             WHEN      116
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100143"   TO   WRK-RCW-SRYCD
             WHEN      137
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100418"   TO   WRK-RCW-SRYCD
             WHEN      637
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190052"   TO   WRK-RCW-SRYCD
             WHEN      138
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100490"   TO   WRK-RCW-SRYCD
             WHEN      139
                MOVE   "5"           TO   WRK-RCW-KBN
                MOVE   "820190053"   TO   WRK-RCW-SRYCD
             WHEN      140
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100419"   TO   WRK-RCW-SRYCD
             WHEN      142
                MOVE   "1"           TO   WRK-RCW-KBN
                MOVE   "850100442"   TO   WRK-RCW-SRYCD
      *
             WHEN     OTHER
                MOVE   SPACE         TO   WRK-RCW-KBN
                MOVE   SPACE         TO   WRK-RCW-SRYCD
           END-EVALUATE
           MOVE        RECE82-SRYYM  TO   WRK-RCW-SRYYMD(1:6)
           MOVE        "01"          TO   WRK-RCW-SRYYMD(7:2)
      *
           INITIALIZE                     WRK-RECECOM-AREA
           MOVE   WRK-RCW-KBN        TO   WRK-RECECOM-KBN
           MOVE   WRK-RCW-SRYCD      TO   WRK-RECECOM-SRYCD
           MOVE   WRK-RCW-SRYYMD     TO   WRK-RECECOM-SRYYMD
      *
           .
       200111-RECECOMMENT-IDXGET-EXT.
           EXIT.
      *
      *****************************************************************
      *    差込編集２
      *****************************************************************
       250-SASHIKOMI2-SEC     SECTION.
      *
      *    パラメータ８４９ファイルより編集
           PERFORM 800-RECE82-SET849-SEC
      *@@@@
           MOVE    SPACE               TO  RECE849-SRYKBN
      *@@@@
           MOVE    ZERO                TO  RECE849-ZAINUM
      *
           START   RECE849-FILE
               KEY IS    >=   RECE849-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE849
               NOT INVALID
                   PERFORM 990-RECE849-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE849          =   1                    )
               OR     ( RECE82-HOSPNUM   NOT =   RECE849-HOSPNUM      )
               OR     ( RECE82-SRYYM     NOT =   RECE849-SRYYM        )
               OR     ( RECE82-NYUGAIKBN NOT =   RECE849-NYUGAIKBN    )
               OR     ( RECE82-PTID      NOT =   RECE849-PTID         )
               OR     ( RECE82-RECEKA    NOT =   RECE849-RECEKA       )
               OR     ( RECE82-HKNID     NOT =   RECE849-HKNID        )
               OR     ( RECE82-TEKSTYMD  NOT =   RECE849-TEKSTYMD     )
      *
               EVALUATE  RECE849-SRYKBN
                 WHEN      "90"
                 WHEN      "92"
                    IF    FLG-RYOCOM  =  ZERO
                       PERFORM       2599-RECE849-WRITE-SEC
                    ELSE
                       EVALUATE  RECE849-ZAISKBKBN
                         WHEN     "1"
                         WHEN     "2"
                           PERFORM   2502-RYOCOM-HANTEI-SEC
                         WHEN   OTHER
                           PERFORM   2599-RECE849-WRITE-SEC
                       END-EVALUATE
                    END-IF
                 WHEN      OTHER
                    MOVE   ZERO   TO  FLG-COMMENT
      *             （酸素計算式のコメントのセット）
                    IF   FLG-COMMENT  =  ZERO
                        PERFORM   2501-SANSO-HANTEI-SEC
                    END-IF
      *             （フイルムのコメントのセット）
                    IF   FLG-COMMENT  =  ZERO
                        PERFORM   2503-FILM-HANTEI-SEC
                    END-IF
                    IF   FLG-COMMENT  =  ZERO
                        PERFORM   2599-RECE849-WRITE-SEC
                    END-IF
               END-EVALUATE
      *
               PERFORM 990-RECE849-NEXT-SEC
      *
           END-PERFORM
      *
           .
       250-SASHIKOMI2-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素があるか判定
      *****************************************************************
       2501-SANSO-HANTEI-SEC          SECTION.
      *
           IF     RECE849-FLG-SANSO-COMMENT   =    "1"
               MOVE       99      TO     FLG-COMMENT
      *
               PERFORM    25011-SANSO-TAIHI-SEC
      *
               PERFORM    25011-SANSO-COMMENT-SEC
      *
           END-IF
      *
           .
       2501-SANSO-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素の数量・単価退避
      *****************************************************************
       25011-SANSO-TAIHI-SEC          SECTION.
      *
           MOVE       ZERO    TO     IDX4
           INITIALIZE                TBL-SANSO-INF
      *
           PERFORM 800-RECE849-SET859-SEC
           MOVE    RECE849-ZAINUM       TO  RECE859-ZAINUM
           START   RECE859-FILE
               KEY IS    >=   RECE859-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE859
               NOT INVALID
                   PERFORM 990-RECE859-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE859           =   1                 )
               OR     ( RECE849-HOSPNUM   NOT =   RECE859-HOSPNUM   )
               OR     ( RECE849-SRYYM     NOT =   RECE859-SRYYM     )
               OR     ( RECE849-NYUGAIKBN NOT =   RECE859-NYUGAIKBN )
               OR     ( RECE849-PTID      NOT =   RECE859-PTID      )
               OR     ( RECE849-RECEKA    NOT =   RECE859-RECEKA    )
               OR     ( RECE849-HKNID     NOT =   RECE859-HKNID     )
               OR     ( RECE849-TEKSTYMD  NOT =   RECE859-TEKSTYMD  )
               OR     ( RECE849-ZAINUM    NOT =   RECE859-ZAINUM    )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                          UNTIL  ( IDX                >   5     )
                           OR    ( RECE859-SRYCD(IDX) =   SPACE )
      *
                  SET     TBL-SANSO    TO     1
                  SEARCH      TBL-SANSO-OCC   VARYING   TBL-SANSO
                       AT  END
                           MOVE    ZERO    TO   FLG-SANSO-OK
                       WHEN   RECE859-SRYCD(IDX) = TBL-SANSO-SRYCD
                                                       (TBL-SANSO)
                           MOVE    1       TO   FLG-SANSO-OK
                  END-SEARCH
                  IF      FLG-SANSO-OK        =    1
                     ADD      1             TO  IDX4
                     MOVE  RECE859-TEN(IDX) TO  TBL-SANSO-TEN(IDX4)
                     MOVE  RECE859-SRYSURYO(IDX)
                                            TO  TBL-SANSO-SRYSURYO
                                                             (IDX4)
                  END-IF
                  IF    RECE859-SRYCD(IDX) = "770030070"
                     IF   TBL-KASAN-SRYSURYO  =  ZERO
                        MOVE   RECE859-SRYSURYO(IDX)
                                     TO  TBL-KASAN-SRYSURYO
                     ELSE
                        COMPUTE   TBL-KASAN-SRYSURYO  =  
                                  TBL-KASAN-SRYSURYO  *  
                                  RECE859-SRYSURYO(IDX)  
                     END-IF
                  END-IF
      *
               END-PERFORM 
      *
               PERFORM 990-RECE859-NEXT-SEC
      *
           END-PERFORM
      *
           .
       25011-SANSO-TAIHI-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素のコメント編集（差込：下）
      *****************************************************************
       25011-SANSO-COMMENT-SEC          SECTION.
      *
           MOVE       ZERO       TO   IDZ                               
           INITIALIZE            WRK-FREE-AREA2                         
           INITIALIZE            WRK-FREE-AREA3
      *
           PERFORM   250111-SANSO-FREE-COMMENT-SEC
      *
           PERFORM   250111-RECE859-TAIHI-SEC
      *
      *    ＲＥＣＥ８５９ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
           MOVE    ZERO                 TO  WRK-JYUNBAN
                                            WRK-GYOSUU
                                            WRK-GYOSUU2
      *
           PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   50    )
                         OR      ( WK-FREE-NAME2(IDX) =   SPACE )
      *
                ADD       1      TO     WRK-GYOSUU
      *
           END-PERFORM 
      *
           PERFORM    250111-SRYACTINF2-HENSYU-SEC
      *
           .
       25011-SANSO-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素計算式編集
      *****************************************************************
       250111-SANSO-FREE-COMMENT-SEC          SECTION.                 
      *
           MOVE     1          TO    WRK-KETA
           MOVE    ZERO        TO    WRK-KEISAN4
      *
           PERFORM   VARYING   IDX    FROM   1   BY   1
                      UNTIL   (IDX                 >    10)
                       OR     (TBL-SANSO-TEN(IDX)  =  ZERO)
      *
             IF   IDX  >  1
                MOVE    "＋"   TO  WK-FREE-NAME3(WRK-KETA:2)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  2
             END-IF
      *
             MOVE    "（"   TO  WK-FREE-NAME3(WRK-KETA:2)
             COMPUTE  WRK-KETA   =  WRK-KETA   +  2
      *単価
             MOVE     TBL-SANSO-TEN(IDX)   TO   WRK-KEISAN
             COMPUTE  WRK-KEISAN2  = (TBL-SANSO-TEN(IDX) -  WRK-KEISAN)
                                   *   1000
      *
             PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
             MOVE    "円×" TO  WK-FREE-NAME3(WRK-KETA:4)
             COMPUTE  WRK-KETA   =  WRK-KETA   +  4
      *数量
             MOVE     TBL-SANSO-SRYSURYO(IDX)  TO  WRK-KEISAN
             COMPUTE  WRK-KEISAN2  
                             = (TBL-SANSO-SRYSURYO(IDX) -  WRK-KEISAN)
                             *   1000
      *
             PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
             IF    TBL-KASAN-SRYSURYO  =  ZERO
                MOVE    "Ｌ×１．３）" TO  WK-FREE-NAME3(WRK-KETA:12)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  12
      *
      ***       COMPUTE  WRK-KEISAN3   =   WRK-KEISAN3  +
      ***         (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3)
                COMPUTE  WRK-KEISAN3   =
                  (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3)
                                                                + 0.5
                COMPUTE  WRK-KEISAN4  = WRK-KEISAN4 + WRK-KEISAN3
             ELSE
                MOVE    "Ｌ×１．３×" TO  WK-FREE-NAME3(WRK-KETA:12)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  12
      *
                MOVE     TBL-KASAN-SRYSURYO  TO  WRK-KEISAN
                COMPUTE  WRK-KEISAN2  
                             = (TBL-KASAN-SRYSURYO -  WRK-KEISAN)
                             *   1000
      *
                PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
                MOVE    "）" TO  WK-FREE-NAME3(WRK-KETA:2)
                COMPUTE  WRK-KETA   =  WRK-KETA   +  2
      *
      ***       COMPUTE  WRK-KEISAN3   =   WRK-KEISAN3  +
      ***         (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3
      ***                             * TBL-KASAN-SRYSURYO)
                COMPUTE  WRK-KEISAN3   =
                  (TBL-SANSO-TEN(IDX) * TBL-SANSO-SRYSURYO(IDX) * 1.3
                                      * TBL-KASAN-SRYSURYO)     + 0.5
                COMPUTE  WRK-KEISAN4  = WRK-KEISAN4 + WRK-KEISAN3
             END-IF
      *
           END-PERFORM
      *
           IF   IDX  =  2
              MOVE    "÷１０＝"  TO  WK-FREE-NAME3(WRK-KETA:8)
              COMPUTE  WRK-KETA   =  WRK-KETA   +  8
      *
      ***     COMPUTE  WRK-KEISAN =   WRK-KEISAN3  +  0.5
      ***     COMPUTE  WRK-KEISAN =  (WRK-KEISAN   /  10)  +  0.5
              COMPUTE  WRK-KEISAN =  (WRK-KEISAN4  /  10)  +  0.5
              MOVE     ZERO       TO   WRK-KEISAN2
      *
              PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
              MOVE    "点"   TO  WK-FREE-NAME3(WRK-KETA:2)
              COMPUTE  WRK-KETA   =  WRK-KETA   +  2
           ELSE
              IF   IDX  >  2
                  MOVE   WK-FREE-NAME3  TO  WK-FREE-NAME3-TAIHI
                  MOVE    "（"    TO   WK-FREE-NAME3(1:2)
                  MOVE   WK-FREE-NAME3-TAIHI
                                  TO   WK-FREE-NAME3(3:)
                  COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                  MOVE    "）÷１０＝"  TO  WK-FREE-NAME3(WRK-KETA:10)
                  COMPUTE  WRK-KETA   =  WRK-KETA   +  10
      *
      ***         COMPUTE  WRK-KEISAN =   WRK-KEISAN3  +  0.5
      ***         COMPUTE  WRK-KEISAN =  (WRK-KEISAN   /  10)  +  0.5
                  COMPUTE  WRK-KEISAN =  (WRK-KEISAN4  /  10)  +  0.5
                  MOVE     ZERO       TO   WRK-KEISAN2
      *
                  PERFORM  2501111-SANSO-FREE-COM-NUM-SEC
      *
                  MOVE    "点"   TO  WK-FREE-NAME3(WRK-KETA:2)
                  COMPUTE  WRK-KETA   =  WRK-KETA   +  2
              END-IF
           END-IF
      *
           IF     WRK-KETA    >   1
               PERFORM   VARYING   IDX4    FROM   1   BY   50
                          UNTIL   (IDX4     >    1000)
                            OR    (WK-FREE-NAME3(IDX4:1) = SPACE)
                   ADD     1      TO    IDZ
                   MOVE    ZERO   TO    WRK-KETA2
                   PERFORM   VARYING   IDX5    FROM   1   BY   2
                              UNTIL   (IDX5     >    50)
                      IF   WK-FREE-NAME3(IDX5:2)    = SPACE
                          MOVE   IDX5   TO   WRK-KETA2
                          MOVE   50     TO   IDX5
                      END-IF
                   END-PERFORM
                   IF   WRK-KETA2 =  ZERO
                        MOVE   25   TO  WK-FREE-YUKOKETA2(IDZ)
                   ELSE
                        COMPUTE   WK-FREE-YUKOKETA2(IDZ)  =
                                       ( WRK-KETA2 - 1 )  /  2
                   END-IF
                   MOVE   WK-FREE-NAME3(IDX4:50)
                                   TO    WK-FREE-NAME2(IDZ)
               END-PERFORM
           END-IF
      *
           .
       250111-SANSO-FREE-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    酸素計算式・数値編集
      *****************************************************************
       2501111-SANSO-FREE-COM-NUM-SEC          SECTION.          
      *
           IF    WRK-KEISAN  NOT  =  ZERO
               PERFORM   VARYING   IDX4    FROM   1   BY   1
                          UNTIL   (IDX4               >    9)
                     IF   WRK-KEISAN(IDX4:1) =   "0"
                        CONTINUE
                     ELSE
                        MOVE  IDX4   TO  IDX5
                        MOVE   9     TO  IDX4
                     END-IF
               END-PERFORM
               MOVE  SPACE             TO  WRK-KEISAN-TAIHI
               MOVE  WRK-KEISAN(IDX5:) TO  WRK-KEISAN-TAIHI
               INITIALIZE                  ORCSKANACHKAREA
               MOVE    "2"             TO  KANACHK-SYORI
               MOVE  WRK-KEISAN-TAIHI  TO  KANACHK-MAE-INPUT
               CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
               IF      KANACHK-RC      =   ZERO
                   MOVE    KANACHK-OUT-INPUT(1:KANACHK-MAX)
                               TO  WK-FREE-NAME3(WRK-KETA:KANACHK-MAX)
                   COMPUTE  WRK-KETA   =  WRK-KETA   +  KANACHK-MAX
               END-IF
           END-IF
      *
           IF    WRK-KEISAN2  NOT  =  ZERO
                PERFORM   VARYING   IDX4    FROM   3   BY  -1
                           UNTIL   (IDX4               <    1)
                      IF   WRK-KEISAN2(IDX4:1) =   "0"
                         CONTINUE
                      ELSE
                         MOVE  IDX4   TO  IDX5
                         MOVE   1     TO  IDX4
                      END-IF
                END-PERFORM
                MOVE  SPACE               TO  WRK-KEISAN-TAIHI
                MOVE  WRK-KEISAN2(1:IDX5) TO  WRK-KEISAN-TAIHI
      *
                IF    WRK-KEISAN  NOT  =  ZERO
                   MOVE    "．"     TO  WK-FREE-NAME3(WRK-KETA:2)
                   COMPUTE  WRK-KETA   =  WRK-KETA   +  2
                ELSE
                   MOVE    "０．"   TO  WK-FREE-NAME3(WRK-KETA:4)
                   COMPUTE  WRK-KETA   =  WRK-KETA   +  4
                END-IF
      *
                INITIALIZE                  ORCSKANACHKAREA
                MOVE    "2"             TO  KANACHK-SYORI
                MOVE  WRK-KEISAN-TAIHI  TO  KANACHK-MAE-INPUT
                CALL  "ORCSKANACHK"   USING   ORCSKANACHKAREA
                IF      KANACHK-RC      =   ZERO
                    MOVE    KANACHK-OUT-INPUT(1:KANACHK-MAX)
                                TO  WK-FREE-NAME3(WRK-KETA:KANACHK-MAX)
                    COMPUTE  WRK-KETA   =  WRK-KETA   +  KANACHK-MAX
                END-IF
           END-IF
      *
           IF    WRK-KEISAN    =  ZERO
           AND   WRK-KEISAN2   =  ZERO
               MOVE    "０"   TO  WK-FREE-NAME3(WRK-KETA:2)
               COMPUTE  WRK-KETA   =  WRK-KETA   +  2
           END-IF
      *
           .
       2501111-SANSO-FREE-COM-NUM-EXT.
           EXIT.
      *
      *****************************************************************
      *    ８５９　退避処理
      *****************************************************************
       250111-RECE859-TAIHI-SEC     SECTION.
      *
           PERFORM 800-RECE849-SET859-SEC
           MOVE    RECE849-ZAINUM       TO  RECE859-ZAINUM
           START   RECE859-FILE
                 KEY IS    >=   RECE859-KEY
                 INVALID
                     MOVE    1          TO  FLG-RECE859
                 NOT INVALID
                     PERFORM 990-RECE859-NEXT-SEC
                     MOVE   RECE859-REC TO  WRK-RECE85-REC
           END-START
      *
           .
       250111-RECE859-TAIHI-EXT.
           EXIT.
      *
      *****************************************************************
      *    ８５９　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       250111-SRYACTINF2-HENSYU-SEC     SECTION.
      *
           PERFORM
             UNTIL  ( FLG-RECE859           =   1                    )
             OR     ( RECE849-HOSPNUM   NOT =   RECE859-HOSPNUM      )
             OR     ( RECE849-SRYYM     NOT =   RECE859-SRYYM        )
             OR     ( RECE849-NYUGAIKBN NOT =   RECE859-NYUGAIKBN    )
             OR     ( RECE849-PTID      NOT =   RECE859-PTID         )
             OR     ( RECE849-RECEKA    NOT =   RECE859-RECEKA       )
             OR     ( RECE849-HKNID     NOT =   RECE859-HKNID        )
             OR     ( RECE849-TEKSTYMD  NOT =   RECE859-TEKSTYMD     )
             OR     ( RECE849-ZAINUM    NOT =   RECE859-ZAINUM       )
      *
             PERFORM   VARYING   IDX   FROM    1   BY  1
                       UNTIL   ( IDX                >   5     )
                       OR      ( RECE859-SRYCD(IDX) =   SPACE )
                  ADD    1             TO      IDX-RECE85
                  MOVE   RECE859-SRYACT-TBL(IDX)
                             TO   WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
      *
                  IF   RECE859-SRYCD(IDX) = "770020070" OR "770030070"
                       MOVE   IDX-RECE85   TO   WRK-JYUNBAN
                  END-IF
      *
             END-PERFORM 
      *
             PERFORM 990-RECE859-NEXT-SEC
      *
           END-PERFORM
      *
           IF     WRK-GYOSUU   NOT =  ZERO
      *
      *      補正率又は高気圧酸素加算以降の明細をずらす
             IF   WRK-JYUNBAN  NOT =  ZERO
      *
               PERFORM   VARYING   IDX   FROM   IDX-RECE85   BY  -1
                          UNTIL  ( IDX    <    1           )
                           OR    ( IDX    <=   WRK-JYUNBAN )
      *
                   COMPUTE   WRK-GYOSUU2  =  IDX  +  WRK-GYOSUU
                   MOVE   WRK-RECE85XX-SRYACT-TBL(IDX 1)  TO
                          WRK-RECE85XX-SRYACT-TBL(WRK-GYOSUU2 1)
                   INITIALIZE   WRK-RECE85XX-SRYACT-TBL(IDX 1)
      *
               END-PERFORM
      *
             END-IF
      *
      *      計算式の差し込み
             IF   WRK-JYUNBAN  NOT =  ZERO
                 MOVE      WRK-JYUNBAN    TO     MAX-MEISAISU
             ELSE
                 MOVE      IDX-RECE85     TO     MAX-MEISAISU
             END-IF
             PERFORM   VARYING   IDX   FROM    1   BY  1
                        UNTIL  ( IDX                >   50    )
                         OR    ( WK-FREE-NAME2(IDX) =   SPACE )
      *
                ADD    1      TO  MAX-MEISAISU
                MOVE   "810000001"
                              TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
                MOVE   ZERO   TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
                MOVE   WK-FREE-YUKOKETA2(IDX)
                              TO  WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1)
                MOVE   WK-FREE-NAME2(IDX)
                              TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
                MOVE    "1"   TO
                              WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
                MOVE    "1"   TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
             END-PERFORM
      *
           END-IF
      *
      *    手術日コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
      *
                  INITIALIZE                        RECE851-REC
                  MOVE    WRK-RECE85-KEY       TO   RECE851-KEY
                  ADD     1                    TO   WRK-RENNUM
                  MOVE    WRK-RENNUM           TO   RECE851-RENNUM
                  MOVE    WRK-RECE85-PTNUM     TO   RECE851-PTNUM
                  MOVE    WRK-RECE85-SRYKA     TO   RECE851-SRYKA
                  MOVE    WRK-RECE85-SRYKBN    TO   RECE851-SRYKBN
                  MOVE    WRK-RECE85-SRYSYUKBN TO   RECE851-SRYSYUKBN
                  MOVE    WRK-RECE85-JIHIMONEY TO   RECE851-JIHIMONEY
                  PERFORM  VARYING   IDX   FROM   1   BY   1
                           UNTIL   (IDX       >    5)   OR
                                   (FLG-WRKRECE85   =   1)
                     ADD         1             TO    IDX-RECE85
                     IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                     OR (IDX-RECE85                       >  100 )
                         MOVE    1             TO    FLG-WRKRECE85
                     ELSE
                         MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                          TO   RECE851-SRYACT-TBL(IDX)
      *
                         ADD    1    TO   WRK-CNT-MEISAI
      *
                     END-IF  
                  END-PERFORM
                  IF   RECE851-SRYCD(1)  NOT =  SPACE
                       PERFORM 800-RECE851-WRITE-SEC
                  END-IF
           END-PERFORM
      *
           INITIALIZE                      RECE841-REC
           MOVE    RECE849-KEY1        TO  RECE841-KEY1
           MOVE    RECE849-ZAINUM      TO  RECE841-ZAINUM
           MOVE    RECE849-SRYKBN      TO  RECE841-SRYKBN
           MOVE    RECE849-DATA-AREA   TO  RECE841-DATA-AREA
           MOVE    WRK-CNT-MEISAI      TO  RECE841-MEISAISU
           PERFORM 800-RECE841-WRITE-SEC
      *
           .
       250111-SRYACTINF2-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメントがあるか判定
      *****************************************************************
       2502-RYOCOM-HANTEI-SEC          SECTION.
      *
           MOVE     ZERO     TO     FLG-RYOCOM2
           INITIALIZE               TBL-RYOCOM2-INF
      *
           PERFORM  VARYING  RYO-IDX  FROM  1  BY  1
                     UNTIL   RYO-IDX   >   31
      *
               IF    (RECE849-KAISU(1 RYO-IDX)   NOT =  ZERO)
               AND   (TBL-RYOCOM-NYUINKBN(RYO-IDX)   =  "1" )
      *
                  MOVE     ZERO     TO    FLG-ARI
                  PERFORM  VARYING  RYO-IDX3  FROM  1  BY  1
                            UNTIL  (RYO-IDX3   >   31)
                             OR    (TBL-RYOCOM2-MEISAISU(RYO-IDX3)
                                               = ZERO)
                             OR    (FLG-ARI    =    1)
                   IF   RECE82-SRYYM  >=  "201004"
                     IF  (TBL-RYOCOM2-MEISAISU  (RYO-IDX3) =
                                    TBL-RYOCOM-MEISAISU  (RYO-IDX))
                     AND (TBL-RYOCOM2-SRYCDTOTAL(RYO-IDX3) =
                                    TBL-RYOCOM-SRYCDTOTAL(RYO-IDX))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 1) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 1))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 2) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 2))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 3) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 3))
                     AND (TBL-RYOCOM2-ADL-TEN-H22(RYO-IDX3 4) =
                                 TBL-RYOCOM-ADL-TEN-H22(RYO-IDX 4))
                        MOVE   1   TO  TBL-RYOCOM2-DAY(RYO-IDX3 RYO-IDX)
                        MOVE   1   TO  FLG-ARI
                     END-IF
                   ELSE
                     IF  (TBL-RYOCOM2-MEISAISU  (RYO-IDX3) =
                                    TBL-RYOCOM-MEISAISU  (RYO-IDX))
                     AND (TBL-RYOCOM2-SRYCDTOTAL(RYO-IDX3) =
                                    TBL-RYOCOM-SRYCDTOTAL(RYO-IDX))
                     AND (TBL-RYOCOM2-ADL-TEN   (RYO-IDX3) =
                                    TBL-RYOCOM-ADL-TEN   (RYO-IDX))
                        MOVE   1   TO  TBL-RYOCOM2-DAY(RYO-IDX3 RYO-IDX)
                        MOVE   1   TO  FLG-ARI
                     END-IF
                   END-IF
                  END-PERFORM
                  IF  FLG-ARI  =  ZERO
                     MOVE  TBL-RYOCOM-AREA(RYO-IDX)
                               TO  TBL-RYOCOM2-AREA(RYO-IDX3)
                     MOVE  1   TO  TBL-RYOCOM2-DAY (RYO-IDX3 RYO-IDX)
                  END-IF
      *
                  MOVE      1      TO     FLG-RYOCOM2
      *
               END-IF
      *
           END-PERFORM
      *
           IF  FLG-RYOCOM2   =   ZERO
              PERFORM   2599-RECE849-WRITE-SEC
           ELSE
            IF   RECE82-SRYYM  >=  "201004"
              PERFORM   25021-RYOCOM-HENSYU-H22-SEC
            ELSE
              PERFORM   25021-RYOCOM-HENSYU-SEC
            END-IF
           END-IF
      *
           .
       2502-RYOCOM-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメント編集（平成２２年４月診療以降）
      *****************************************************************
       25021-RYOCOM-HENSYU-H22-SEC          SECTION.
      *
           PERFORM  250111-RECE859-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX2-REC
           INITIALIZE                       WRK-RECE85XX2-REC
      *
           MOVE    RECE849-MEISAISU     TO  MAX-MEISAISU
      *
      *
           PERFORM  VARYING  RYO-IDX3  FROM  1  BY  1
                     UNTIL  (RYO-IDX3   >   31                    )
                      OR    (TBL-RYOCOM2-MEISAISU(RYO-IDX3) = ZERO)
      *
              INITIALIZE                TBL-NYU-DAY
      *
              MOVE    ZERO          TO  DAY-IDX
              MOVE    ZERO          TO  FLG-NYU-RENZOKU
      *
              PERFORM    VARYING    IDX  FROM   1   BY   1
                          UNTIL    (IDX      >   31)  OR
                                   (DAY-IDX  >   31)
                IF    TBL-RYOCOM2-DAY(RYO-IDX3 IDX)   =  ZERO
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                ELSE
                      IF    FLG-NYU-RENZOKU  =  ZERO
                         ADD   1     TO  DAY-IDX
                         MOVE  IDX   TO  TBL-NYU-DAY-ST(DAY-IDX)
                      END-IF
                      MOVE  IDX      TO  TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  1        TO  FLG-NYU-RENZOKU
                END-IF
              END-PERFORM
      *
      ***     PERFORM  VARYING  DAY-IDX  FROM   1   BY   1
      ***               UNTIL  (DAY-IDX                  >   31)
      ***                OR    (TBL-NYU-DAY-ST(DAY-IDX)  = ZERO)
      ***       IF    TBL-NYU-DAY-ST(DAY-IDX) 
      ***                           =   TBL-NYU-DAY-ED(DAY-IDX)
      ***             MOVE  "840000059"
      ***                           TO  TBL-NYU-DAY-CD(DAY-IDX)
      ***       ELSE
      ***             MOVE  "810000001"
      ***                           TO  TBL-NYU-DAY-CD(DAY-IDX)
      ***       END-IF
      ***     END-PERFORM
      *
      *       算定日コメントの挿入
              PERFORM  VARYING   IDX    FROM  1   BY   1
                        UNTIL   (IDX                  >    31)
                         OR     (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU   =   MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                 MOVE  "810000001"
                             TO  WRK-RECE85XX2-SRYCD(MAX-MEISAISU 1)
                 MOVE   ZERO TO  WRK-RECE85XX2-SRYSURYO(MAX-MEISAISU 1)
      ***        IF    TBL-NYU-DAY-CD(IDX)  =  "840000059"
      ***          MOVE   16 TO  WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
      ***          MOVE   "療養病棟入院期間　　　日〜　　日"
      ***                  TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
      ***          MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
      ***          MOVE   TBL-DAY(DAY-IDX2)
      ***                  TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(19:4)
      ***          MOVE   TBL-NYU-DAY-ED(IDX) TO  DAY-IDX2
      ***          MOVE   TBL-DAY(DAY-IDX2)
      ***                  TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(27:4)
      ***        ELSE
                   MOVE   16 TO  WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                   EVALUATE RECE82-HOSPSBT
                     WHEN    "1"
                     WHEN    "3"
                       MOVE   "療養病棟入院期間　　　日〜　　日"
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                     WHEN    "2"
                     WHEN    "4"
                       MOVE   "療養病床入院期間　　　日〜　　日"
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                   END-EVALUATE
                   MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(19:4)
                   MOVE   TBL-NYU-DAY-ED(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(27:4)
      ***        END-IF
                 MOVE  "1" TO  WRK-RECE85XX2-RECEDENFLG(MAX-MEISAISU 1)
                 MOVE  "1" TO  WRK-RECE85XX2-SIKFLG(MAX-MEISAISU 1)
               END-IF
              END-PERFORM
      *
              PERFORM  VARYING  IDX  FROM   1   BY   1
                  UNTIL  (IDX                                  >  30  )
                   OR    (TBL-RYOCOM2-IRYO-SRYCD(RYO-IDX3 IDX) = SPACE)
      *
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                   MOVE "810000001"
                              TO WRK-RECE85XX2-SRYCD(MAX-MEISAISU 1)
                   MOVE  ZERO TO WRK-RECE85XX2-SRYSURYO(MAX-MEISAISU 1)
                   MOVE  4    TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                   MOVE  "1"  TO WRK-RECE85XX2-SIKFLG(MAX-MEISAISU 1)
                   PERFORM       250212-RYOCOM-NAME-HENSYU-SEC
                   MOVE  "1"  TO
                               WRK-RECE85XX2-RECEDENFLG(MAX-MEISAISU 1)
               END-IF
      *
              END-PERFORM
      *
              PERFORM  VARYING  IDX  FROM   1   BY   1
                UNTIL (IDX   >   4)
      *
                IF  TBL-RYOCOM2-ADL-SRYCD-H22(RYO-IDX3 IDX) NOT = SPACE
                  COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
                  IF  MAX-MEISAISU <= 300
                    MOVE   "810000001"
                             TO WRK-RECE85XX2-SRYCD(MAX-MEISAISU 1)
                    MOVE   ZERO
                             TO WRK-RECE85XX2-SRYSURYO(MAX-MEISAISU 1)
                    EVALUATE  IDX
                      WHEN     1
                        MOVE 17
                           TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬａ　ベッド上の可動性　　　点"
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(29:4)
                      WHEN     2
                        MOVE 11
                           TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬｂ　移乗　　　点"
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(17:4)
                      WHEN     3
                        MOVE 11
                           TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬｃ　食事　　　点"
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(17:4)
                      WHEN     4
                        MOVE 15
                           TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                        MOVE "ＡＤＬｄ　トイレの使用　　　点"
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                        MOVE TBL-RYOCOM2-ADL-TEN-MOJI-H22(RYO-IDX3 IDX)
                           TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(25:4)
                    END-EVALUATE
                    MOVE "1" TO WRK-RECE85XX2-RECEDENFLG(MAX-MEISAISU 1)
                    MOVE "1" TO WRK-RECE85XX2-SIKFLG(MAX-MEISAISU 1)
                  END-IF
                END-IF
      *
              END-PERFORM
      *
           END-PERFORM
      *
      *
           PERFORM    250211-SRYACTINF3-HENSYU-SEC
      *
           .
       25021-RYOCOM-HENSYU-H22-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメント編集
      *****************************************************************
       25021-RYOCOM-HENSYU-SEC          SECTION.
      *
           PERFORM  250111-RECE859-TAIHI-SEC
      *
      *    ＲＥＣＥ０５ファイルの内容をテーブルに退避
           MOVE    ZERO                 TO  IDX-RECE85
           MOVE    SPACE                TO  WRK-RECE85XX2-REC
           INITIALIZE                       WRK-RECE85XX2-REC
      *
           MOVE    RECE849-MEISAISU     TO  MAX-MEISAISU
      *
      *
           PERFORM  VARYING  RYO-IDX3  FROM  1  BY  1
                     UNTIL  (RYO-IDX3   >   31                    )
                      OR    (TBL-RYOCOM2-MEISAISU(RYO-IDX3) = ZERO)
      *
              INITIALIZE                TBL-NYU-DAY
      *
              MOVE    ZERO          TO  DAY-IDX
              MOVE    ZERO          TO  FLG-NYU-RENZOKU
      *
              PERFORM    VARYING    IDX  FROM   1   BY   1
                          UNTIL    (IDX      >   31)  OR
                                   (DAY-IDX  >   31)
                IF    TBL-RYOCOM2-DAY(RYO-IDX3 IDX)   =  ZERO
                      MOVE  ZERO  TO  FLG-NYU-RENZOKU
                ELSE
                      IF    FLG-NYU-RENZOKU  =  ZERO
                         ADD   1     TO  DAY-IDX
                         MOVE  IDX   TO  TBL-NYU-DAY-ST(DAY-IDX)
                      END-IF
                      MOVE  IDX      TO  TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  1        TO  FLG-NYU-RENZOKU
                END-IF
              END-PERFORM
      *
              PERFORM  VARYING  DAY-IDX  FROM   1   BY   1
                        UNTIL  (DAY-IDX                  >   31)
                         OR    (TBL-NYU-DAY-ST(DAY-IDX)  = ZERO)
                IF    TBL-NYU-DAY-ST(DAY-IDX) 
                                    =   TBL-NYU-DAY-ED(DAY-IDX)
                      MOVE  "840000059"
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                ELSE
                      MOVE  "810000001"
                                    TO  TBL-NYU-DAY-CD(DAY-IDX)
                END-IF
              END-PERFORM
      *
      *       算定日コメントの挿入
              PERFORM  VARYING   IDX    FROM  1   BY   1
                        UNTIL   (IDX                  >    31)
                         OR     (TBL-NYU-DAY-ST(IDX)  =  ZERO)
               COMPUTE  MAX-MEISAISU   =   MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                 MOVE  "810000001"
                             TO  WRK-RECE85XX2-SRYCD(MAX-MEISAISU 1)
                 MOVE   ZERO TO  WRK-RECE85XX2-SRYSURYO(MAX-MEISAISU 1)
                 IF    TBL-NYU-DAY-CD(IDX)  =  "840000059"
                   MOVE   6  TO  WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                   MOVE   "　　月　　日"
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                   MOVE   RECE82-SRYYM(5:2)   TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(1:4)
                   MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(7:4)
                 ELSE
                   MOVE   13 TO  WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                   MOVE   "　　月　　日〜　　月　　日"
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                   MOVE   RECE82-SRYYM(5:2)   TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(1:4)
                               WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(15:4)
                   MOVE   TBL-NYU-DAY-ST(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(7:4)
                   MOVE   TBL-NYU-DAY-ED(IDX) TO  DAY-IDX2
                   MOVE   TBL-DAY(DAY-IDX2)
                           TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(21:4)
                 END-IF
                 MOVE  "1" TO  WRK-RECE85XX2-RECEDENFLG(MAX-MEISAISU 1)
                 MOVE  "1" TO  WRK-RECE85XX2-SIKFLG(MAX-MEISAISU 1)
               END-IF
              END-PERFORM
      *
              PERFORM  VARYING  IDX  FROM   1   BY   1
                  UNTIL  (IDX                                  >  30  )
                   OR    (TBL-RYOCOM2-IRYO-SRYCD(RYO-IDX3 IDX) = SPACE)
      *
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                   MOVE "810000001"
                              TO WRK-RECE85XX2-SRYCD(MAX-MEISAISU 1)
                   MOVE  ZERO TO WRK-RECE85XX2-SRYSURYO(MAX-MEISAISU 1)
                   MOVE  4    TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                   MOVE  "1"  TO WRK-RECE85XX2-SIKFLG(MAX-MEISAISU 1)
                   PERFORM       250212-RYOCOM-NAME-HENSYU-SEC
                   MOVE  "1"  TO
                               WRK-RECE85XX2-RECEDENFLG(MAX-MEISAISU 1)
               END-IF
      *
              END-PERFORM
      *
              IF   TBL-RYOCOM2-ADL-SRYCD(RYO-IDX3)  NOT =  SPACE
               COMPUTE  MAX-MEISAISU  =  MAX-MEISAISU  +  1
               IF  MAX-MEISAISU <= 300
                MOVE   "810000001"
                             TO WRK-RECE85XX2-SRYCD(MAX-MEISAISU 1)
                MOVE   ZERO  TO WRK-RECE85XX2-SRYSURYO(MAX-MEISAISU 1)
                MOVE   7     TO WRK-RECE85XX2-YUKOKETA(MAX-MEISAISU 1)
                MOVE   "ＡＤＬ　　　点"
                             TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
                MOVE   TBL-RYOCOM2-ADL-TEN-MOJI(RYO-IDX3)
                             TO WRK-RECE85XX2-NAME(MAX-MEISAISU 1)(9:4)
                MOVE   "1"   TO WRK-RECE85XX2-RECEDENFLG(MAX-MEISAISU 1)
                MOVE   "1"   TO WRK-RECE85XX2-SIKFLG(MAX-MEISAISU 1)
               END-IF
              END-IF
      *
           END-PERFORM
      *
      *
           PERFORM    250211-SRYACTINF3-HENSYU-SEC
      *
           .
       25021-RYOCOM-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ８５９　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       250211-SRYACTINF3-HENSYU-SEC     SECTION.
      *
           PERFORM
             UNTIL  ( FLG-RECE859           =   1                    )
             OR     ( RECE849-HOSPNUM   NOT =   RECE859-HOSPNUM      )
             OR     ( RECE849-SRYYM     NOT =   RECE859-SRYYM        )
             OR     ( RECE849-NYUGAIKBN NOT =   RECE859-NYUGAIKBN    )
             OR     ( RECE849-PTID      NOT =   RECE859-PTID         )
             OR     ( RECE849-RECEKA    NOT =   RECE859-RECEKA       )
             OR     ( RECE849-HKNID     NOT =   RECE859-HKNID        )
             OR     ( RECE849-TEKSTYMD  NOT =   RECE859-TEKSTYMD     )
             OR     ( RECE849-ZAINUM    NOT =   RECE859-ZAINUM       )
      *
             PERFORM   VARYING   IDX   FROM    1   BY  1
                        UNTIL  ( IDX                >   5     )
                         OR    ( RECE859-SRYCD(IDX) =   SPACE )
                  ADD    1              TO      IDX-RECE85
                  MOVE   RECE859-SRYACT-TBL(IDX)
                           TO   WRK-RECE85XX2-SRYACT-TBL(IDX-RECE85 1)
             END-PERFORM
      *
             PERFORM 990-RECE859-NEXT-SEC
      *
           END-PERFORM
      *
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
      *
                  INITIALIZE                        RECE851-REC
                  MOVE    WRK-RECE85-KEY       TO   RECE851-KEY
                  ADD     1                    TO   WRK-RENNUM
                  MOVE    WRK-RENNUM           TO   RECE851-RENNUM
                  MOVE    WRK-RECE85-PTNUM     TO   RECE851-PTNUM
                  MOVE    WRK-RECE85-SRYKA     TO   RECE851-SRYKA
                  MOVE    WRK-RECE85-SRYKBN    TO   RECE851-SRYKBN
                  MOVE    WRK-RECE85-SRYSYUKBN TO   RECE851-SRYSYUKBN
                  MOVE    WRK-RECE85-JIHIMONEY TO   RECE851-JIHIMONEY
                  PERFORM  VARYING   IDX   FROM   1   BY   1
                            UNTIL   (IDX             >   5)
                             OR     (FLG-WRKRECE85   =   1)
                     ADD         1             TO    IDX-RECE85
                     IF (WRK-RECE85XX2-SRYCD(IDX-RECE85 1) = SPACE)
                     OR (IDX-RECE85                        >  300 )
                         MOVE    1             TO    FLG-WRKRECE85
                     ELSE
                         MOVE  WRK-RECE85XX2-SRYACT-TBL(IDX-RECE85 1)
                                         TO   RECE851-SRYACT-TBL(IDX)
                         ADD   1    TO   WRK-CNT-MEISAI
                     END-IF
                     IF   IDX-RECE85   >= 300
                         MOVE    1       TO   FLG-WRKRECE85
                     END-IF
                  END-PERFORM
                  IF   RECE851-SRYCD(1)  NOT =  SPACE
                     PERFORM 800-RECE851-WRITE-SEC
                  END-IF
           END-PERFORM
      *
           INITIALIZE                      RECE841-REC
           MOVE    RECE849-KEY1        TO  RECE841-KEY1
           MOVE    RECE849-ZAINUM      TO  RECE841-ZAINUM
           MOVE    RECE849-SRYKBN      TO  RECE841-SRYKBN
           MOVE    RECE849-DATA-AREA   TO  RECE841-DATA-AREA
           MOVE    WRK-CNT-MEISAI      TO  RECE841-MEISAISU
      *
           MOVE    RECE849-MEISAISU  TO      RECE841-RYOTENKISAISU
      *
           PERFORM 800-RECE841-WRITE-SEC
      *
           .
       250211-SRYACTINF3-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    療養病棟コメント名称編集
      *****************************************************************
       250212-RYOCOM-NAME-HENSYU-SEC     SECTION.
      *
           EVALUATE  TBL-RYOCOM2-IRYO-SRYCD(RYO-IDX3 IDX)
             WHEN      "820000057"
             WHEN      "820000096"
                MOVE "「０１」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000058"
             WHEN      "820000097"
                MOVE "「０２」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000059"
             WHEN      "820000098"
                MOVE "「０３」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000060"
             WHEN      "820000099"
                MOVE "「０４」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000061"
             WHEN      "820000100"
                MOVE "「０５」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000062"
             WHEN      "820000101"
                MOVE "「０６」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000063"
             WHEN      "820000102"
                MOVE "「０７」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000064"
             WHEN      "820000103"
                MOVE "「０８」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000065"
             WHEN      "820000104"
                MOVE "「０９」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000066"
             WHEN      "820000105"
                MOVE "「１０」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000067"
             WHEN      "820000106"
                MOVE "「１１」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000068"
             WHEN      "820000107"
                MOVE "「１２」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000069"
             WHEN      "820000108"
                MOVE "「１３」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000070"
             WHEN      "820000109"
                MOVE "「１４」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000071"
             WHEN      "820000110"
                MOVE "「１５」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000072"
             WHEN      "820000111"
                MOVE "「１６」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000073"
             WHEN      "820000112"
             WHEN      "820000229"
                MOVE "「１７」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000074"
             WHEN      "820000113"
                MOVE "「１８」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000075"
             WHEN      "820000114"
             WHEN      "820000230"
                MOVE "「１９」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000076"
             WHEN      "820000115"
                MOVE "「２０」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000077"
             WHEN      "820000116"
                MOVE "「２１」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000078"
             WHEN      "820000117"
                MOVE "「２２」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000079"
             WHEN      "820000118"
             WHEN      "820000231"
                MOVE "「２３」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000080"
             WHEN      "820000119"
                MOVE "「２４」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000081"
             WHEN      "820000120"
                MOVE "「２５」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000082"
             WHEN      "820000121"
                MOVE "「２６」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000083"
             WHEN      "820000122"
                MOVE "「２７」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000084"
             WHEN      "820000123"
                MOVE "「２８」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000085"
             WHEN      "820000124"
                MOVE "「２９」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000086"
             WHEN      "820000125"
                MOVE "「３０」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000087"
             WHEN      "820000126"
                MOVE "「３１」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000088"
             WHEN      "820000127"
                MOVE "「３２」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000089"
             WHEN      "820000128"
                MOVE "「３３」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000090"
             WHEN      "820000129"
                MOVE "「３４」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000091"
             WHEN      "820000130"
                MOVE "「３５」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000092"
             WHEN      "820000131"
                MOVE "「３６」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000093"
             WHEN      "820000132"
                MOVE "「３７」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000232"
                MOVE "「３８」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000158"
             WHEN      "820000160"
                MOVE "「９１」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
             WHEN      "820000159"
                MOVE "「９２」"
                       TO  WRK-RECE85XX2-NAME(MAX-MEISAISU 1)
           END-EVALUATE
      *
           .
       250212-RYOCOM-NAME-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    フイルムがあるか判定
      *****************************************************************
       2503-FILM-HANTEI-SEC          SECTION.
      *
           IF     RECE849-FLG-FILM-COMMENT   =    "1"
               MOVE       99      TO     FLG-COMMENT
               PERFORM    25031-FILM-COMMENT-SEC
           END-IF
      *
           .
       2503-FILM-HANTEI-EXT.
           EXIT.
      *
      *****************************************************************
      *    フイルムのコメント編集（差込：下）
      *****************************************************************
       25031-FILM-COMMENT-SEC          SECTION.
      *
           INITIALIZE                WRK-JIDO-SETCOM-AREA
           MOVE      "1"      TO     WRK-JIDO-SETCOMFLG
           MOVE       1       TO     WRK-JIDO-SETCOMATFLG
      *
           PERFORM  250111-RECE859-TAIHI-SEC
      *
      *    ＲＥＣＥ８５９ファイルの内容をテーブルに退避
           MOVE    ZERO       TO     IDX-RECE85
           MOVE    SPACE      TO     WRK-RECE85XX-REC
           INITIALIZE                WRK-RECE85XX-REC
           MOVE    ZERO       TO     WRK-JYUNBAN
      *
           PERFORM  250311-SRYACTINF2-HENSYU-SEC
      *
           .
       25031-FILM-COMMENT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ８５９　ＳＲＹＡＣＴＩＮＦ編集処理
      *****************************************************************
       250311-SRYACTINF2-HENSYU-SEC     SECTION.
      *
           PERFORM
             UNTIL  ( FLG-RECE859           =   1                    )
             OR     ( RECE849-HOSPNUM   NOT =   RECE859-HOSPNUM      )
             OR     ( RECE849-SRYYM     NOT =   RECE859-SRYYM        )
             OR     ( RECE849-NYUGAIKBN NOT =   RECE859-NYUGAIKBN    )
             OR     ( RECE849-PTID      NOT =   RECE859-PTID         )
             OR     ( RECE849-RECEKA    NOT =   RECE859-RECEKA       )
             OR     ( RECE849-HKNID     NOT =   RECE859-HKNID        )
             OR     ( RECE849-TEKSTYMD  NOT =   RECE859-TEKSTYMD     )
             OR     ( RECE849-ZAINUM    NOT =   RECE859-ZAINUM       )
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   5     )
                         OR      ( RECE859-SRYCD(IDX) =   SPACE )
                    ADD    1             TO      IDX-RECE85
                    MOVE   RECE859-SRYACT-TBL(IDX)
                             TO   WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
      *
                    IF   RECE859-SRYCD(IDX) =
                         "700010000" OR "700030000" OR "700050000" OR
                         "700080000" OR "700110000" OR "700140000" OR
                         "700290000" OR "700310000" OR "700330000" OR
                         "700710000" OR "700730000" OR "700750000" OR
                         "700780000" OR "700810000" OR "700840000" OR
                         "700870000" OR "700160000" OR "700180000" OR
                         "700190000" OR "700200000" OR "700210000" OR
                         "700220000" OR "700230000" OR "700240000" OR
                         "700250000" OR "700260000" OR "700270000" OR
                         "700280000" OR "700590000" OR "700600000" OR
                         "700630000" OR "700640000" OR "700650000" OR
                         "700680000" OR "729780000"
                         MOVE   IDX-RECE85   TO   WRK-JYUNBAN
                    END-IF
      *
               END-PERFORM
      *
               PERFORM 990-RECE859-NEXT-SEC
      *
           END-PERFORM
      *
      *    フィルム以降の明細をずらす
           IF   WRK-JYUNBAN  NOT =  ZERO
      *
               PERFORM   VARYING   IDX   FROM   IDX-RECE85   BY  -1
                          UNTIL  ( IDX    <    1           )
                           OR    ( IDX    <=   WRK-JYUNBAN )
      *
                   COMPUTE   WRK-GYOSUU2  =  IDX  +  1
                   MOVE   WRK-RECE85XX-SRYACT-TBL(IDX 1)  TO
                          WRK-RECE85XX-SRYACT-TBL(WRK-GYOSUU2 1)
                   INITIALIZE   WRK-RECE85XX-SRYACT-TBL(IDX 1)
      *
               END-PERFORM
      *
      *        分画数の差し込み
               MOVE   WRK-JYUNBAN     TO  MAX-MEISAISU
      *
               ADD    1               TO  MAX-MEISAISU
               MOVE  "810000001"
                              TO  WRK-RECE85XX-SRYCD(MAX-MEISAISU 1)
               MOVE   ZERO    TO  WRK-RECE85XX-SRYSURYO(MAX-MEISAISU 1)
      *
               MOVE   WRK-RECE85XX-SRYKAISU(WRK-JYUNBAN 1)
                                      TO  WRK-SRYKAISU-X
      *        全角変換
               INITIALIZE                     WRK-CHAR-HENKAN-AREA
               MOVE     WRK-SRYKAISU-X  TO    WRK-CHAR-X
               PERFORM  2503111-NUM-ZENKAKU-HENKAN-SEC
               STRING   WRK-CHAR-N      DELIMITED  BY  SPACE
                        "分画"          DELIMITED  BY  SIZE
                                        INTO  WRK-BUNKAKU-N
               END-STRING
               COMPUTE WRK-BUNKAKUKETA   =   WRK-CHAR-N-CNT  +  4
      *
               COMPUTE WRK-RECE85XX-YUKOKETA(MAX-MEISAISU 1) =
                       WRK-BUNKAKUKETA   /   2
               MOVE    WRK-BUNKAKU-N
                           TO  WRK-RECE85XX-NAME(MAX-MEISAISU 1)
               MOVE    "1" TO  WRK-RECE85XX-RECEPTFLG(MAX-MEISAISU 1)
               MOVE    "1" TO  WRK-RECE85XX-SIKFLG(MAX-MEISAISU 1)
      *
               IF    WRK-JIDO-SETCOMATFLG  NOT = ZERO
                 MOVE  "2" TO  WRK-RECE85XX-MEISKYFLG(MAX-MEISAISU 1)
                 MOVE  WRK-JIDO-SETCOMATFLG
                           TO  WRK-RECE85XX-SETCOMATFLG(MAX-MEISAISU 1)
                 MOVE  WRK-JIDO-RECEDENFLG
                           TO  WRK-RECE85XX-RECEDENFLG(MAX-MEISAISU 1)
               END-IF
      *
           END-IF
      *
      *    コメントを含んだ内容で中間ファイルの再作成
           MOVE       ZERO             TO      FLG-WRKRECE85
           MOVE       ZERO             TO      IDX
           MOVE       ZERO             TO      IDX-RECE85
           MOVE       ZERO             TO      WRK-RENNUM
           MOVE       ZERO             TO      WRK-CNT-MEISAI
           PERFORM    UNTIL     FLG-WRKRECE85  =    1
                    INITIALIZE                        RECE851-REC
                    MOVE    WRK-RECE85-KEY       TO   RECE851-KEY
                    ADD     1                    TO   WRK-RENNUM
                    MOVE    WRK-RENNUM           TO   RECE851-RENNUM
                    MOVE    WRK-RECE85-PTNUM     TO   RECE851-PTNUM
                    MOVE    WRK-RECE85-SRYKA     TO   RECE851-SRYKA
                    MOVE    WRK-RECE85-SRYKBN    TO   RECE851-SRYKBN
                    MOVE    WRK-RECE85-SRYSYUKBN TO   RECE851-SRYSYUKBN
                    MOVE    WRK-RECE85-JIHIMONEY TO   RECE851-JIHIMONEY
                    PERFORM  VARYING   IDX   FROM   1   BY   1
                             UNTIL   (IDX       >    5)   OR
                                     (FLG-WRKRECE85   =   1)
                       ADD         1             TO    IDX-RECE85
                       IF (WRK-RECE85XX-SRYCD(IDX-RECE85 1) = SPACE)
                       OR (IDX-RECE85                       >  100 )
                           MOVE    1             TO    FLG-WRKRECE85
                       ELSE
                           MOVE  WRK-RECE85XX-SRYACT-TBL(IDX-RECE85 1)
                                            TO   RECE851-SRYACT-TBL(IDX)
      *
                           ADD    1    TO   WRK-CNT-MEISAI
      *
                       END-IF  
                    END-PERFORM
                    IF   RECE851-SRYCD(1)  NOT =  SPACE
                         PERFORM 800-RECE851-WRITE-SEC
                    END-IF
           END-PERFORM
      *
           INITIALIZE                      RECE841-REC
           MOVE    RECE849-KEY1        TO  RECE841-KEY1
           MOVE    RECE849-ZAINUM      TO  RECE841-ZAINUM
           MOVE    RECE849-SRYKBN      TO  RECE841-SRYKBN
           MOVE    RECE849-DATA-AREA   TO  RECE841-DATA-AREA
           MOVE    WRK-CNT-MEISAI      TO  RECE841-MEISAISU
           IF   WRK-JIDO-SETCOMFLG     =  "1"
             MOVE  WRK-JIDO-SETCOMFLG      TO  RECE841-SETCOMFLG
           END-IF
           PERFORM 800-RECE841-WRITE-SEC
      *
           .
       250311-SRYACTINF2-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    数値半角→全角変換処理
      *****************************************************************
       2503111-NUM-ZENKAKU-HENKAN-SEC    SECTION.
      *
           MOVE     1       TO   WRK-CHAR-IDX
           MOVE    ZERO     TO   WRK-CHAR-N-CNT
      *
           PERFORM   VARYING   IDX20   FROM    1   BY  1
                      UNTIL    IDX20     >     3
              IF  WRK-CHAR-X(IDX20:1)  IS   NUMERIC
                 IF   WRK-CHAR-X(IDX20:1) = "0"
                   MOVE   "０"      TO  WRK-CHAR-N(WRK-CHAR-IDX:)
                 ELSE
                   MOVE   WRK-CHAR-X(IDX20:1)
                                    TO  IDX21
                   MOVE   TBL-DAY(IDX21)(3:2)
                                    TO  WRK-CHAR-N(WRK-CHAR-IDX:)
                 END-IF
                 ADD    2           TO  WRK-CHAR-IDX
                                        WRK-CHAR-N-CNT
              END-IF
           END-PERFORM
      *
           .
       2503111-NUM-ZENKAKU-HENKAN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイル８４９出力処理
      *****************************************************************
       2599-RECE849-WRITE-SEC      SECTION.
      *
           INITIALIZE                      RECE841-REC
           MOVE    RECE849-KEY1        TO  RECE841-KEY1
           MOVE    RECE849-ZAINUM      TO  RECE841-ZAINUM
           MOVE    RECE849-SRYKBN      TO  RECE841-SRYKBN
           MOVE    RECE849-DATA-AREA   TO  RECE841-DATA-AREA
           PERFORM 800-RECE841-WRITE-SEC
      *
           PERFORM 25991-RECE859-TENSOU-SEC
           .
       2599-RECE849-WRITE-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８５９出力処理
      *****************************************************************
       25991-RECE859-TENSOU-SEC     SECTION.
      *
           PERFORM 800-RECE849-SET859-SEC
           MOVE    RECE849-ZAINUM       TO  RECE859-ZAINUM
           START   RECE859-FILE
               KEY IS    >=   RECE859-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE859
               NOT INVALID
                   PERFORM 990-RECE859-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE859           =   1                    )
               OR     ( RECE849-HOSPNUM   NOT =   RECE859-HOSPNUM      )
               OR     ( RECE849-SRYYM     NOT =   RECE859-SRYYM        )
               OR     ( RECE849-NYUGAIKBN NOT =   RECE859-NYUGAIKBN    )
               OR     ( RECE849-PTID      NOT =   RECE859-PTID         )
               OR     ( RECE849-RECEKA    NOT =   RECE859-RECEKA       )
               OR     ( RECE849-HKNID     NOT =   RECE859-HKNID        )
               OR     ( RECE849-TEKSTYMD  NOT =   RECE859-TEKSTYMD     )
               OR     ( RECE849-ZAINUM    NOT =   RECE859-ZAINUM       )
      *
               MOVE    RECE859-REC       TO   RECE851-REC
               PERFORM 800-RECE851-WRITE-SEC
      *
               PERFORM 990-RECE859-NEXT-SEC
      *
           END-PERFORM
      *
           .
       25991-RECE859-TENSOU-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集
      *****************************************************************
       270-SENTAKUCOM-HENSYU-SEC     SECTION.
      *
      *    パラメータ８４１ファイルより編集
           PERFORM 800-RECE82-SET841-SEC
      *@@@@
           MOVE    SPACE               TO  RECE841-SRYKBN
      *@@@@
           MOVE    ZERO                TO  RECE841-ZAINUM
      *
           START   RECE841-FILE
               KEY IS    >=   RECE841-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE841
               NOT INVALID
                   PERFORM 990-RECE841-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE841          =   1                 )
               OR     ( RECE82-HOSPNUM   NOT =   RECE841-HOSPNUM   )
               OR     ( RECE82-SRYYM     NOT =   RECE841-SRYYM     )
               OR     ( RECE82-NYUGAIKBN NOT =   RECE841-NYUGAIKBN )
               OR     ( RECE82-PTID      NOT =   RECE841-PTID      )
               OR     ( RECE82-RECEKA    NOT =   RECE841-RECEKA    )
               OR     ( RECE82-HKNID     NOT =   RECE841-HKNID     )
               OR     ( RECE82-TEKSTYMD  NOT =   RECE841-TEKSTYMD  )
      *
               IF     RECE841-SENTAKUCOMFLG  =  "1"
                  MOVE    ZERO    TO    FLG-SENTAKU-OKIKAE
                  MOVE    ZERO    TO    FLG-SENTAKU-OKIKAE2
                  PERFORM   2701-SENTAKUCOM-HENSYU2-SEC
                  IF  (FLG-SENTAKU-OKIKAE   =  1)
                  OR  (FLG-SENTAKU-OKIKAE2  =  1)
                    PERFORM 2702-SENTAKUCOM-HENSYU4-SEC
                  END-IF
               END-IF
      *
               PERFORM 990-RECE841-NEXT-SEC
      *
           END-PERFORM
      *
           .
       270-SENTAKUCOM-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集２
      *****************************************************************
       2701-SENTAKUCOM-HENSYU2-SEC     SECTION.
      *
           MOVE    ZERO                 TO  IDX45
           MOVE    SPACE                TO  WRK-RECE85XX-REC
           INITIALIZE                       WRK-RECE85XX-REC
      *
           MOVE    ZERO                 TO  FLG-SENTAKU-SYUGI
           INITIALIZE                       TBL-GAZO-INF
      *
           PERFORM 800-RECE841-SET851-SEC
           MOVE    RECE841-ZAINUM       TO  RECE851-ZAINUM
           START   RECE851-FILE
               KEY IS    >=   RECE851-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE851
               NOT INVALID
                   PERFORM 990-RECE851-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE851           =   1                 )
               OR     ( RECE841-HOSPNUM   NOT =   RECE851-HOSPNUM   )
               OR     ( RECE841-SRYYM     NOT =   RECE851-SRYYM     )
               OR     ( RECE841-NYUGAIKBN NOT =   RECE851-NYUGAIKBN )
               OR     ( RECE841-PTID      NOT =   RECE851-PTID      )
               OR     ( RECE841-RECEKA    NOT =   RECE851-RECEKA    )
               OR     ( RECE841-HKNID     NOT =   RECE851-HKNID     )
               OR     ( RECE841-TEKSTYMD  NOT =   RECE851-TEKSTYMD  )
               OR     ( RECE841-ZAINUM    NOT =   RECE851-ZAINUM    )
      *
               PERFORM  VARYING  IDX  FROM  1  BY  1
                         UNTIL  (IDX                >   5  )
                          OR    (RECE851-SRYCD(IDX) = SPACE)
                 ADD    1   TO   IDX45
                 MOVE   RECE851-SRYACT-TBL(IDX)
                            TO   WRK-RECE85XX-SRYACT-TBL(IDX45 1)
      *
                 IF    (RECE841-FLG-CTMRI-COMMENT  =   SPACE)
                 AND   (RECE841-SENTAKUBUIFLG  NOT =   SPACE)
                   IF   WRK-RECE85XX-SRYCD(IDX45 1)(1:1) = "1"
                         MOVE    1    TO  FLG-SENTAKU-SYUGI
                   END-IF
                   IF   WRK-RECE85XX-SRYCD(IDX45 1)(1:3) = "002"
                     MOVE  "1"  TO  WRK-RECE85XX-RECEDENFLG(IDX45 1)
                     MOVE  "1"  TO  WRK-RECE85XX-RECEPTFLG(IDX45 1)
                     MOVE   1   TO  FLG-SENTAKU-OKIKAE2
                   END-IF
                   IF  ((WRK-RECE85XX-SRYCD(IDX45 1)(1:1) = "8"   ) AND
                        (WRK-RECE85XX-SRYCD(IDX45 1)(4:1) = "1"   ) AND
                        (WRK-RECE85XX-SRYCD(IDX45 1)(5:1) = "8"   ))
                   OR  ( WRK-RECE85XX-SRYCD(IDX45 1) = "830100797" )
                     MOVE     ZERO  TO  FLG-GAZO
                     PERFORM  VARYING  IDX50  FROM  1  BY  1
                               UNTIL  (IDX50 >   10                 )
                                OR    (IDX50 > RECE841-SENTAKUBUICNT)
                                OR    (WRK-RECE85XX-NAME(IDX50 1)
                                                             = SPACE)
                       IF   (WRK-RECE85XX-NAME(IDX45 1) =
                                       WRK-RECE85XX-NAME(IDX50 1))
                       AND  (TBL-GAZO-CHEKFLG(IDX50)    =  ZERO  )
                         MOVE   1   TO  FLG-GAZO
                         MOVE   10  TO  IDX50
                       END-IF
                     END-PERFORM
                     IF  FLG-GAZO  =  ZERO
                     AND IDX50    <=  10
                       MOVE   WRK-RECE85XX-SRYACT-TBL(IDX45 1)
                                  TO  WRK-RECE85XX-SRYACT-TBL(IDX50 1)
                       MOVE  "1"  TO  WRK-RECE85XX-RECEDENFLG(IDX50 1)
                       IF     FLG-SENTAKU-SYUGI  =  ZERO
                         MOVE 1   TO  TBL-GAZO-CHEKFLG(IDX50)
                       END-IF
                     END-IF
                     MOVE    "1"  TO  WRK-RECE85XX-RECEPTFLG(IDX45 1)
                     MOVE     1   TO  FLG-SENTAKU-OKIKAE2
                   END-IF
                 END-IF
      *
                 IF   (IDX45                               >  1        )
                 AND  (WRK-RECE85XX-SRYCD(IDX45 1)(1:1)    = "8"       )
                 AND  (WRK-RECE85XX-SRYCD(IDX45 1)(4:1)    = "1" OR "6")
                 AND  (WRK-RECE85XX-MEISKYFLG(IDX45 1) NOT = "2"       )
                 AND  (RECE841-SRYKBN  NOT = "90" AND "92" AND "97"    )
                   MOVE      ZERO    TO   FLG-GET
                   MOVE      ZERO    TO   FLG-ETC
                   COMPUTE   IDY12   =    IDX45  -  1
                   PERFORM  VARYING  IDY11  FROM  IDY12  BY  -1
                             UNTIL  (IDY11    <  1)
                              OR    (FLG-GET  =  1)
                     IF (WRK-RECE85XX-SRYCD(IDY11 1)(1:1) = "7"  )
                     OR (WRK-RECE85XX-SRYCD(IDY11 1)(1:3) = "059")
                       MOVE    1     TO   FLG-ETC
                       MOVE  IDY11   TO   IDY13
                     ELSE
                       IF WRK-RECE85XX-SRYCD(IDY11 1)(1:1) = "1" OR "6"
                         PERFORM 27011-SENTAKUCOM-HENSYU3-SEC
                         IF   FLG-GET = ZERO
                           MOVE    1     TO   FLG-ETC
                           MOVE  IDY11   TO   IDY13
                         END-IF
                       END-IF
                     END-IF
                   END-PERFORM
                   IF     FLG-GET  =   1
                     MOVE      1    TO   FLG-SENTAKU-OKIKAE
                     MOVE     "2"   TO   WRK-RECE85XX-MEISKYFLG(IDX45 1)
                     IF   WRK-RECE85XX-COMCDCHGFLG(IDX45 1) = "1"
                       MOVE   "810000001"
                                    TO   WRK-RECE85XX-SRYCD(IDX45 1)
                     END-IF
                     IF   FLG-ETC  =   1
                       MOVE    ZERO      TO  IDX46
                       MOVE    SPACE     TO  WRK-RECE85ZZ-REC
                       INITIALIZE            WRK-RECE85ZZ-REC
                       PERFORM  VARYING  IDY11  FROM  1  BY  1
                                 UNTIL   IDY11    >   IDY12
                         IF   IDY11 = IDY13
                           ADD   1   TO   IDX46
                           MOVE  WRK-RECE85XX-SRYACT-TBL(IDX45 1)
                                 TO   WRK-RECE85ZZ-SRYACT-TBL(IDX46 1)
                         END-IF
                         ADD     1   TO   IDX46
                         MOVE    WRK-RECE85XX-SRYACT-TBL(IDY11 1)
                                 TO   WRK-RECE85ZZ-SRYACT-TBL(IDX46 1)
                       END-PERFORM
                       PERFORM  VARYING  IDY11  FROM  1  BY  1
                                 UNTIL   IDY11    >   IDX45
                         MOVE   WRK-RECE85ZZ-SRYACT-TBL(IDY11 1)
                                 TO   WRK-RECE85XX-SRYACT-TBL(IDY11 1)
                       END-PERFORM
                     END-IF
                   ELSE
                     IF   WRK-RECE85XX-COMCDCHGFLG(IDX45 1) = "1"
                       MOVE "810000001" TO WRK-RECE85XX-SRYCD(IDX45 1)
                       MOVE  1          TO FLG-SENTAKU-OKIKAE2
                     END-IF
                   END-IF
                 ELSE
                   IF     WRK-RECE85XX-COMCDCHGFLG(IDX45 1) = "1"
                       MOVE "810000001" TO WRK-RECE85XX-SRYCD(IDX45 1)
                       MOVE  1          TO FLG-SENTAKU-OKIKAE2
                   END-IF
                 END-IF
               END-PERFORM
      *
               PERFORM 990-RECE851-NEXT-SEC
      *
           END-PERFORM
      *
           .
       2701-SENTAKUCOM-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集３
      *****************************************************************
       27011-SENTAKUCOM-HENSYU3-SEC     SECTION.
      *
           INITIALIZE                      RKISAI-REC
           MOVE  WRK-RECE85XX-SRYCD(IDY11 1)
                                       TO  RKISAI-SRYCD
           MOVE  RECE82-SRYYM          TO  RKISAI-STYM
           MOVE  RECE82-SRYYM          TO  RKISAI-EDYM
           MOVE  RKISAI-REC            TO  MCPDATA-REC
           MOVE  "tbl_recekisai"       TO  MCP-TABLE
           MOVE  "key5"                TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC  =  ZERO
             MOVE  "tbl_recekisai"     TO  MCP-TABLE
             MOVE  "key5"              TO  MCP-PATHNAME
             PERFORM  900-RKISAI-READ-SEC
             PERFORM  UNTIL (FLG-RKISAI  =  1)
                       OR   (FLG-GET     =  1)
               IF   RKISAI-C-CD  =  WRK-RECE85XX-SRYCD(IDX45 1)
                 MOVE    1    TO    FLG-GET
               END-IF
               MOVE  "tbl_recekisai"   TO  MCP-TABLE
               MOVE  "key5"            TO  MCP-PATHNAME
               PERFORM  900-RKISAI-READ-SEC
             END-PERFORM
           END-IF
           MOVE  "tbl_recekisai"       TO  MCP-TABLE
           MOVE  "key5"                TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       27011-SENTAKUCOM-HENSYU3-EXT.
           EXIT.
      *
      *****************************************************************
      *    選択式コメント編集４
      *****************************************************************
       2702-SENTAKUCOM-HENSYU4-SEC     SECTION.
      *
           MOVE    ZERO                 TO  IDX45
      *
           PERFORM 800-RECE841-SET851-SEC
           MOVE    RECE841-ZAINUM       TO  RECE851-ZAINUM
           START   RECE851-FILE
               KEY IS    >=   RECE851-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE851
               NOT INVALID
                   PERFORM 990-RECE851-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE851           =   1                 )
               OR     ( RECE841-HOSPNUM   NOT =   RECE851-HOSPNUM   )
               OR     ( RECE841-SRYYM     NOT =   RECE851-SRYYM     )
               OR     ( RECE841-NYUGAIKBN NOT =   RECE851-NYUGAIKBN )
               OR     ( RECE841-PTID      NOT =   RECE851-PTID      )
               OR     ( RECE841-RECEKA    NOT =   RECE851-RECEKA    )
               OR     ( RECE841-HKNID     NOT =   RECE851-HKNID     )
               OR     ( RECE841-TEKSTYMD  NOT =   RECE851-TEKSTYMD  )
               OR     ( RECE841-ZAINUM    NOT =   RECE851-ZAINUM    )
      *
               PERFORM  VARYING  IDX  FROM  1  BY  1
                         UNTIL  (IDX                >   5  )
                          OR    (RECE851-SRYCD(IDX) = SPACE)
                 ADD    1   TO   IDX45
                 MOVE   WRK-RECE85XX-SRYACT-TBL(IDX45 1)
                            TO   RECE851-SRYACT-TBL(IDX)
               END-PERFORM
      *
               REWRITE   RECE851-REC
               IF    STS-RECE851  =  "00"
                 CONTINUE
               ELSE
                 MOVE    SPACE          TO  WRK-ERR-AREA
                 INITIALIZE                 WRK-ERR-AREA
                 MOVE    4              TO  WRK-ERR-FLG
                 MOVE    RECE851PARA    TO  WRK-ERR-FILE-NM
                 MOVE    STS-RECE851    TO  WRK-ERR-FILE-STS
                 PERFORM 500-FILE-ERR-ABORT-SEC
               END-IF
               ADD       1        TO   CNT-RECE85-RE
      *
               PERFORM 990-RECE851-NEXT-SEC
      *
           END-PERFORM
      *
           IF  FLG-SENTAKU-OKIKAE  =  1
             MOVE   "1"   TO   RECE841-SETCOMFLG
             REWRITE   RECE841-REC
             IF    STS-RECE841  =  "00"
               CONTINUE
             ELSE
               MOVE    SPACE          TO  WRK-ERR-AREA
               INITIALIZE                 WRK-ERR-AREA
               MOVE    4              TO  WRK-ERR-FLG
               MOVE    RECE841PARA    TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE841    TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
             END-IF
             ADD     1    TO   CNT-RECE84-RE
           END-IF
      *
           .
       2702-SENTAKUCOM-HENSYU4-EXT.
           EXIT.
      *
      *****************************************************************
      *    関係コメント編集
      *****************************************************************
       260-SETCOM-HENSYU-SEC     SECTION.
      *
      *    パラメータ８４１ファイルより編集
           PERFORM 800-RECE82-SET841-SEC
      *@@@@
           MOVE    SPACE               TO  RECE841-SRYKBN
      *@@@@
           MOVE    ZERO                TO  RECE841-ZAINUM
      *
           START   RECE841-FILE
               KEY IS    >=   RECE841-KEY
               INVALID
                   MOVE    1           TO  FLG-RECE841
               NOT INVALID
                   PERFORM 990-RECE841-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE841          =   1                 )
               OR     ( RECE82-HOSPNUM   NOT =   RECE841-HOSPNUM   )
               OR     ( RECE82-SRYYM     NOT =   RECE841-SRYYM     )
               OR     ( RECE82-NYUGAIKBN NOT =   RECE841-NYUGAIKBN )
               OR     ( RECE82-PTID      NOT =   RECE841-PTID      )
               OR     ( RECE82-RECEKA    NOT =   RECE841-RECEKA    )
               OR     ( RECE82-HKNID     NOT =   RECE841-HKNID     )
               OR     ( RECE82-TEKSTYMD  NOT =   RECE841-TEKSTYMD  )
      *
               MOVE      ZERO      TO    FLG-SETCOM-OKIKAE
      *
               IF     RECE841-SETCOMFLG   =    "1"
                  PERFORM 2601-SETCOM-HENSYU2-SEC
                  IF   FLG-SETCOM-OKIKAE  =  "1"
                    CONTINUE
                  ELSE
                    MOVE   SPACE   TO   RECE841-SETCOMFLG
                    REWRITE   RECE841-REC
                    IF      STS-RECE841         =   "00"
                       CONTINUE
                    ELSE
                       MOVE    SPACE               TO  WRK-ERR-AREA
                       INITIALIZE                      WRK-ERR-AREA
                       MOVE    4                   TO  WRK-ERR-FLG
                       MOVE    RECE841PARA         TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE841         TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                    END-IF
       *
                    ADD     1      TO   CNT-RECE84-RE
                  END-IF
               END-IF
      *
               PERFORM 990-RECE841-NEXT-SEC
      *
           END-PERFORM
      *
           .
       260-SETCOM-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    関係コメント編集２
      *****************************************************************
       2601-SETCOM-HENSYU2-SEC     SECTION.
      *
           MOVE    ZERO    TO    FLG-SETCOM
           MOVE    ZERO    TO    FLG-SETCOM2
      *
           MOVE    ZERO    TO    WRK-HEN-RENNUM-X
                                 WRK-HEN-SHORI-RENNUM-X
                                 WRK-HEN-SEQNO-X
           MOVE    ZERO    TO    WRK-HEN-RENNUM-J
                                 WRK-HEN-SHORI-RENNUM-J
                                 WRK-HEN-SEQNO-J
           MOVE    ZERO    TO    WRK-HEN-RENNUM-J2
                                 WRK-HEN-SHORI-RENNUM-J2
                                 WRK-HEN-SEQNO-J2
      *
           PERFORM 800-RECE841-SET851-SEC
           MOVE    RECE841-ZAINUM       TO  RECE851-ZAINUM
           START   RECE851-FILE
               KEY IS    >=   RECE851-KEY
               INVALID
                   MOVE    1            TO  FLG-RECE851
               NOT INVALID
                   PERFORM 990-RECE851-NEXT-SEC
           END-START
           PERFORM
               UNTIL  ( FLG-RECE851           =   1                 )
               OR     ( RECE841-HOSPNUM   NOT =   RECE851-HOSPNUM   )
               OR     ( RECE841-SRYYM     NOT =   RECE851-SRYYM     )
               OR     ( RECE841-NYUGAIKBN NOT =   RECE851-NYUGAIKBN )
               OR     ( RECE841-PTID      NOT =   RECE851-PTID      )
               OR     ( RECE841-RECEKA    NOT =   RECE851-RECEKA    )
               OR     ( RECE841-HKNID     NOT =   RECE851-HKNID     )
               OR     ( RECE841-TEKSTYMD  NOT =   RECE851-TEKSTYMD  )
               OR     ( RECE841-ZAINUM    NOT =   RECE851-ZAINUM    )
      *
               MOVE      ZERO      TO    FLG-MEISKY-OKIKAE
      *
               PERFORM   VARYING   IDX   FROM    1   BY  1
                         UNTIL   ( IDX                >   5     )
                         OR      ( RECE851-SRYCD(IDX) =   SPACE )
                 IF   RECE851-MEISKYFLG(IDX)  =  "2"
                   IF      RECE851-SRYYM  >=  "201307"
                    IF     RECE851-SETCOMATFLG(IDX) = ZERO
                      IF   (FLG-SETCOM              =  1   )
                      AND  (RECE851-RECEDENFLG(IDX) = SPACE)
                        ADD    1                 TO  WRK-HEN-SEQNO-X
                        IF   WRK-HEN-SEQNO-X  >  3
                        AND  FLG-SETCOM2      =  ZERO
                          MOVE   SPACE   TO  RECE851-MEISKYFLG(IDX)
                          MOVE   1       TO  FLG-MEISKY-OKIKAE
                        ELSE
                          MOVE   WRK-HEN-RENNUM-X  TO  WRK-HEN-RENNUM
                          MOVE   WRK-HEN-SHORI-RENNUM-X
                                         TO  WRK-HEN-SHORI-RENNUM
                          MOVE   WRK-HEN-SEQNO-X   TO  WRK-HEN-SEQNO
                          PERFORM  26011-SETCOM-HENSYU3-SEC
                        END-IF
                        IF  (WRK-HEN-RENNUM-X = WRK-HEN-RENNUM-J )
                        AND (WRK-HEN-SHORI-RENNUM-X
                                        = WRK-HEN-SHORI-RENNUM-J )
                          ADD  1                 TO  WRK-HEN-SEQNO-J
                        END-IF
                        IF  (WRK-HEN-RENNUM-X = WRK-HEN-RENNUM-J2)
                        AND (WRK-HEN-SHORI-RENNUM-X
                                        = WRK-HEN-SHORI-RENNUM-J2)
                          ADD  1                 TO  WRK-HEN-SEQNO-J2
                        END-IF
                      END-IF
                    ELSE
      ***==           ２０２０年４月以降に追加となった選択式コメントの
      ***==           対応は不要
                      IF   RECE851-RECEDENFLG(IDX) = SPACE
                       EVALUATE   RECE851-SETCOMATFLG(IDX)
                        WHEN    1
                          ADD  1                 TO  WRK-HEN-SEQNO-J
                          IF   WRK-HEN-SEQNO-J  >  3
                          AND  FLG-SETCOM2      =  ZERO
                            MOVE   SPACE   TO  RECE851-MEISKYFLG(IDX)
                            MOVE   1       TO  FLG-MEISKY-OKIKAE
                          ELSE
                            MOVE WRK-HEN-RENNUM-J  TO  WRK-HEN-RENNUM
                            MOVE WRK-HEN-SHORI-RENNUM-J
                                         TO  WRK-HEN-SHORI-RENNUM
                            MOVE WRK-HEN-SEQNO-J   TO  WRK-HEN-SEQNO
                            PERFORM  26011-SETCOM-HENSYU3-SEC
                          END-IF
                          IF  (WRK-HEN-RENNUM-X = WRK-HEN-RENNUM-J )
                          AND (WRK-HEN-SHORI-RENNUM-X
                                          = WRK-HEN-SHORI-RENNUM-J )
                            ADD    1             TO  WRK-HEN-SEQNO-X
                          END-IF
      *                 同一剤にコメント自動記載をする診療コードが２つ
      *                 あり、２つ目の自動記載分
                        WHEN    2
                          ADD  1                 TO  WRK-HEN-SEQNO-J2
                          IF   WRK-HEN-SEQNO-J2 >  3
                          AND  FLG-SETCOM2      =  ZERO
                            MOVE   SPACE   TO  RECE851-MEISKYFLG(IDX)
                            MOVE   1       TO  FLG-MEISKY-OKIKAE
                          ELSE
                            MOVE WRK-HEN-RENNUM-J2 TO  WRK-HEN-RENNUM
                            MOVE WRK-HEN-SHORI-RENNUM-J2
                                         TO  WRK-HEN-SHORI-RENNUM
                            MOVE WRK-HEN-SEQNO-J2  TO  WRK-HEN-SEQNO
                            PERFORM  26011-SETCOM-HENSYU3-SEC
                          END-IF
                          IF  (WRK-HEN-RENNUM-X = WRK-HEN-RENNUM-J2)
                          AND (WRK-HEN-SHORI-RENNUM-X
                                          = WRK-HEN-SHORI-RENNUM-J2)
                            ADD    1             TO  WRK-HEN-SEQNO-X
                          END-IF
                       END-EVALUATE
                      END-IF
      ***==
                    END-IF
                   ELSE
                    MOVE   SPACE   TO  RECE851-MEISKYFLG(IDX)
                    MOVE   1       TO  FLG-MEISKY-OKIKAE
                   END-IF
                 ELSE
                   IF      RECE851-SRYYM  >=  "201307"
                    IF   (RECE851-SRYCD(IDX)(1:1) = "1" OR "6" OR "7")
                    OR   (RECE851-SRYCD(IDX)(1:3) = "059"            )
                      MOVE   1               TO  FLG-SETCOM
                      MOVE   RECE851-RENNUM  TO  WRK-HEN-RENNUM-X
                      MOVE   IDX             TO  WRK-HEN-SHORI-RENNUM-X
                      MOVE   ZERO            TO  WRK-HEN-SEQNO-X
                      IF  RECE851-SRYCD(IDX)(1:1) = "6" OR "7"
                        MOVE   1             TO  FLG-SETCOM2
                      ELSE
                        MOVE   ZERO          TO  FLG-SETCOM2
                      END-IF
                    END-IF
      *
      ***==         ２０２０年４月以降に追加となった選択式コメントの
      ***==         対応は不要
                    IF   (RECE851-SRYCD(IDX) =
      *#1
                          "113000410" OR "113000510" OR "180000110" OR
                          "180000210" OR "113023910" OR
      *#3
                          "113001210" OR "113001310" OR "113002110" OR
      *#4
                          "111011810" OR "111012610" OR "111012810" OR
      *#6
                          "180000710" OR
      *#7
                          "113004310" OR
      *#11
                          "114008010" OR
      *#12
                          "114009410" OR
      *#16
                          "180027410" OR "180027510" OR "180028010" OR
                          "180028110" OR "180027610" OR "180027710" OR
                          "180030810" OR "180027810" OR "180027910" OR
                          "180028210" OR "180028310" OR "180028410" OR
                          "180032410" OR "180032510" OR "180032610" OR
                          "180032710" OR "180033110" OR
                          "180033910" OR "180034010" OR "180034110" OR
                          "180034210" OR "180034310" OR "180034410" OR
                          "180034510" OR "180034610" OR "180034710" OR
                          "180044310" OR "180044410" OR "180044510" OR
                          "180045810" OR "180045910" OR "180046010" OR
                          "180044610" OR "180044710" OR "180044810" OR
                          "180044910" OR "180045110" OR "180045310" OR
                          "180050330" OR "180050430" OR "180050530" OR
                          "180050630" OR "180050830" OR "180051030" OR
                          "180052730" OR "180052830" OR "180052930" OR
                          "180053030" OR "180053230" OR "180053430" OR
                          "180051530" OR "180051630" OR "180051730" OR
                          "180051830" OR "180052030" OR "180052230" OR
      *R6.6
                          "180744210" OR "180744310" OR "180744410" OR
                          "180744510" OR "180744610" OR "180744710" OR
                          "180744810" OR "180744910" OR "180745010" OR
                          "180745110" OR "180745310" OR "180745410" OR
                          "180745510" OR "180745610" OR "180745710" OR
                          "180745810" OR "180745910" OR "180746010" OR
                          "180746110" OR "180746210" OR "180746310" OR
                          "180746410" OR "180746510" OR "180746610" OR
                          "180746710" OR "180746810" OR "180746910" OR
                          "180747010" OR "180747110" OR "180747210" OR
                          "180747310" OR "180747410" OR "180747510" OR
                          "180747610" OR "180747710" OR "180747810" OR
                          "180747930" OR "180748030" OR "180748130" OR
                          "180748230" OR "180748330" OR "180748430" OR
                          "180748530" OR "180748630" OR "180748730" OR
                          "180748830" OR "180748930" OR "180749030" OR
                          "180749130" OR "180749230" OR "180749330" OR
                          "180749430" OR "180749530" OR "180749630" OR
                          "180750030" OR "180749730" OR "180750130" OR
                          "180749830" OR "180750230" OR "180749930" OR
                          "180750330" OR "180750430" OR "180750510" OR
                          "180750610" OR "180750710" OR "180750810" OR
                          "180750910" OR "180751010" OR "180751110" OR
                          "180751210" OR "180751310" OR "180751410" OR
                          "180751510" OR "180751610" OR "180751710" OR
                          "180751810" OR "180751910" OR "180752010" OR
                          "180752110" OR "180752210" OR "180752310" OR
                          "180752410" OR "180752510" OR "180752610" OR
                          "180752710" OR "180752810" OR "180752910" OR
                          "180753010" OR "180753130" OR "180753230" OR
                          "180753330" OR "180753430" OR "180753530" OR
                          "180753630" OR "180753730" OR "180753830" OR
                          "180754330" OR "180753930" OR "180754030" OR
                          "180754130" OR "180754230" OR "180754430" OR
                          "180754530" OR "180754630" OR "180754730" OR
                          "180754830" OR "180754930" OR "180755030" OR
                          "180755130" OR "180755230" OR "180755330" OR
                          "180755430" OR "180755530" OR "180755630" OR
                          "180755710" OR "180755810" OR "180755910" OR
                          "180756010" OR "180756110" OR "180756210" OR
                          "180756310" OR "180756410" OR "180756510" OR
                          "180756610" OR "180757710" OR "180757810" OR
                          "180757910" OR "180758010" OR "180758110" OR
                          "180758210" OR "180758310" OR "180758410" OR
                          "180758510" OR "180758610" OR "180756730" OR
                          "180756830" OR "180756930" OR "180757030" OR
                          "180757130" OR "180757230" OR "180757330" OR
                          "180757430" OR "180757530" OR "180757630" OR
                          "180758730" OR "180758830" OR "180758930" OR
                          "180759030" OR "180759130" OR "180759230" OR
                          "180759330" OR "180759430" OR "180759530" OR
                          "180759630" OR "180759710" OR "180759810" OR
                          "180759910" OR "180760010" OR "180760110" OR
                          "180760210" OR "180760310" OR "180760410" OR
      *#18
                          "113003410" OR
      *#19
                          "114045510" OR
      *#20
                          "700010000" OR "700030000" OR "700050000" OR
                          "700080000" OR "700110000" OR "700140000" OR
                          "700290000" OR "700310000" OR "700330000" OR
                          "700710000" OR "700730000" OR "700750000" OR
                          "700780000" OR "700810000" OR "700840000" OR
                          "700870000" OR "700160000" OR "700180000" OR
                          "700190000" OR "700200000" OR "700210000" OR
                          "700220000" OR "700230000" OR "700240000" OR
                          "700250000" OR "700260000" OR "700270000" OR
                          "700280000" OR "700590000" OR "700600000" OR
                          "700630000" OR "700640000" OR "700650000" OR
                          "700680000" OR "729780000" OR
      *#24
                          "114020910" OR
      *#26
                          "114009710" OR
      *#27
                          "113015010" OR "113015130" OR "114045470" OR
                          "114045670" OR
      *#29
                          "114027610" OR "114027710" OR "114027810" OR
                          "114027910" OR
      *#35
                          "140057510" OR "140057610" OR
      *#41
                          "140007710" OR "140008510" OR "140029850" OR
                          "140008210" OR "140039210" OR "140057810" OR
                          "140057910" OR "140058010" OR "140058110" OR
                          "140058210" OR "140058310" OR "140058410" OR
                          "140058510" OR "140058610" OR "140059310" OR
                          "140059410" OR "140059510" OR
                          "140060210" OR "140060310" OR "140060410" OR
                          "140060510" OR "140060610" OR "140060710" OR
                          "140060810" OR "140060910" OR "140061010" OR
      *#43
                          "160000210" OR "160177770" OR
      *#44
                          "170016010" OR
      *#45
                          "113030670" OR "113030770" OR
      *#47
                          "180058650" OR
      *
      *<入院のみ>
      *#100
                          "113022810" OR
      *#101
                          "113010710" OR "113010810" OR "120001610" OR
      *#102
                          "113003310" OR "113014810" OR "113014910" OR
                          "113017610" OR "113017710" OR "113017810" OR
                          "113017910" OR
      *#103
                          "190030310" OR
      *#104
                          "113006270" OR
      *#105
                          "180018310" OR
      *#106
                          "113011710" OR
      *#107
                          "180039030" OR "180036030" OR "180039130" OR
                          "180039230" OR "180039330" OR "180036130" OR
                          "180039430" OR "180039530" OR
                          "180048930" OR "180049030" OR
      *#108
                          "113008910" OR
      *#110
                          "140061210"                              )
      *
      *<労災用>
      *#16
                    OR   (RECE851-SRYCD(IDX) =
                          "101800230" OR "101800240" OR "101800250" OR
                          "101800260" OR "101800270" OR "101800280" OR
                          "101800290" OR "101800330" OR "101800340" OR
                          "101800350" OR
                          "101801110" OR "101801120" OR "101801130" OR
                          "101801070" OR "101801080" OR
      *R6.6
                          "101801600" OR "101801700" OR "101801800" OR
                          "101801900" OR "101802000" OR "101802100" OR
                          "101802200" OR "101802300" OR "101802400" OR
                          "101802500" OR "101802600" OR "101802700" OR
                          "101802800" OR "101802900" OR "101803000" OR
                          "101803100" OR "101803200" OR "101803300" OR
                          "101803400" OR "101803500" OR "101803600" OR
                          "101803700" OR "101803800" OR "101803900" OR
                          "101804000" OR "101804100" OR "101804200" OR
                          "101804300" OR "101804400" OR "101804500" OR
                          "101804600" OR "101804700" OR "101804800" OR
                          "101804900" OR "101805000" OR "101805100" OR
                          "101805200" OR "101805300" OR "101805400" OR
                          "101805500" OR "101805600" OR "101805700" OR
                          "101805800" OR "101805900" OR "101806000" OR
                          "101806100" OR "101806200" OR "101806300" OR
                          "101806400" OR "101806500" OR "101806600" OR
                          "101806700" OR "101806800" OR "101806900")
      *#4
                    OR   (RECE851-SRYCD(IDX) = "101110040"
                                            OR "101110060"         )
      *#301
                    OR   (RECE851-SRYCD(IDX) = "101800880"         )
      *
                    OR   (RECE851-SRYCD(IDX)(1:5)  =  "09593"      )
      *
                       MOVE   RECE851-RENNUM  TO  WRK-HEN-RENNUM-J
                       MOVE   IDX       TO  WRK-HEN-SHORI-RENNUM-J
                       MOVE   ZERO            TO  WRK-HEN-SEQNO-J
                    END-IF
      *
                    IF    RECE851-SRYCD(IDX) =
      *#2
                          "113000670" OR "113000770" OR "113029170" OR
                          "113029270" OR "113029370" OR
      *#40
                          "180056570" OR
      *#42
                          "140052170" OR "140052270" OR "140052370" OR
      *###
                          "114008370" OR "114054050" OR "114058050"
      *
                       MOVE   RECE851-RENNUM  TO  WRK-HEN-RENNUM-J2
                       MOVE   IDX       TO  WRK-HEN-SHORI-RENNUM-J2
                       MOVE   ZERO            TO  WRK-HEN-SEQNO-J2
                    END-IF
      ***==
                   END-IF
                 END-IF
               END-PERFORM
      *
               IF    FLG-MEISKY-OKIKAE  =  1
                  REWRITE   RECE851-REC
                  IF      STS-RECE851        =   "00"
                       CONTINUE
                  ELSE
                       MOVE    SPACE               TO  WRK-ERR-AREA
                       INITIALIZE                      WRK-ERR-AREA
                       MOVE    4                   TO  WRK-ERR-FLG
                       MOVE    RECE851PARA         TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE851         TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                  END-IF
      *
                  ADD       1        TO   CNT-RECE85-RE
               END-IF
      *
               PERFORM 990-RECE851-NEXT-SEC
      *
           END-PERFORM
      *
           .
       2601-SETCOM-HENSYU2-EXT.
           EXIT.
      *
      *****************************************************************
      *    関係コメント編集３
      *****************************************************************
       26011-SETCOM-HENSYU3-SEC     SECTION.
      *
           MOVE    SPACE                 TO  RECE855-REC
           INITIALIZE                        RECE855-REC
      *
           MOVE    RECE851-KEY           TO  RECE855-KEY
      *
           MOVE    WRK-HEN-RENNUM        TO  RECE855-RENNUM
           MOVE    WRK-HEN-SHORI-RENNUM  TO  RECE855-SHORI-RENNUM
           MOVE    WRK-HEN-SEQNO         TO  RECE855-SEQNO
      *
           MOVE    RECE851-SRYCD(IDX)    TO  RECE855-SRYCD
      *    後ろの全角空白を削除する
           INITIALIZE                      ORCSKANACHKAREA
           MOVE    "1"                 TO  KANACHK-SYORI
           MOVE    "1"                 TO  KANACHK-SYORIKBN
           MOVE    RECE851-NAME(IDX)   TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"       USING   ORCSKANACHKAREA
           IF    ( KANACHK-RC          =   ZERO )
           AND   ( KANACHK-MAX         >   ZERO )
               MOVE    SPACE           TO  RECE851-NAME(IDX)
               MOVE    KANACHK-OUT-INPUT (1:KANACHK-MAX)
                                       TO  RECE851-NAME(IDX)
           END-IF
           MOVE    RECE851-NAME(IDX)     TO  RECE855-NAME
      *    後ろの全角空白を削除する
           INITIALIZE                      ORCSKANACHKAREA
           MOVE    "1"                 TO  KANACHK-SYORI
           MOVE    "1"                 TO  KANACHK-SYORIKBN
           MOVE    RECE851-INPUTCOMENT(IDX)
                                       TO  KANACHK-MAE-INPUT
           CALL    "ORCSKANACHK"       USING   ORCSKANACHKAREA
           IF    ( KANACHK-RC          =   ZERO )
           AND   ( KANACHK-MAX         >   ZERO )
               MOVE    SPACE           TO  RECE851-INPUTCOMENT(IDX)
               MOVE    KANACHK-OUT-INPUT (1:KANACHK-MAX)
                                       TO  RECE851-INPUTCOMENT(IDX)
           END-IF
           MOVE    RECE851-INPUTCOMENT(IDX)
                                         TO  RECE855-INPUTCOMENT
      *
           WRITE   RECE855-REC
           IF      STS-RECE855         =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
      *
               MOVE    3                   TO  WRK-ERR-FLG
               MOVE    RECE855PARA         TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE855         TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           ADD     1                     TO  CNT-RECE855
      *
           MOVE    1                     TO  FLG-SETCOM-OKIKAE
      *
           .
       26011-SETCOM-HENSYU3-EXT.
           EXIT.
      *
      *****************************************************************
      *    エラー出力処理
      *****************************************************************
       500-ERR-HENSYU-SEC                SECTION.
      *
           OPEN    INPUT   RECEERR-FILE
           IF      STS-RECEERR         =   ZERO
               CLOSE   RECEERR-FILE
           ELSE
               OPEN    OUTPUT              RECEERR-FILE
      *
               MOVE    WRK-RECEERR         TO  RECEERR-REC
               WRITE   RECEERR-REC
               CLOSE   RECEERR-FILE
      *
               IF      WRK-PARA-SHELLID    NOT =   "RECEPTX"
      *            ジョブ管理終了処理
                   MOVE    "JBE"           TO  SJOBKANRI-MODE
                   INITIALIZE                  JOBKANRI-REC
                   MOVE    WRK-RECEERR     TO  JOB-YOBI
                   MOVE    "9999"          TO  JOB-ERRCD
                   PERFORM 900-CALL-ORCSJOB-SEC
               END-IF
           END-IF
      *
           MOVE    SPACE               TO  WRK-ERRMSG
           STRING  "ORCR0981 "         DELIMITED  BY  SIZE
                   WRK-RECEERR         DELIMITED  BY  SIZE
                   LOW-VALUE           DELIMITED  BY  SIZE
                                       INTO    WRK-ERRMSG
           END-STRING
           PERFORM 500-COBABORT-SEC
      *
           .
       500-ERR-HENSYU-EXT.
           EXIT.
      *
      *****************************************************************
      *    エラー時終了処理
      *****************************************************************
       500-COBABORT-SEC            SECTION.
      *
           CALL    "cobabort"          USING   WRK-ERRMSG
      *
           .
       500-COBABORT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイルエラー処理
      *****************************************************************
       500-FILE-ERR-ABORT-SEC      SECTION.
      *
           EVALUATE    WRK-ERR-FLG
               WHEN    1
                   MOVE    "ファイルＯＰＥＮエラー　FILE="
                                           TO  WRK-ERR-FILE-MSG
                   MOVE    "file open err" TO  WRK-ERR-FILE-MSG1
               WHEN    2
                   MOVE    "ファイル読み込みエラー　FILE="
                                           TO  WRK-ERR-FILE-MSG
                   MOVE    "file read err" TO  WRK-ERR-FILE-MSG1
               WHEN    3
                   MOVE    "ファイル書き込みエラー　FILE="
                                           TO  WRK-ERR-FILE-MSG
                   MOVE    "file write err"
                                           TO  WRK-ERR-FILE-MSG1
               WHEN    4
                   MOVE    "ファイル更新エラー　FILE="
                                           TO  WRK-ERR-FILE-MSG
                   MOVE    "file rewrite err"
                                           TO  WRK-ERR-FILE-MSG1
           END-EVALUATE
      *
           STRING  WRK-ERR-FILE-MSG        DELIMITED   BY  SPACE
                   WRK-ERR-FILE-NM (WRK-SGETTEMP-ST:)
                                           DELIMITED   BY  SPACE
                   " STS="                 DELIMITED   BY  SIZE
                   WRK-ERR-FILE-STS        DELIMITED   BY  SIZE
                                           INTO    WRK-RECEERR
           END-STRING
           PERFORM 500-ERR-HENSYU-SEC
      *
           STRING  "ORCR0981 "             DELIMITED   BY  SIZE
                   WRK-ERR-FILE-MSG1       DELIMITED   BY  SIZE
                   " FILE="                DELIMITED   BY  SIZE
                   WRK-ERR-FILE-NM (WRK-SGETTEMP-ST:)
                                           DELIMITED   BY  SPACE
                   "  STS="                DELIMITED   BY  SIZE
                   WRK-ERR-FILE-STS        DELIMITED   BY  SIZE
                   LOW-VALUE               DELIMITED   BY  SIZE
                                           INTO    WRK-ERRMSG
           END-STRING
           PERFORM 500-COBABORT-SEC
      *
           .
       500-FILE-ERR-ABORT-EXT.
           EXIT.
      *
      *
      *****************************************************************
      *    終了　　処理
      *****************************************************************
       300-END-SEC                 SECTION.
      *
      *    ファイルＣＬＯＳＥ処理
           CLOSE                       RECE82-FILE
           CLOSE                       RECE84-FILE
           CLOSE                       RECE85-FILE
           CLOSE                       RECE841-FILE     
           CLOSE                       RECE851-FILE     
           CLOSE                       RECE849-FILE
           CLOSE                       RECE859-FILE
           CLOSE                       RECE855-FILE
      *
           PERFORM 3001-FILE-SORT-SEC
      *
           IF      WRK-PARA-SHELLID    NOT =   "RECEPTX"
      *        ステップ管理終了処理
               MOVE    "STE"           TO  SJOBKANRI-MODE
               INITIALIZE                  JOBKANRI-REC
               PERFORM 900-CALL-ORCSJOB-SEC
      *
               PERFORM 900-DBDISCONNECT-SEC
           END-IF
      *
           DISPLAY "RECE82  CNT-IN  :" CNT-RECE82  
           DISPLAY "RECE849 CNT-WK  :" CNT-RECE849 
           DISPLAY "RECE859 CNT-WK  :" CNT-RECE859 
           DISPLAY "RECE84  CNT-OUT :" CNT-RECE84  
           DISPLAY "RECE85  CNT-OUT :" CNT-RECE85  
           DISPLAY "RECE84  REWRITE :" CNT-RECE84-RE
           DISPLAY "RECE85  REWRITE :" CNT-RECE85-RE
           DISPLAY "RECE855 CNT-OUT :" CNT-RECE855
           DISPLAY "*** ORCR0981 END ***"
      *
           .
       300-END-EXT.
           EXIT.
      *
      *****************************************************************
      *    ファイルＣＬＯＳＥ処理
      *****************************************************************
       3001-FILE-SORT-SEC              SECTION.
      *
           .
       3001-FILE-SORT-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８２データ編集処理（８４）
      *****************************************************************
       800-RECE82-SET84-SEC           SECTION.
      *
           INITIALIZE                      RECE84-REC
           MOVE    RECE82-HOSPNUM      TO  RECE84-HOSPNUM
           MOVE    RECE82-SRYYM        TO  RECE84-SRYYM
           MOVE    RECE82-NYUGAIKBN    TO  RECE84-NYUGAIKBN
           MOVE    RECE82-PTID         TO  RECE84-PTID
           MOVE    RECE82-RECEKA       TO  RECE84-RECEKA
           MOVE    RECE82-HKNID        TO  RECE84-HKNID
           MOVE    RECE82-TEKSTYMD     TO  RECE84-TEKSTYMD
      *
           .
       800-RECE82-SET84-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８２データ編集処理（８４９）
      *****************************************************************
       800-RECE82-SET849-SEC           SECTION.
      *
           INITIALIZE                      RECE849-REC
           MOVE    RECE82-HOSPNUM      TO  RECE849-HOSPNUM
           MOVE    RECE82-SRYYM        TO  RECE849-SRYYM
           MOVE    RECE82-NYUGAIKBN    TO  RECE849-NYUGAIKBN
           MOVE    RECE82-PTID         TO  RECE849-PTID
           MOVE    RECE82-RECEKA       TO  RECE849-RECEKA
           MOVE    RECE82-HKNID        TO  RECE849-HKNID
           MOVE    RECE82-TEKSTYMD     TO  RECE849-TEKSTYMD
      *
           MOVE    RECE82-RECESYUBETU  TO  RECE849-RECESYUBETU 
      *
           .
       800-RECE82-SET849-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８２データ編集処理（８４１）
      *****************************************************************
       800-RECE82-SET841-SEC           SECTION.
      *
           INITIALIZE                      RECE841-REC
           MOVE    RECE82-HOSPNUM      TO  RECE841-HOSPNUM
           MOVE    RECE82-SRYYM        TO  RECE841-SRYYM
           MOVE    RECE82-NYUGAIKBN    TO  RECE841-NYUGAIKBN
           MOVE    RECE82-PTID         TO  RECE841-PTID
           MOVE    RECE82-RECEKA       TO  RECE841-RECEKA
           MOVE    RECE82-HKNID        TO  RECE841-HKNID
           MOVE    RECE82-TEKSTYMD     TO  RECE841-TEKSTYMD
      *
           .
       800-RECE82-SET841-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８２データ編集処理（８５９）
      *****************************************************************
       800-RECE82-SET859-SEC           SECTION.
      *
           INITIALIZE                      RECE859-REC
           MOVE    RECE82-HOSPNUM      TO  RECE859-HOSPNUM
           MOVE    RECE82-SRYYM        TO  RECE859-SRYYM
           MOVE    RECE82-NYUGAIKBN    TO  RECE859-NYUGAIKBN
           MOVE    RECE82-PTID         TO  RECE859-PTID
           MOVE    RECE82-RECEKA       TO  RECE859-RECEKA
           MOVE    RECE82-HKNID        TO  RECE859-HKNID
           MOVE    RECE82-TEKSTYMD     TO  RECE859-TEKSTYMD
      *
           .
       800-RECE82-SET859-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８４データ編集処理（８５）
      *****************************************************************
       800-RECE84-SET85-SEC           SECTION.
      *
           INITIALIZE                      RECE85-REC
           MOVE    RECE84-HOSPNUM      TO  RECE85-HOSPNUM
           MOVE    RECE84-SRYYM        TO  RECE85-SRYYM
           MOVE    RECE84-NYUGAIKBN    TO  RECE85-NYUGAIKBN
           MOVE    RECE84-PTID         TO  RECE85-PTID
           MOVE    RECE84-RECEKA       TO  RECE85-RECEKA
           MOVE    RECE84-HKNID        TO  RECE85-HKNID
           MOVE    RECE84-TEKSTYMD     TO  RECE85-TEKSTYMD
      *
           .
       800-RECE84-SET85-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８４９データ編集処理（８５９）
      *****************************************************************
       800-RECE849-SET859-SEC           SECTION.
      *
           INITIALIZE                       RECE859-REC
           MOVE    RECE849-HOSPNUM      TO  RECE859-HOSPNUM
           MOVE    RECE849-SRYYM        TO  RECE859-SRYYM
           MOVE    RECE849-NYUGAIKBN    TO  RECE859-NYUGAIKBN
           MOVE    RECE849-PTID         TO  RECE859-PTID
           MOVE    RECE849-RECEKA       TO  RECE859-RECEKA
           MOVE    RECE849-HKNID        TO  RECE859-HKNID
           MOVE    RECE849-TEKSTYMD     TO  RECE859-TEKSTYMD
      *
           .
       800-RECE849-SET859-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８４１データ編集処理（８５１）
      *****************************************************************
       800-RECE841-SET851-SEC           SECTION.
      *
           INITIALIZE                       RECE851-REC
           MOVE    RECE841-HOSPNUM      TO  RECE851-HOSPNUM
           MOVE    RECE841-SRYYM        TO  RECE851-SRYYM
           MOVE    RECE841-NYUGAIKBN    TO  RECE851-NYUGAIKBN
           MOVE    RECE841-PTID         TO  RECE851-PTID
           MOVE    RECE841-RECEKA       TO  RECE851-RECEKA
           MOVE    RECE841-HKNID        TO  RECE851-HKNID
           MOVE    RECE841-TEKSTYMD     TO  RECE851-TEKSTYMD
      *
           .
       800-RECE841-SET851-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８４９ＷＲＩＴＥ処理
      *****************************************************************
       800-RECE849-WRITE-SEC           SECTION.
      *
           WRITE   RECE849-REC
           IF      STS-RECE849         =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
      *
               MOVE    3                   TO  WRK-ERR-FLG
               MOVE    RECE849PARA         TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE849         TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           ADD     1                   TO  CNT-RECE849
      *
           .
       800-RECE849-WRITE-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８５９ＷＲＩＴＥ処理
      *****************************************************************
       800-RECE859-WRITE-SEC           SECTION.
      *
           WRITE   RECE859-REC
           IF      STS-RECE859         =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
      *
               MOVE    3                   TO  WRK-ERR-FLG
               MOVE    RECE859PARA         TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE859         TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           ADD     1            TO   CNT-RECE859
      *
           .
       800-RECE859-WRITE-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８４１ＷＲＩＴＥ処理
      *****************************************************************
       800-RECE841-WRITE-SEC           SECTION.
      *
           MOVE    RECE849-CDKBN-KBNNUM
                                      TO  RECE841-CDKBN-KBNNUM
      *
           IF      RECE841-SRYKBN      =   "99"
               IF      RECE841-SRYSYUKBN   =   "991"
                   MOVE    "99"            TO  RECE841-SRYKBN
               ELSE
                   MOVE    "01"            TO  RECE841-SRYKBN
               END-IF
           ELSE
               IF      RECE841-SRYKBN   =   "64"
                   MOVE    "60"            TO  RECE841-SRYKBN
               END-IF
           END-IF
      *
           WRITE   RECE841-REC
           IF      STS-RECE841         =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
      *
               MOVE    3                   TO  WRK-ERR-FLG
               MOVE    RECE841PARA         TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE841         TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           ADD     1                 TO      CNT-RECE84
      *
           .
       800-RECE841-WRITE-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト８５１ＷＲＩＴＥ処理
      *****************************************************************
       800-RECE851-WRITE-SEC           SECTION.
      *
           WRITE   RECE851-REC
           IF      STS-RECE851         =   "00"
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
      *
               MOVE    3                   TO  WRK-ERR-FLG
               MOVE    RECE851PARA         TO  WRK-ERR-FILE-NM
               MOVE    STS-RECE851         TO  WRK-ERR-FILE-STS
               PERFORM 500-FILE-ERR-ABORT-SEC
           END-IF
      *
           ADD     1            TO   CNT-RECE85
      *
           .
       800-RECE851-WRITE-EXT.
           EXIT.
      *
      *
      *****************************************************************
      *    レセプト０２データ順検索処理
      *****************************************************************
       990-RECE82-READ-SEC           SECTION.
      *
           READ    RECE82-FILE         NEXT
               AT  END
                   MOVE    1           TO  FLG-END
               NOT AT  END
                   IF      STS-RECE82          =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE82PARA      TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE82      TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
      *            公務災害、種別不明のとき対象外
      *            指定医療機関ではないとき対象外
      *            ０９５９３で始まるコードがあるとき対象外
                   IF  (   RECE82-SRYYM        <   201307 )
                   OR  (   RECE82-PTNUM        =   SPACE  )
                   OR  (   RECE82-TSTPTNUMKBN  =   "1"    )
                   OR  (   RECE82-RECESYUBETU  =   ZERO
                                               OR  7061   )
                   OR  (   RECE82-ERR-ERRKBN   >   ZERO   )
                   OR  (   RECE82-RSIIRYOKBN   =   "0"    )
                   OR  ((  RECE82-HKNKBN    = "1" OR "2" ) AND
                        (  RECE82-TOTALKIN        = ZERO ) AND
                        (  RECE82-KINGAKU2-SYO    = ZERO ) AND
                        (  RECE82-SHOKUJITOTALKIN = ZERO ))
                   OR  (   RECE82-ORIGINALCDKBN
                                               =   1      )
                       GO  TO  990-RECE82-READ-SEC
                   END-IF
      *
                   ADD     1           TO  CNT-RECE82
      *
                   DISPLAY "RECE82  PTNUM=" RECE82-PTNUM
                                  " SRYYM=" RECE82-SRYYM
      *
           END-READ
      *
           .
       990-RECE82-READ-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト０４データ読み
      ****************************************************************
       990-RECE84-NEXT-SEC           SECTION.
      *
           READ    RECE84-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE84
               NOT AT  END
                   IF      STS-RECE84          =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE84PARA      TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE84      TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
                   MOVE    ZERO      TO  FLG-RECE84
           END-READ
      *
           .
       990-RECE84-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト８４９データ読み
      ****************************************************************
       990-RECE849-NEXT-SEC           SECTION.
      *
           READ    RECE849-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE849
               NOT AT  END
                   IF      STS-RECE849         =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE849PARA    TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE849     TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
                   MOVE    ZERO      TO  FLG-RECE849
           END-READ
      *
           .
       990-RECE849-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト８４１データ読み
      ****************************************************************
       990-RECE841-NEXT-SEC           SECTION.
      *
           READ    RECE841-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE841
               NOT AT  END
                   IF      STS-RECE841         =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE841PARA     TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE841     TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
                   MOVE    ZERO      TO  FLG-RECE841
           END-READ
      *
           .
       990-RECE841-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト０５データ読み
      ****************************************************************
       990-RECE85-NEXT-SEC           SECTION.
      *
           READ    RECE85-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE85
               NOT AT  END
                   IF      STS-RECE85          =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE85PARA      TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE85      TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
                   MOVE    ZERO      TO  FLG-RECE85
           END-READ
      *
           .
       990-RECE85-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト８５９データ読み
      ****************************************************************
       990-RECE859-NEXT-SEC           SECTION.
      *
           READ    RECE859-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE859
               NOT AT  END
                   IF      STS-RECE859         =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE859PARA     TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE859     TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
                   MOVE    ZERO      TO  FLG-RECE859
           END-READ
      *
           .
       990-RECE859-NEXT-EXT.
           EXIT.
      *
      ****************************************************************
      *    レセプト８５１データ読み
      ****************************************************************
       990-RECE851-NEXT-SEC           SECTION.
      *
           READ    RECE851-FILE       NEXT
               AT  END
                   MOVE    1         TO  FLG-RECE851
               NOT AT  END
                   IF      STS-RECE851         =   "00"
                       CONTINUE
                   ELSE
                       MOVE    SPACE           TO  WRK-ERR-AREA
                       INITIALIZE                  WRK-ERR-AREA
                       MOVE    2               TO  WRK-ERR-FLG
                       MOVE    RECE851PARA     TO  WRK-ERR-FILE-NM
                       MOVE    STS-RECE851     TO  WRK-ERR-FILE-STS
                       PERFORM 500-FILE-ERR-ABORT-SEC
                   END-IF
      *
                   MOVE    ZERO      TO  FLG-RECE851
           END-READ
      *
           .
       990-RECE851-NEXT-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定履歴マスタ読み込み
      *****************************************************************
       900-SANTEI-INV-SEC             SECTION.
      *
           MOVE    WRK-MCP-TABLE       TO  MCP-TABLE
           MOVE    WRK-MCP-PATHNAME    TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    WRK-MCP-TABLE       TO  MCP-TABLE
               MOVE    WRK-MCP-PATHNAME    TO  MCP-PATHNAME
               PERFORM 900-DBFETCH-SEC
               IF      MCP-RC              =   ZERO
                   MOVE    MCPDATA-REC         TO  SANTEI-REC
                   MOVE    ZERO                TO  FLG-SANTEI
               ELSE
                   MOVE    1                   TO  FLG-SANTEI
                   INITIALIZE                      SANTEI-REC
               END-IF
           ELSE
               MOVE    1                   TO  FLG-SANTEI
               INITIALIZE                      SANTEI-REC
           END-IF
      *
           MOVE    WRK-MCP-TABLE       TO  MCP-TABLE
           MOVE    WRK-MCP-PATHNAME    TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       900-SANTEI-INV-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定歴マスタ読み込み
      *****************************************************************
       900-SANTEI-READ-SEC         SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  SANTEI-REC
               MOVE    ZERO                TO  FLG-SANTEI
           ELSE
               INITIALIZE                      SANTEI-REC
               MOVE    1                   TO  FLG-SANTEI
           END-IF
      *
           .
       900-SANTEI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    入院履歴マスタ読み込み
      *****************************************************************
       900-PTNYUINRRK-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  PTNYUINRRK-REC
               MOVE    ZERO                TO  FLG-PTNYUINRRK
           ELSE
               INITIALIZE                      PTNYUINRRK-REC
               MOVE    1                   TO  FLG-PTNYUINRRK
           END-IF
      *
           .
       900-PTNYUINRRK-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    システム管理マスター読込
      *****************************************************************
       900-SYSKANRI-READ-SEC         SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SYS-1005-REC
               MOVE    ZERO            TO  FLG-SYSKANRI
           ELSE
               INITIALIZE                  SYS-1005-REC
               MOVE    1               TO  FLG-SYSKANRI
           END-IF
      *
           .
       900-SYSKANRI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    診療行為マスタ読み込み
      *****************************************************************
       900-SRYACT-READ-SEC         SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SRYACT-REC
               MOVE    ZERO            TO  FLG-SRYACT
           ELSE
               INITIALIZE                  SRYACT-REC
               MOVE    1               TO  FLG-SRYACT
           END-IF
      *
           .
       900-SRYACT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    算定履歴付加読込
      *****************************************************************
       900-SANTEIPLUS-READ-SEC           SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SANTEIPLUS-REC
               MOVE    ZERO            TO  FLG-SANTEIPLUS
           ELSE
               INITIALIZE                  SANTEIPLUS-REC
               MOVE    1               TO  FLG-SANTEIPLUS
           END-IF
      *
           .
       900-SANTEIPLUS-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    レセプト記載
      *****************************************************************
       900-RKISAI-READ-SEC           SECTION.
      *
           PERFORM 900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  RKISAI-REC
               MOVE    ZERO            TO  FLG-RKISAI
           ELSE
               INITIALIZE                  RKISAI-REC
               MOVE    1               TO  FLG-RKISAI
           END-IF
      *
           .
       900-RKISAI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    患者コメントマスタ読み込み
      *****************************************************************
       900-PTCOM-READ-SEC           SECTION.
      *
           MOVE     PTCOM-REC          TO  MCPDATA-REC
      *
           MOVE    "tbl_ptcom"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM 900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_ptcom"         TO  MCP-TABLE
               MOVE    "key"               TO  MCP-PATHNAME
               PERFORM 900-DBFETCH-SEC
               IF      MCP-RC              =   ZERO
                   MOVE    MCPDATA-REC         TO  PTCOM-REC
                   MOVE    ZERO                TO  FLG-PTCOM
               ELSE
                   MOVE    1                   TO  FLG-PTCOM
                   INITIALIZE                  PTCOM-REC
               END-IF
           ELSE
               MOVE    1                   TO  FLG-PTCOM
               INITIALIZE                  PTCOM-REC
           END-IF
      *
           MOVE    "tbl_ptcom"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM 900-CLOSE-SEC
      *
           .
       900-PTCOM-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    点数テーブルの検索
      *****************************************************************
       900-TENSU-TBL-SEC               SECTION.
      *
           INITIALIZE                           TNS-TENSU-REC
           MOVE    WRK-TENSU-SRYCD      TO      TNS-SRYCD
           MOVE    WRK-TENSU-SRYYM      TO      TNS-YUKOSTYMD(1:6)
           MOVE    "01"                 TO      TNS-YUKOSTYMD(7:2)
           MOVE    TNS-YUKOSTYMD        TO      TNS-YUKOEDYMD
           MOVE    SPA-HOSPNUM          TO      TNS-HOSPNUM
           MOVE    TNS-TENSU-REC        TO      MCPDATA-REC
           MOVE    "tbl_tensu"          TO      MCP-TABLE
           MOVE    "key"                TO      MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC               =       ZERO
               MOVE    "tbl_tensu"      TO      MCP-TABLE
               MOVE    "key"            TO      MCP-PATHNAME
               PERFORM   900-DBFETCH-SEC
               IF      MCP-RC           =       ZERO
                   MOVE    MCPDATA-REC  TO      TNS-TENSU-REC
                   MOVE    ZERO         TO      FLG-TENSU
               ELSE
                   INITIALIZE                   TNS-TENSU-REC
                   MOVE    1            TO      FLG-TENSU
               END-IF
           ELSE
               INITIALIZE                       TNS-TENSU-REC
               MOVE    1                TO      FLG-TENSU
           END-IF
      *
           MOVE    "tbl_tensu"          TO      MCP-TABLE
           MOVE    "key"                TO      MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       900-TENSU-TBL-EXT.
           EXIT.
      *
      *****************************************************************
      *    ジョブ管理ＤＢ制御処理
      *****************************************************************
       900-CALL-ORCSJOB-SEC            SECTION.
      *
           MOVE    WRK-PARA-JOBID  TO  JOB-JOBID
           MOVE    WRK-PARA-SHELLID
                                   TO  JOB-SHELLID
           MOVE    SPA-HOSPNUM     TO  JOB-HOSPNUM
           CALL    "ORCSJOB"       USING
                                   ORCSJOBKANRIAREA 
                                   JOBKANRI-REC
                                   SPA-AREA
           .
       900-CALL-ORCSJOB-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢＳＥＬＥＣＴ処理
      *****************************************************************
       900-DBSELECT-SEC                SECTION.
      *
           MOVE    "DBSELECT"          TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
           IF      MCP-RC              =   ZERO
               CONTINUE
           ELSE
               MOVE    SPACE               TO  WRK-ERR-AREA
               INITIALIZE                      WRK-ERR-AREA
               MOVE    MCP-RC              TO  WRK-MCP-RC
      *
               STRING  "ＤＢ読み込みエラー　TABLE="
                                           DELIMITED   BY  SIZE
                       MCP-TABLE           DELIMITED   BY  SPACE
                       " RC="              DELIMITED   BY  SIZE
                       WRK-MCP-RC          DELIMITED   BY  SIZE
                                           INTO    WRK-RECEERR
               END-STRING
               PERFORM 500-ERR-HENSYU-SEC
      *
               STRING  "ORCR0981 select err TABLE="
                                           DELIMITED   BY  SIZE
                       MCP-TABLE           DELIMITED   BY  SPACE
                       " PATHNAME="        DELIMITED   BY  SIZE
                       MCP-PATHNAME        DELIMITED   BY  SPACE
                       " RC="              DELIMITED   BY  SIZE
                       WRK-MCP-RC          DELIMITED   BY  SIZE
                       LOW-VALUE           DELIMITED   BY  SIZE
                                           INTO    WRK-ERRMSG
               END-STRING
               PERFORM 500-COBABORT-SEC
           END-IF
           .
       900-DBSELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢＦＥＴＣＨ処理
      *****************************************************************
       900-DBFETCH-SEC                SECTION.
      *
           MOVE    "DBFETCH"           TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-DBFETCH-EXT.
           EXIT.
      *
      *****************************************************************
      *    テーブルクローズ処理
      *****************************************************************
       900-CLOSE-SEC               SECTION.
      *
           MOVE    "DBCLOSECURSOR"     TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-CLOSE-EXT.
           EXIT.
      *
      *****************************************************************
      *    テーブルアクセス処理
      *****************************************************************
       900-ORCDBMAIN-SEC               SECTION.
      *
           CALL    "ORCDBMAIN"         USING   MCPAREA
                                               MCPDATA-REC
                                               SPA-AREA
           .
      *
       900-ORCDBMAIN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢ　オープン処理
      *****************************************************************
       120-DBOPEN-SEC                SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBOPEN"            TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBSTART"           TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
           .
       120-DBOPEN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢ　クローズ処理
      *****************************************************************
       900-DBDISCONNECT-SEC            SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBCOMMIT"          TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBDISCONNECT"      TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
           .
       900-DBDISCONNECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢ　ＣＯＭＭＩＴ処理
      *****************************************************************
       900-DBCOMMIT-SEC            SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBCOMMIT"          TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-DBCOMMIT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ＤＢ　ＳＴＡＲＴ処理
      *****************************************************************
       900-DBSTART-SEC                SECTION.
      *
           MOVE    LOW-VALUE           TO  MCP-TABLE
                                           MCP-PATHNAME
           MOVE    "DBSTART"           TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-DBSTART-EXT.
           EXIT.
