      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
       IDENTIFICATION              DIVISION.
       PROGRAM-ID.                 ORCSRNYURECEDEN.
      *****************************************************************
      *  ¥·¥¹¥Æ¥àÌ¾        : £Ï£Ò£Ã£Á
      *  ¥µ¥Ö¥·¥¹¥Æ¥àÌ¾    : Æþ±¡
      *  ¥³¥ó¥Ý¡¼¥Í¥ó¥ÈÌ¾  : Ï«ºÒ¥ì¥»ÅÅÍÑÆþ±¡²ñ·×¼èÆÀ¥µ¥Ö
      *  ´ÉÍý¼Ô            : 
      *  ºîÀ®ÆüÉÕ    ºî¶È¼Ô        µ­½Ò
      *  12/12/13    NACL¡Ý¾®Æ¦Âô  ¿·µ¬ºîÀ®
      *****************************************************************
      *  ¥×¥í¥°¥é¥à½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *Ê¿À®£³£°Ç¯£´·î²þÀµÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/02/27  Æþ±¡»þ¿©»öÎÅÍÜ¤Î¶â³ÛÊÑ¹¹ÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/04/4   Ìë´Ö´Ç¸îÂÎÀ©ÆÃÄêÆü¸º»»ÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/04/11  Â¾°å¼õ¿ÇÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/04/12  Æþ±¡ÎÁ²Ã»»ÃÖ¤­´¹¤¨ÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  18/04/16  °åÎÅ¶èÊ¬¡¢£Á£Ä£ÌÅÀ¿ô¾ðÊó¤Î
      *                                     µ­Ï¿¤òÊ¿À®£³£°Ç¯£³·îËø¤È¤¹¤ë
      *
      *ÎáÏÂ£²Ç¯£´·î²þÀµÂÐ±þ
      *  05.00.00    NACL-¾®Æ¦Âô  20/03/10  Æþ±¡´ðËÜÎÁ²Ã»»¶èÊ¬ÊÔ½¸
      *  05.00.00    NACL-¾®Æ¦Âô  20/04/13  Æþ±¡ÎÁ¤È²Ã»»¤ÎÌÀºÙ¿ô¹ç·×¤¬
      *                                     £±£¹¤òÄ¶¤¨¤¿»þ¤ËÅÀ¿ô¤¬µ­Ï¿
      *                                     ¤µ¤ì¤Ê¤¤ÉÔ¶ñ¹ç¤ò½¤Àµ
      *  05.00.00    NACL-¾®Æ¦Âô  20/11/06  ·îÆâ¤Î¿©»öÎÅÍÜÈñÊÑ¹¹¤ËÂÐ±þ
      *  05.01.00    ORCAMO       22/10/11  ´Ç¸î¿¦°÷½è¶ø²þÁ±É¾²ÁÎÁ£±¤«¤é
      *                                     £±£¶£µ¤Ï¥ì¥»ÅÅ¥µ¥ÖÊÖµÑÂÐ¾Ý³°
      *  05.02.00    ORCAMO       23/06/12  ´Ç¸î¿¦°÷½è¶ø²þÁ±É¾²ÁÎÁ£±¤«¤é
      *                                     £±£¶£µ¤ÎÈ½ÄêÊýË¡ÊÑ¹¹
      *  05.02.00    ORCAMO       23/06/20  Ï«ºÒÆþ±¡Ãæ¤ËÂ¾ÊÝ¸±¤Ç¿ÇÎÅÆþÎÏ
      *                                     ¤µ¤ì¤¿Æþ±¡ÎÁ²Ã»»¤Î½ü³°È½ÄêÄÉ²Ã
      *  05.02.00    ORCAMO       24/06/17  ÎáÏÂ£¶Ç¯²þÀµÂÐ±þ
      *                                     Æþ±¡»þ¿©»öÎÅÍÜÈñ¤Î¶â³ÛÊÑ¹¹ÂÐ±þ
      *                                     ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÃ»¼ê£³¡ËÂÐ±þ
      *                           24/06/18  Æþ±¡ÎÁ²Ã»»Åù¤ÎÏ«ºÒ¿·Àß¥³¡¼¥ÉÂÐ±þ
      *                                     ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅöÂÐ±þ
      *****************************************************************
      *
      *
       ENVIRONMENT                 DIVISION.
       CONFIGURATION               SECTION.
       INPUT-OUTPUT                SECTION.
       FILE-CONTROL.
      *
      *
       DATA                        DIVISION.
      *FILE                        SECTION.
      *
       WORKING-STORAGE             SECTION.
      *
      *    ¥Õ¥é¥°ÎÎ°è
       01  FLG-AREA.
           03  FLG-NYUINACCT               PIC 9(01).
           03  FLG-NYUINACT                PIC 9(01).
           03  FLG-SRYACCT                 PIC 9(01).
           03  FLG-SRYACT                  PIC 9(01).
           03  FLG-TENSU                   PIC 9(01).
           03  FLG-PTINF                   PIC 9(01).
           03  FLG-SYSKANRI                PIC 9(01).
           03  FLG-HKNCOMBI                PIC 9(01).
           03  FLG-ROUSAI                  PIC 9(01).
           03  FLG-RYAKU                   PIC 9(01).
           03  FLG-OK                      PIC 9(01).
           03  FLG-KSN                     PIC 9(01).
           03  FLG-TENSUWRK                PIC 9(01).
           03  FLG-TOKU-SET                PIC 9(01).
           03  FLG-TOKU-SHOKU              PIC 9(01).
      *    Åº»úÎÎ°è
       01  IDX-AREA.
           03  IDX                         PIC 9(04).
           03  IDX1                        PIC 9(04).
           03  IDX2                        PIC 9(04).
           03  IDX3                        PIC 9(04).
           03  IDX4                        PIC 9(04).
           03  IDX5                        PIC 9(04).
           03  IDX6                        PIC 9(04).
           03  IDX7                        PIC 9(04).
           03  IDY                         PIC 9(04).
           03  KSN-IDX                     PIC 9(04).
           03  IDV                         PIC 9(02).
           03  IDX-ADL                     PIC 9(04).
           03  MATOME-IDX                  PIC 9(04).
           03  CIDX                        PIC 9(04).
           03  CIDX2                       PIC 9(04).
           03  IDX-DAY                     PIC 9(04).
           03  IDX-NYUKSN                  PIC 9(02).
           03  IDX-CHUKSN0                 PIC 9(02).
           03  IDX-CHUKSN0S                PIC 9(02).
           03  IDX-CHUKSN0SS               PIC 9(02).
           03  IDX-CHUKSN1                 PIC 9(02).
           03  IDX-CHUKSN1S                PIC 9(02).
           03  IDX-CHUKSN1SS               PIC 9(02).
           03  IDX-CHUKSN2                 PIC 9(02).
           03  IDX-CHUKSN2S                PIC 9(02).
           03  IDX-CHUKSN2SS               PIC 9(02).
      *
      *    ¥³¥ó¥¹¥¿¥ó¥ÈÃÍ
       01  CONSTANT-AREA.
      *    ÅÀ¿ô¥Þ¥¹¥¿ÆÉ¤ß¹þ¤ß¥ï¡¼¥¯ÍÑ
           03  TTNS-CONST-MAX              PIC 9(03) VALUE 200.
      *
      *    É¸·ç¡Ê£±£°£°Ê¬¤Î£±£°¸º³Û¡Ë
           03  CONS-HYOKETU1               PIC X(09) VALUE "190107890".
      *    É¸·ç¡Ê£±£°£°Ê¬¤Î£±£µ¸º³Û¡Ë
           03  CONS-HYOKETU2               PIC X(09) VALUE "190107990".
      *    É¸·ç¡Ê£±£°£°Ê¬¤Î£³¸º³Û¡Ë¡ÊÎ¥ÅçÅù¡Ë
           03  CONS-HYOKETU3               PIC X(09) VALUE "190108590".
      *    É¸·ç¡Ê£±£°£°Ê¬¤Î£²¸º³Û¡Ë¡ÊÎ¥ÅçÅù¡Ë
           03  CONS-HYOKETU4               PIC X(09) VALUE "190108690".
      *    Äê¿ôÄ¶²áÆþ±¡´ðËÜÎÁ¸º³Û¡Ê£±£°£°Ê¬¤Î£±£°¡Ë
           03  CONS-TEISU1                 PIC X(09) VALUE "190107690".
      *    Äê¿ôÄ¶²áÆþ±¡´ðËÜÎÁ¸º³Û¡Ê£±£°£°Ê¬¤Î£²£°¡Ë
           03  CONS-TEISU2                 PIC X(09) VALUE "190107790".
      *    Äê¿ôÄ¶²áÆþ±¡´ðËÜÎÁ¸º³Û¡Ê£±£°£°Ê¬¤Î£±£°¡Ë¡ÊÆÃÄêÆþ±¡ÎÁ¡Ë
           03  CONS-TEISU3                 PIC X(09) VALUE "190122990".
      *    Äê¿ôÄ¶²áÆþ±¡´ðËÜÎÁ¸º³Û¡Ê£±£°£°Ê¬¤Î£²£°¡Ë¡ÊÆÃÄêÆþ±¡ÎÁ¡Ë
           03  CONS-TEISU4                 PIC X(09) VALUE "190123090".
      *
      *    Ï«ºÒ¼£ÎÅ·×²è²Ã»»
           03  CONS-ROUSAI-CHIRYOU         PIC X(09) VALUE "101910050".
      *    ÉÂ°áÂßÍ¿ÎÁ
           03  CONS-ROUSAI-BYOUI           PIC X(09) VALUE "101910060".
      *
      *    Ê¿À®£²£¸Ç¯ÅÙ¿©»öÎÅÍÜ
      *    Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¡ÊÎ®Æ°¿©°Ê³°¡Ë
           03  CONS-SKJ-RYOYO-1-1          PIC X(09) VALUE "197000110".
      *    Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£²¡Ë¡ÊÎ®Æ°¿©°Ê³°¡Ë
           03  CONS-SKJ-RYOYO-2-1          PIC X(09) VALUE "197000710".
      *    Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¡ÊÎ®Æ°¿©¡Ë
           03  CONS-SKJ-RYOYO-1-2          PIC X(09) VALUE "197003110".
      *    Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£²¡Ë¡ÊÎ®Æ°¿©¡Ë
           03  CONS-SKJ-RYOYO-2-2          PIC X(09) VALUE "197003210".
      *
      *    °ì»þÎÎ°è
       01  WRK-AREA.
      *
           03  WRK-MM-X                    PIC X(02).
           03  WRK-MM-9     REDEFINES   WRK-MM-X
                                           PIC 9(02).
           03  WRK-GAIHAKU-SRYCD           PIC X(09).
           03  WRK-MEISAISU                PIC 9(03).
           03  WRK-KSNKBN                  PIC 9(03).
           03  WRK-CHUKSNCD-XXX            PIC X(04).
           03  WRK-NYUKHNKBN-XXX           PIC 9(03).
      *
      *    Æ±ÆüºÆÆþ±¡½èÍýÍÑ
           03  WRK-GETSUMATSU-YMD.
               05  WRK-GETSUMATSU-YY       PIC 9(04).
               05  WRK-GETSUMATSU-MM       PIC 9(02).
               05  WRK-GETSUMATSU-DD       PIC 9(02).
           03  WRK-DOUJITSU-KBN            PIC X(01).
      *
      *    Æþ±¡²ñ·×¥ï¡¼¥¯
           03  WRK-NYUIN-TABLE.
               05  WRK-NYUIN-TBL           OCCURS  31.
                   07  WRK-HKNCOMBI-DAY    PIC 9(03).
                   07  WRK-SRYKBN          PIC X(02).
                   07  WRK-NYUINKHN        PIC X(09).
                   07  WRK-SHOKIKSN        PIC X(09).
                   07  WRK-HYOUKETSU       PIC X(09).
                   07  WRK-TEISU           PIC X(09).
                   07  WRK-GAIHAKU         PIC X(09).
                   07  WRK-GAIHAKU2        PIC X(09).
                   07  WRK-NYUKHNKSNKBN    PIC 9(03).
                   07  WRK-GAIHAKU-KBN     PIC 9(02).
                   07  WRK-CHUKSNCD        PIC X(04).
                   07  WRK-NYUKHNKBN       PIC 9(03).
      *
      *    Æþ±¡²ñ·×ÊÂ¤ÓÂØ¤¨¥ï¡¼¥¯
           03  WRK-NYUIN-SORT-TABLE.
               05  WRK-NYUIN-SORT-TBL      OCCURS  31.
                   07  WRK-SO-MEISAISU     PIC 9(02).
                   07  WRK-SO-DAY-TBL.
                     09  WRK-SO-DAY        PIC 9(01)  OCCURS 31.
                   07  WRK-SO-HKNCOMBI-DAY PIC 9(03).
                   07  WRK-SO-SRYKBN       PIC X(02).
                   07  WRK-SO-SRYCD        PIC X(09)  OCCURS 30.
                   07  WRK-SO-SRYCDTOTAL   PIC 9(14).
                   07  WRK-SO-TEN          PIC 9(07).
                   07  WRK-SO-KAISU        PIC 9(02).
                   07  WRK-SO-ADL-TEN-MOJI PIC X(04).
                   07  WRK-SO-GAIHAKU-TBL.
                     09  WRK-SO-GAIHAKU-KBN  PIC 9(02)  OCCURS 31.
                   07  WRK-SO-IRYOADL-DAY  PIC 9(02).
      *
      *    Æ±°ìºÞ¤Þ¤È¤áÍÑÈæ³Ó¥­¡¼
           03  WRK-OLD-KEY.
               05  WRK-OLD-MEISAISU        PIC 9(02).
               05  WRK-OLD-HKNCOMBI-DAY    PIC 9(03).
               05  WRK-OLD-SRYCDTOTAL      PIC 9(14).
               05  WRK-OLD-TEN             PIC 9(07).
           03  WRK-NEW-KEY.
               05  WRK-NEW-MEISAISU        PIC 9(02).
               05  WRK-NEW-HKNCOMBI-DAY    PIC 9(03).
               05  WRK-NEW-SRYCDTOTAL      PIC 9(14).
               05  WRK-NEW-TEN             PIC 9(07).
      *
      *    ÎÅÍÜÉÂ¾²¥³¥á¥ó¥ÈÊÂ¤ÓÂØ¤¨¥ï¡¼¥¯
           03  WRK-IRYOADL-TABLE.
               05  WRK-IRYOADL-SORT-TBL      OCCURS  31.
                   07  WRK-IRYOADL-DAY          PIC 9(02).
                   07  WRK-IRYOADL-MEISAISU     PIC 9(02).
                   07  WRK-IRYOADL-SRYCD        PIC X(09)  OCCURS 30.
                   07  WRK-IRYOADL-SRYCDTOTAL   PIC 9(14).
                   07  WRK-IRYOADL-ADL-SRYCD    PIC X(09).
                   07  WRK-IRYOADL-TEN          PIC 9(07).
                   07  WRK-IRYOADL-TEN-MOJI     PIC X(04).
                   07  WRK-IRYOADL-ADL-SRYCD-H22 PIC X(09) OCCURS 4.
                   07  WRK-IRYOADL-TEN-H22      PIC 9(07)  OCCURS 4.
                   07  WRK-IRYOADL-TEN-MOJI-H22 PIC X(04)  OCCURS 4.
                   07  WRK-IRYOADL-GAITOU-TBL.
                     09  WRK-IRYOADL-GAITOU-KBN   PIC 9(01)  OCCURS 31.
      *
      *-------------------------------------------------------------
      *  Ê¿À®£²£´Ç¯£´·îÆþ±¡Ê¬¤«¤é¤ÎÃí²Ã»»ÂàÈòÎÎ°è
      *
      *    Ï«ºÒ¾è¿ô¤ÎÂÐ¾Ý¤È¤Ê¤ëÆþ±¡ÎÁ²Ã»»ÂàÈòÍÑ
           03  WRK-CHUKSN-AREA-0.
             05   WRK-CHUKSN-TBL-0      OCCURS  50.
               07  WRK-CHUKSN-SRYCD-0          PIC X(09).
               07  WRK-CHUKSN-CHUCD-0.
                 09  WRK-CHUKSN-CHUKSNCD-0     PIC X(04).
                 09  WRK-CHUKSN-CHUKSNTUBAN-0  PIC X(01).
               07  WRK-CHUKSN-ZAITEN-0         PIC 9(08).
               07  WRK-CHUKSN-DAY-0            PIC 9(03)  OCCURS 31.
      *
      *    Æþ±¡ÎÁ¡Ê£Á£±£°£°ÈÖÂæ¡Ë¡¢ÆÃÄêÆþ±¡ÎÁ¡Ê£Á£³£°£°ÈÖÂæ¡Ë¤ÎÃí²Ã»»ÂàÈòÍÑ
           03  WRK-CHUKSN-AREA-1.
             05   WRK-CHUKSN-TBL-1      OCCURS  50.
               07  WRK-CHUKSN-SRYCD-1          PIC X(09).
               07  WRK-CHUKSN-CHUCD-1.
                 09  WRK-CHUKSN-CHUKSNCD-1     PIC X(04).
                 09  WRK-CHUKSN-CHUKSNTUBAN-1  PIC X(01).
               07  WRK-CHUKSN-ZAITEN-1         PIC 9(08).
               07  WRK-CHUKSN-DAY-1            PIC 9(03)  OCCURS 31.
      *
      *    Æþ±¡´ðËÜÎÁÅù²Ã»»¡Ê£Á£²£°£°ÈÖÂæ¡Ë¤ÎÃí²Ã»»ÂàÈòÍÑ
           03  WRK-CHUKSN-AREA-2.
             05   WRK-CHUKSN-TBL-2      OCCURS  50.
               07  WRK-CHUKSN-SRYCD-2          PIC X(09).
               07  WRK-CHUKSN-CHUCD-2.
                 09  WRK-CHUKSN-CHUKSNCD-2     PIC X(04).
                 09  WRK-CHUKSN-CHUKSNTUBAN-2  PIC X(01).
               07  WRK-CHUKSN-ZAITEN-2         PIC 9(08).
               07  WRK-CHUKSN-DAY-2            PIC 9(03)  OCCURS 31.
      *
      *    Ãí²Ã»»°Ê³°¤Î²Ã»»ÂàÈòÍÑ
           03  WRK-NYUKSN-AREA-1.
             05   WRK-NYUKSN-TBL-1             OCCURS  50.
               07  WRK-NYUKSN-SRYCD-1          PIC X(09).
               07  WRK-NYUKSN-ZAITEN-1         PIC 9(08).
               07  WRK-NYUKSN-DAY-1            PIC 9(03)  OCCURS 31.
      *
      *    ÊÂ¤ÓÂØ¤¨»þ¤ÎÂàÈòÍÑ
           03  WRK-CHUKSN-TAIHI.
             05  WRK-CHUKSN-SRYCD-T          PIC X(09).
             05  WRK-CHUKSN-CHUCD-T.
               07  WRK-CHUKSN-CHUKSNCD-T     PIC X(04).
               07  WRK-CHUKSN-CHUKSNTUBAN-T  PIC X(01).
             05  WRK-CHUKSN-ZAITEN-T         PIC 9(08).
             05  WRK-CHUKSN-DAY-T            PIC 9(03)  OCCURS 31.
      *-------------------------------------------------------------
      *
      *    ¿ÇÎÅ¥³¡¼¥É·×½¸·×ÍÑ
           03  WRK-SRYCD-X                 PIC X(09).
           03  WRK-SRYCD-9    REDEFINES    WRK-SRYCD-X
                                           PIC 9(09).
      *
      *    ¥·¥¹¥Æ¥à´ÉÍý¿©»öÂàÈòÎÎ°è
           03  WRK-SYS5000-SKJ             OCCURS  5.
               05  WRK-SYS5000-SHOKUCD     PIC X(09) OCCURS 31.
      *    ¿©»ö¥ï¡¼¥¯
           03  WRK-SKJ-HKNCOMBI-ASA        PIC 9(03) OCCURS 31.
           03  WRK-SKJ-HKNCOMBI-HIRU       PIC 9(03) OCCURS 31.
           03  WRK-SKJ-HKNCOMBI-YORU       PIC 9(03) OCCURS 31.
      *    ¿©Æ²²Ã»»È½ÄêÍÑ¿©»ö¥ï¡¼¥¯
           03  WRK-SKJ-ASA-ARI             PIC 9(03) OCCURS 31.
           03  WRK-SKJ-HIRU-ARI            PIC 9(03) OCCURS 31.
      *
      *    ¿©»ö¥ï¡¼¥¯£´¡Ê¿©»öÎÅÍÜÈñ¡Ë¡ÊÊ¿À®£±£¸Ç¯£´·î°Ê¹ß¡Ë
           03  WRK-SKJ4-TABLE.
               05  WRK-SKJ4-TBL          OCCURS  93.
                   07  WRK-SKJ4-HKNCOMBI-DAY   PIC 9(03).
                   07  WRK-SKJ4-RYOYO          PIC X(09).
                   07  WRK-SKJ4-KAISU          PIC 9(02).
      *    ¿©»ö¥ï¡¼¥¯£µ¡ÊÆÃÊÌ¿©²Ã»»¡Ë¡ÊÊ¿À®£±£¸Ç¯£´·î°Ê¹ß¡Ë
           03  WRK-SKJ5-TABLE.
               05  WRK-SKJ5-TBL          OCCURS  93.
                   07  WRK-SKJ5-HKNCOMBI-DAY   PIC 9(03).
                   07  WRK-SKJ5-TOKU-SHOKU     PIC X(09).
                   07  WRK-SKJ5-KAISU          PIC 9(02).
      *    ¿©»ö¥ï¡¼¥¯£¶¡Ê¿©Æ²²Ã»»¡Ë¡ÊÊ¿À®£±£¸Ç¯£´·î°Ê¹ß¡Ë
           03  WRK-SKJ6-TABLE.
               05  WRK-SKJ6-TBL          OCCURS  31.
                   07  WRK-SKJ6-HKNCOMBI-DAY   PIC 9(03).
                   07  WRK-SKJ6-SHOKUDOU       PIC X(09).
                   07  WRK-SKJ6-KAISU          PIC 9(02).
      *    ¿©»ö¥ï¡¼¥¯£·
           03  WRK-SKJ7-TABLE.
               05  WRK-SKJ7-TBL           OCCURS  31.
                   07  WRK-SKJ7-HKNCOMBI-DAY   PIC 9(03).
                   07  WRK-SKJ7-GRP.
                       09  WRK-SKJ7-RYOYO       PIC X(09).
                       09  WRK-SKJ7-RYOYO-SU    PIC 9(01).
                       09  WRK-SKJ7-RYOYO-RYU       PIC X(09).
                       09  WRK-SKJ7-RYOYO-RYU-SU    PIC 9(01).
                       09  WRK-SKJ7-SHOKUDOU    PIC X(09).
                       09  WRK-SKJ7-TOKU-SHOKU  PIC X(09).
                       09  WRK-SKJ7-TOKU-SHOKU-SU PIC 9(01).
                       09  WRK-SKJ7-TOKU-SHOKU-KAISU1 PIC 9(02).
                       09  WRK-SKJ7-TOKU-SHOKU-KAISU2 PIC 9(02).
                       09  WRK-SKJ7-TOKU-SHOKU-KAISU3 PIC 9(02).
                       09  WRK-SKJ7-SKJFTN      PIC X(09).
                       09  WRK-SKJ7-SKJFTN-SU   PIC 9(01).
                   07  WRK-SKJ7-SRYCDTOTAL      PIC 9(14).
                   07  WRK-SKJ7-KAISU           PIC 9(02).
                   07  WRK-SKJ7-DAY-TBL.
                       09  WRK-SKJ7-DAY         PIC 9(01)  OCCURS  31.
      *
      *
      *    ÅÀ¿ô¥Þ¥¹¥¿ÂàÈò¥ï¡¼¥¯
           03  WRK-TENSU-OCC                   OCCURS  200.
               05  WRK-TENSU-SRYCD             PIC X(09).
               05  WRK-TENSU-DATA              PIC X(2000).
           03  WRK-TENSU-CD                    PIC X(09).
           03  TTNS-IDX                        PIC 9(03).
           03  TTNS-MAX                        PIC 9(03).
      *
      *
      *    ³°Çñ¥³¥á¥ó¥ÈÍÑÆüÉÕÂàÈòÎÎ°è
           03  WRK-GAIHAKU-DAY-TABLE.
               05  WRK-GAIHAKU-DAY             OCCURS  31.
                   07  WRK-GAIHAKU-DAY-ST      PIC  9(02).
                   07  WRK-GAIHAKU-DAY-ED      PIC  9(02).
      *
      *    ÎÅÍÜ¥³¥á¥ó¥ÈÍÑÆüÉÕÂàÈòÎÎ°è
           03  WRK-RYOYO-DAY-TABLE.
               05  WRK-RYOYO-DAY               OCCURS  31.
                   07  WRK-RYOYO-DAY-ST        PIC  9(02).
                   07  WRK-RYOYO-DAY-ED        PIC  9(02).
      *
      *    Â¾ÊÝ¸±¤Ç¤Î¿©Æ²²Ã»»È½ÄêÍÑÎÎ°è
           03  WRK-TAHOKEN-SHOKUDOU-TABLE.
               05  WRK-TAHOKEN-SHOKUDOU-FLG    PIC  X(01)  OCCURS 31.
      *
      *    Æþ±¡ÎÁ»»Äê¤ÎÈ½ÄêÍÑÎÎ°è
           03  WRK-NACCT-DAY-TBL.
               05  WRK-NACCT-DAY               PIC  9(03)  OCCURS 31.
      *
      *    Ìë´Ö´Ç¸îÂÎÀ©ÆÃÄêÆü¸º»»ÎÎ°è
           03  WRK-KANGOGEN                    PIC X(09)   OCCURS 31.
      *
      *    ÆüÉÕÁ´³ÑÊÑ´¹ÎÎ°è
       01  TBL-DAY-AREA.
           03  FILLER              PIC X(04)  VALUE "£°£±".
           03  FILLER              PIC X(04)  VALUE "£°£²".
           03  FILLER              PIC X(04)  VALUE "£°£³".
           03  FILLER              PIC X(04)  VALUE "£°£´".
           03  FILLER              PIC X(04)  VALUE "£°£µ".
           03  FILLER              PIC X(04)  VALUE "£°£¶".
           03  FILLER              PIC X(04)  VALUE "£°£·".
           03  FILLER              PIC X(04)  VALUE "£°£¸".
           03  FILLER              PIC X(04)  VALUE "£°£¹".
           03  FILLER              PIC X(04)  VALUE "£±£°".
           03  FILLER              PIC X(04)  VALUE "£±£±".
           03  FILLER              PIC X(04)  VALUE "£±£²".
           03  FILLER              PIC X(04)  VALUE "£±£³".
           03  FILLER              PIC X(04)  VALUE "£±£´".
           03  FILLER              PIC X(04)  VALUE "£±£µ".
           03  FILLER              PIC X(04)  VALUE "£±£¶".
           03  FILLER              PIC X(04)  VALUE "£±£·".
           03  FILLER              PIC X(04)  VALUE "£±£¸".
           03  FILLER              PIC X(04)  VALUE "£±£¹".
           03  FILLER              PIC X(04)  VALUE "£²£°".
           03  FILLER              PIC X(04)  VALUE "£²£±".
           03  FILLER              PIC X(04)  VALUE "£²£²".
           03  FILLER              PIC X(04)  VALUE "£²£³".
           03  FILLER              PIC X(04)  VALUE "£²£´".
           03  FILLER              PIC X(04)  VALUE "£²£µ".
           03  FILLER              PIC X(04)  VALUE "£²£¶".
           03  FILLER              PIC X(04)  VALUE "£²£·".
           03  FILLER              PIC X(04)  VALUE "£²£¸".
           03  FILLER              PIC X(04)  VALUE "£²£¹".
           03  FILLER              PIC X(04)  VALUE "£³£°".
           03  FILLER              PIC X(04)  VALUE "£³£±".
       01  TBL-DAY-AREA-R          REDEFINES   TBL-DAY-AREA.
           03  TBL-DAY             PIC X(04)   OCCURS   31.
      *
      *****************************************************************
      *    ¥Õ¥¡¥¤¥ë¥ì¥¤¥¢¥¦¥È
      *****************************************************************
      *
      *    ¥·¥¹¥Æ¥à´ÉÍý¥Þ¥¹¥¿
           COPY    "CPSYSKANRI.INC".
      *
           COPY    "CPSK1001.INC".
           COPY    "CPSK5000.INC".
      *
      *    Æþ±¡¿ÇÎÅ²ñ·×¥Þ¥¹¥¿¡Ý
       01  NYUINACCT-REC.
           COPY    "CPNYUINACCT.INC".
      *
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼
       01  NYUINACT-REC.
           COPY    "CPNYUINACT.INC".
      *
      *    ¿ÇÎÅ²ñ·×
       01  SRYACCT-REC.
           COPY    "CPSRYACCT.INC".
      *
      *    ¿ÇÎÅ¹Ô°Ù
       01  SRYACT-REC.
           COPY    "CPSRYACT.INC".
      *
      *    ÅÀ¿ô¥Þ¥¹¥¿¡Ý
           COPY    "CPTENSU.INC".
      *
      *    ´µ¼Ô¥Þ¥¹¥¿¡Ý
       01  PTINF-REC.
           COPY    "CPPTINF.INC".
      *
      *    ÊÝ¸±ÁÈ¤ß¹ç¤ï¤»
       01  HKNCOMBI-REC.
           COPY    "CPHKNCOMBI.INC".
      *
      *
      *    £Ä£Â¸¡º÷
           COPY    "MCPDATA.INC".
      *
           COPY    "MCPAREA".
      *
      *****************************************************************
      *    ¥µ¥Ö¥×¥íÍÑ¡¡ÎÎ°è
      *****************************************************************
      *
      *   ÆüÉÕÊÑ´¹¥µ¥Ö
           COPY    "CPORCSDAY.INC".
           COPY    "CPORCSLNK.INC".
      *
      *    ÊÝ¸±»»ÄêÍÑÇ¯Îð¡¦³ä¹ç·×»»¥µ¥Ö
           COPY    "CPORCSAGECHK.INC".
      *
      *    ÎÅÍÜ¥ì¥»¥³¥á¥ó¥È¼èÆÀ¥µ¥Ö
           COPY    "CPORCSRYOCOM.INC".
      *
      *    Æþ±¡ÎÁÌ¤»»ÄêÆü¼èÆÀ¥µ¥Ö
           COPY    "CPORCSNYUINDAY.INC".
      *
      *    Ï«ºÒÆþ±¡²ñ·×ºîÀ®¥µ¥Ö
           COPY    "CPORCSROUNYUIN.INC".
      *
      *    ¿©»öÊÝ¸±¼èÆÀ¥µ¥Ö
           COPY    "CPORCSSKJHKN.INC".
      *
      *    Ìë´Ö´Ç¸îÂÎÀ©ÆÃÄêÆü¸º»»¼èÆÀ¥µ¥Ö
           COPY    "CPORCSKANGOGEN.INC".
      *
      *    Æþ±¡ÅÀ¿ô¥Þ¥¹¥¿ÉÕ²Ã¾ðÊó¥µ¥Ö
           COPY    "CPORCSNTENSU.INC".
      *
      *****************************************************************
      *    Ï¢Íí¡¡ÎÎ°è
      *****************************************************************
        LINKAGE                     SECTION.
      *
      *    ¥¹¥ÑÎÎ°è
           COPY    "COMMON-SPA".
      *    Æþ±¡²ñ·×ºîÀ®ÍÑ¥Ñ¥é¥á¥¿
           COPY    "CPORCSRNYURECEDEN.INC".
      *
       PROCEDURE                   DIVISION    USING
           ORCSRNYURECEDEN-AREA
           SPA-AREA
           .
      *
      *****************************************************************
      *    ¼ç¡¡¡¡½èÍý
      *****************************************************************
       000-PROC-SEC                SECTION.
      *
           INITIALIZE                  FLG-AREA
           INITIALIZE                  IDX-AREA
           INITIALIZE                  WRK-AREA
           INITIALIZE                  LNK-RNYURECEDEN-HENKYAKU-AREA
           MOVE    ZERO                TO  LNK-RNYURECEDEN-RC
      *
      *    ¥Ñ¥é¥á¡¼¥¿¥Á¥§¥Ã¥¯
           PERFORM 100-PRM-CHK-SEC
      *
      *    ¼ç½èÍý
           IF      LNK-RNYURECEDEN-RC      =    ZERO
               PERFORM 200-MAIN-SEC
           END-IF
      *
           .
       000-PROC-EXT.
      *
           EXIT    PROGRAM
           .
      *
      *****************************************************************
      *    ¥Ñ¥é¥á¡¼¥¿¥Á¥§¥Ã¥¯
      *****************************************************************
       100-PRM-CHK-SEC                     SECTION.
      *
      *    »»ÄêÇ¯·î¥Á¥§¥Ã¥¯
           IF    ( LNK-RNYURECEDEN-SANTEIYM    =   SPACE )
               MOVE    1               TO  LNK-RNYURECEDEN-RC
               GO  TO  100-PRM-CHK-EXT
           END-IF
      *
      *    ´µ¼Ô¥Þ¥¹¥¿¡¼¸¡º÷
           INITIALIZE                      PTINF-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  PTINF-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  PTINF-PTID
           PERFORM 900-PTINF-READ-SEC
           IF      FLG-PTINF           NOT =   ZERO
               MOVE    2               TO  LNK-RNYURECEDEN-RC
               GO  TO  100-PRM-CHK-EXT
           END-IF
      *
      *    ÊÝ¸±ÁÈ¹ç¤»ÈÖ¹æ¥Á¥§¥Ã¥¯
           IF     LNK-RNYURECEDEN-HKNCOMBI  NOT =   ZERO
               CONTINUE
           ELSE
               MOVE    3               TO  LNK-RNYURECEDEN-RC
               GO  TO  100-PRM-CHK-EXT
           END-IF
      *
      *    Æþ±¡Ãæ¤Î¥Á¥§¥Ã¥¯¡ÊÆþ±¡²ñ·×¥Þ¥¹¥¿¡¼¤ÎÊÝ¸±ÁÈ¹ç¤»¸¡º÷¡Ë
           INITIALIZE                      NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "5"                      TO  NACCT-ZAISKBKBN
           MOVE    "tbl_nyuinacct"          TO  MCP-TABLE
           MOVE    "key17"                  TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT            NOT =   ZERO
               MOVE    4                TO  LNK-RNYURECEDEN-RC
           ELSE
               MOVE    "tbl_nyuinacct"      TO  MCP-TABLE
               MOVE    "key17"              TO  MCP-PATHNAME
               PERFORM 910-NYUINACCT-READ-SEC
               IF   FLG-NYUINACCT           NOT =   ZERO
                    MOVE    4               TO  LNK-RNYURECEDEN-RC
               ELSE
                    PERFORM    VARYING   IDX1   FROM   1   BY   1
                               UNTIL     IDX1   >      31
                        IF     LNK-RNYURECEDEN-HKNCOMBI
                                            =  NACCT-DAY (IDX1)
                          MOVE   NACCT-DAY (IDX1) TO 
                                            WRK-HKNCOMBI-DAY(IDX1)
                        END-IF
                    END-PERFORM
               END-IF
           END-IF
      *
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *    °åÎÅµ¡´Ø¾ðÊó¤Î¼èÆÀ¡Ê¥·¥¹¥Æ¥à´ÉÍý¥Æ¡¼¥Ö¥ë¤è¤ê¡Ë
           MOVE    ZERO                TO  FLG-SYSKANRI
           INITIALIZE                      SYSKANRI-REC
           MOVE    "1001"              TO  SYS-KANRICD
           MOVE    "*"                 TO  SYS-KBNCD
           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                       TO  SYS-STYUKYMD(1:6)
           MOVE    "01"                TO  SYS-STYUKYMD(7:2)
           MOVE    SYS-STYUKYMD        TO  SYS-EDYUKYMD
           MOVE    LNK-RNYURECEDEN-HOSPNUM
                                       TO  SYS-HOSPNUM
           MOVE    SYSKANRI-REC        TO  MCPDATA-REC
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key10"             TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"  TO  MCP-TABLE
               MOVE    "key10"         TO  MCP-PATHNAME
               PERFORM  910-SYSKANRI-READ-SEC
               IF       FLG-SYSKANRI   =   0
                   MOVE   SYS-1001-HOSPSBT
                                       TO  SPA-HOSPSBT
               END-IF
           END-IF
      *    ¥·¥¹¥Æ¥à´ÉÍý¥¯¥í¡¼¥º
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key10"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *    ÊÝ¸±¶èÊ¬¤Ë¸ÇÄêÃÍ¤ò¥»¥Ã¥È
           MOVE    "4"                 TO  LNK-RNYURECEDEN-HKNKBN
      *
           .
       100-PRM-CHK-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¼ç½èÍý
      *****************************************************************
       200-MAIN-SEC            SECTION.
      *
           PERFORM   200-MAIN-1-SEC
      *
           .
       200-MAIN-EXT.
           EXIT.
      *
      *
      *****************************************************************
      *    ¼ç¼èÆÀ¡ÊÏ«ºÒ¥ì¥»ÅÅÊÖµÑ¥¨¥ê¥¢ÊÔ½¸¡Ë
      *****************************************************************
       200-MAIN-1-SEC            SECTION.
      *
      *Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¤È£³¤ÎÆþ±¡ÎÁÌ¤»»ÄêÆü¤Ë¤Ä¤¤¤Æ¼èÆÀ
           INITIALIZE                             ORCSNYUINDAY-AREA
           MOVE    LNK-RNYURECEDEN-HOSPNUM    TO  LNK-NYUINDAY-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID       TO  LNK-NYUINDAY-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM   TO  LNK-NYUINDAY-SANTEIYM
           CALL    "ORCSNYUINDAY"         USING   ORCSNYUINDAY-AREA
                                                  SPA-AREA
      *
      *¿©»ö¤ÎÊÝ¸±ÁÈ¹ç¤»¼èÆÀ
           INITIALIZE                             ORCSSKJHKN-AREA
           MOVE    LNK-RNYURECEDEN-HOSPNUM    TO  LNK-SKJHKN-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID       TO  LNK-SKJHKN-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM   TO  LNK-SKJHKN-SANTEIYM
           CALL    "ORCSSKJHKN"         USING     ORCSSKJHKN-AREA
                                                  ORCSNYUINDAY-AREA
                                                  SPA-AREA
      *
      *Ìë´Ö´Ç¸îÂÎÀ©ÆÃÄêÆü¸º»»¼èÆÀ
           IF      LNK-RNYURECEDEN-SANTEIYM   >=  "201804"
             INITIALIZE                           ORCSKANGOGEN-AREA
             MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  LNK-KANGOGEN-HOSPNUM
             MOVE    LNK-RNYURECEDEN-PTID     TO  LNK-KANGOGEN-PTID
             MOVE    LNK-RNYURECEDEN-SANTEIYM TO  LNK-KANGOGEN-SANTEIYM
             CALL    "ORCSKANGOGEN"     USING     ORCSKANGOGEN-AREA
                                                  SPA-AREA
             IF      LNK-KANGOGEN-RC          =   ZERO
               PERFORM    VARYING   IDX1  FROM   1   BY   1
                           UNTIL    IDX1   >    31
                 MOVE  LNK-KANGOGEN-SRYCD(IDX1) TO  WRK-KANGOGEN(IDX1)
               END-PERFORM
             END-IF
           END-IF
      *
      *Ï«ºÒ¤«¤éÏ«ºÒ¤Ø¤ÎÆ±ÆüºÆÆþ±¡¤ÇÊÝ¸±ÁÈ¹ç¤»¤¬ÊÑ¹¹¤È¤Ê¤é¤Ê¤¤¾ì¹ç¤Ï
      *Æ±ÆüºÆÆþ±¡°·¤¤¤È¤¹¤ëÉ¬Í×¤¬¤Ê¤¤¤Î¤Ç¡¢"ORCSNYUINDAY"¤ÎÊÖµÑÃÍ¤ò
      *¥¯¥ê¥¢¤¹¤ë¤³¤È¤È¤¹¤ë
      **     PERFORM    VARYING   IDX1   FROM   1   BY   1
      **                UNTIL     IDX1   >   31
      **         IF  (LNK-NYUINDAY-DOUJITSU-KBN(IDX1)  = "1")
      **         AND (LNK-NYUINDAY-DOUJITSU-HKNHENKBN(IDX1) = "4")
      **         AND (LNK-RNYURECEDEN-HKNCOMBI  =
      **                         LNK-NYUINDAY-DOUJITSU-HKNCOMBI(IDX1))
      **         AND (LNK-RNYURECEDEN-HKNCOMBI  =
      **                         LNK-NYUINDAY-DOUJITSU-T-HKNCOMBI(IDX1))
      *            Æ±ÆüºÆÆþ±¡¶èÊ¬¤ÈÊÝ¸±ÊÑÆ°¶èÊ¬¤ò¥¯¥ê¥¢
      **             MOVE  SPACE TO LNK-NYUINDAY-DOUJITSU-KBN(IDX1)
      **             MOVE  SPACE TO LNK-NYUINDAY-DOUJITSU-HKNHENKBN(IDX1)
      **         END-IF
      **     END-PERFORM
      *¿©»ö»»ÄêÍÑ¤ÎÊÝ¸±ÁÈ¹ç¤»È½ÄêÎÎ°è¤Ë¥»¥Ã¥È
           PERFORM    VARYING   IDX   FROM   1   BY   1
                      UNTIL      IDX  >    31
               IF     WRK-HKNCOMBI-DAY(IDX)   NOT =   ZERO
                   IF (WRK-HKNCOMBI-DAY(IDX) =
                                 LNK-RNYURECEDEN-HKNCOMBI)
                       MOVE   WRK-HKNCOMBI-DAY(IDX)
                                   TO   WRK-SKJ-HKNCOMBI-ASA(IDX)
                                        WRK-SKJ-HKNCOMBI-HIRU(IDX)
                                        WRK-SKJ-HKNCOMBI-YORU(IDX)
                   END-IF
               END-IF
           END-PERFORM
      *
      *Æ±ÆüºÆÆþ±¡Æü¤ÎÊÝ¸±ÁÈ¹ç¤»ÊÔ½¸
           PERFORM    VARYING   IDX   FROM   1   BY   1
                      UNTIL      IDX  >    31
               IF     LNK-NYUINDAY-DOUJITSU-KBN(IDX)   =   "1"
      *            Âà±¡Ê¬
                   IF (LNK-NYUINDAY-DOUJITSU-T-HKNCOMBI(IDX) =
                                 LNK-RNYURECEDEN-HKNCOMBI)
                       IF     LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX) = "0"
                           MOVE   ZERO  TO   WRK-SKJ-HKNCOMBI-ASA(IDX)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                       IF     LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX) = "1"
                           MOVE   LNK-NYUINDAY-DOUJITSU-T-HKNCOMBI(IDX)
                                        TO   WRK-SKJ-HKNCOMBI-ASA(IDX)
                           MOVE   ZERO  TO   WRK-SKJ-HKNCOMBI-HIRU(IDX)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                       IF     LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX) = "2"
                           MOVE   LNK-NYUINDAY-DOUJITSU-T-HKNCOMBI(IDX)
                                        TO   WRK-SKJ-HKNCOMBI-ASA(IDX)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX)
                           MOVE   ZERO  TO   WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                       IF     LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX) = "3"
                           MOVE   LNK-NYUINDAY-DOUJITSU-T-HKNCOMBI(IDX)
                                        TO   WRK-SKJ-HKNCOMBI-ASA(IDX)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                   END-IF
      *            ºÆÆþ±¡Ê¬
                   IF (LNK-NYUINDAY-DOUJITSU-HKNCOMBI(IDX) =
                                 LNK-RNYURECEDEN-HKNCOMBI)
                       IF     LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX) = "1"
                           MOVE   LNK-NYUINDAY-DOUJITSU-HKNCOMBI(IDX)
                                        TO   WRK-SKJ-HKNCOMBI-ASA(IDX)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                       IF     LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX) = "2"
                           MOVE   LNK-NYUINDAY-DOUJITSU-HKNCOMBI(IDX)
                                        TO   WRK-SKJ-HKNCOMBI-HIRU(IDX)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                       IF     LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX) = "3"
                           MOVE   LNK-NYUINDAY-DOUJITSU-HKNCOMBI(IDX)
                                        TO   WRK-SKJ-HKNCOMBI-YORU(IDX)
                       END-IF
                   END-IF
               END-IF
           END-PERFORM
      *
      *·îËö¤ËÆ±ÆüºÆÆþ±¡»þ¤Î¥ì¥»ÅÅÂÐ¾ÝÊÝ¸±ÁÈ¹ç¤»ÈÖ¹æ¤Î¼èÆÀ
      *    ·îËöÆü¤ò¼èÆÀ
           INITIALIZE                      STS-AREA-DAY
           INITIALIZE                      LNK-DAY7-AREA
           MOVE    "71"                TO  LNK-DAY7-IRAI
           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                       TO  LNK-DAY7-YM
           CALL    "ORCSDAY"       USING   STS-AREA-DAY
                                           LNK-DAY7-AREA
           IF      STS-DAY-RC1         =   ZERO
               MOVE    LNK-DAY7-KOYOMI     TO  WRK-GETSUMATSU-YMD
           END-IF
      *
           MOVE    SPACE                   TO  WRK-DOUJITSU-KBN
      ***  IF (LNK-NYUINDAY-DOUJITSU-KBN(WRK-GETSUMATSU-DD) = "1") AND
      ***     (LNK-NYUINDAY-DOUJITSU-HKNCOMBI(WRK-GETSUMATSU-DD)
      ***                                  =  LNK-RNYURECEDEN-HKNCOMBI)
      ***       MOVE      "1"              TO  WRK-DOUJITSU-KBN
      ***  END-IF
           PERFORM    VARYING  IDX1   FROM  1  BY  1
             UNTIL    IDX1     >   31
             IF  (LNK-NYUINDAY-DOUJITSU-KBN(IDX1)       = "1"     )
             AND (LNK-NYUINDAY-DOUJITSU-HKNCOMBI(IDX1)  =
                                          LNK-RNYURECEDEN-HKNCOMBI)
                    MOVE      "1"              TO  WRK-DOUJITSU-KBN
             END-IF
           END-PERFORM
      *
      *¿©»öÊÝ¸±»ØÄê¤Çµ­Ï¿ÂÐ¾Ý¤È¤Ê¤ëÆþÎÏ¤¬¤¢¤ë¤«³ÎÇ§
           PERFORM    VARYING  IDX1   FROM  1  BY  1
             UNTIL    IDX1     >   31
                IF LNK-RNYURECEDEN-HKNCOMBI  =  LNK-SKJHKN-HKNCOMBINUM
                                                              (IDX1 1)
                    MOVE      "1"              TO  WRK-DOUJITSU-KBN
                END-IF
                IF LNK-RNYURECEDEN-HKNCOMBI  =  LNK-SKJHKN-HKNCOMBINUM
                                                              (IDX1 2)
                    MOVE      "1"              TO  WRK-DOUJITSU-KBN
                END-IF
           END-PERFORM
      *
      *¿©»öÊÝ¸±»ØÄê¤Çµ­Ï¿ÂÐ¾Ý¤È¤Ê¤ëÆþÎÏ¤¬¤¢¤ì¤ÐÊÝ¸±ÁÈ¹ç¤»ÈÖ¹æ¤ò¥»¥Ã¥È
           PERFORM    VARYING  IDX1   FROM  1  BY  1
             UNTIL    IDX1     >   31
      **          DISPLAY "IDX1 = " IDX1 
      **                  " T-SKJKBN = " 
      **                  LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)
      **                  " SAI-SKJKBN = " 
      **                  LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)
      *         Æþ±¡Ê¬¡ÊÂà±¡Ê¬¡Ë
                IF  LNK-SKJHKN-HKNCOMBINUM(IDX1 1) NOT = SPACE
                    IF   LNK-SKJHKN-HKNCOMBINUM(IDX1 1)  =
                                 LNK-RNYURECEDEN-HKNCOMBI
      *
      *                 Æ±ÆüºÆÆþ±¡Æü°Ê³°
                        IF   LNK-NYUINDAY-DOUJITSU-KBN(IDX1)  = SPACE
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 1)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
      *                 Ä«¿©¤Þ¤Ç
                        IF   LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)  = "1"
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 1)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                        END-IF
      *                 Ãë¿©¤Þ¤Ç
                        IF   LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)  = "2"
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 1)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                        END-IF
      *                 Í¼¿©¤Þ¤Ç
                        IF   LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)  = "3"
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 1)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
                    ELSE
      *                 ¥¯¥ê¥¢½èÍý
      *                 Æ±ÆüºÆÆþ±¡Æü°Ê³°
                        IF   LNK-NYUINDAY-DOUJITSU-KBN(IDX1)  = SPACE
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
      *                 Ä«¿©¤Þ¤Ç
                        IF   LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)  = "1"
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                        END-IF
      *                 Ãë¿©¤Þ¤Ç
                        IF   LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)  = "2"
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                        END-IF
      *                 Í¼¿©¤Þ¤Ç
                        IF   LNK-NYUINDAY-DOUJITSU-T-SKJKBN(IDX1)  = "3"
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
                    END-IF
                END-IF
      *         Æ±ÆüºÆÆþ±¡Ê¬
                IF  LNK-SKJHKN-HKNCOMBINUM(IDX1 2) NOT = SPACE
                    IF   LNK-SKJHKN-HKNCOMBINUM(IDX1 2)  =
                                 LNK-RNYURECEDEN-HKNCOMBI
      *
      *                 Ä«¿©¤«¤é
                        IF   LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)  = "1"
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 2)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
      *                 Ãë¿©¤«¤é
                        IF   LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)  = "2"
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 2)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
      *                 Í¼¿©¤«¤é
                        IF   LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)  = "3"
                            MOVE  LNK-SKJHKN-HKNCOMBINUM(IDX1 2)(2:3)
                                         TO  WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
                    ELSE
      *                 ¥¯¥ê¥¢½èÍý
      *                 Ä«¿©¤«¤é
                        IF   LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)  = "1"
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                             WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
      *                 Ãë¿©¤«¤é
                        IF   LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)  = "2"
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                             WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
      *                 Í¼¿©¤«¤é
                        IF   LNK-NYUINDAY-DOUJITSU-SKJKBN(IDX1)  = "3"
                            MOVE  ZERO
                                         TO  WRK-SKJ-HKNCOMBI-YORU(IDX1)
                        END-IF
                    END-IF
                END-IF
           END-PERFORM
      **     PERFORM    VARYING  IDX1   FROM  1  BY  1
      **       UNTIL    IDX1     >   31
      **         DISPLAY "IDX1 = " IDX1
      **         DISPLAY "WRK-SKJ-HKNCOMBI-ASA(IDX1)  = "
      **                  WRK-SKJ-HKNCOMBI-ASA(IDX1)
      **         DISPLAY "WRK-SKJ-HKNCOMBI-HIRU(IDX1) = "
      **                  WRK-SKJ-HKNCOMBI-HIRU(IDX1)
      **         DISPLAY "WRK-SKJ-HKNCOMBI-YORU(IDX1) = "
      **                  WRK-SKJ-HKNCOMBI-YORU(IDX1)
      **     END-PERFORM
      *
      *Ï«ºÒÆþ±¡²ñ·×ºîÀ®¥µ¥Ö¤Î¸Æ¤Ó½Ð¤·¡ÊÆþ±¡ÎÁ¤ÈÆþ±¡ÎÁ²Ã»»¤Î¼èÆÀ¡Ë
      *    ¿ÇÎÅ¥³¡¼¥É¼±ÊÌ  (LNK-SROUNYUIN-SRYCD-SK)
      *      £±¡§Æþ±¡ÎÁ
      *      £²¡§³°Çñ¡ÊÂ¾°åÎÅµ¡´Ø¼õ¿Ç´Þ¤à¡Ë
      *      £³¡§Æþ±¡ÎÁ²Ã»»¡ÊÏ«ºÒ¾è¿ôÂÐ¾ÝÊ¬¡Ë
      *      £´¡§Ï«ºÒ¾è¿ô
      *      £µ¡§½é´ü²Ã»»¡ÊÄ¹´ü¸º»»¡Ë
      *      £¶¡§É¸·ç¡¢Äê¿ôÄ¶²á
           INITIALIZE                      ORCSROUNYUIN-AREA
           MOVE    LNK-RNYURECEDEN-HOSPNUM
                                           TO  LNK-SROUNYUIN-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID
                                           TO  LNK-SROUNYUIN-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                           TO  LNK-SROUNYUIN-SANTEIYM
           MOVE    LNK-RNYURECEDEN-HKNCOMBI
                                           TO  LNK-SROUNYUIN-HKNCOMBI
           MOVE    SPACE                   TO  LNK-SROUNYUIN-RYAKUKBN
      *
           CALL    "ORCSROUNYUIN"      USING   MCPAREA
                                               ORCSROUNYUIN-AREA
                                               SPA-AREA
      **     IF   LNK-SROUNYUIN-RC   =   ZERO
      **        PERFORM    VARYING   IDX   FROM   1   BY   1
      **                    UNTIL    IDX    >    31
      *
      **            IF   LNK-SROUNYUIN-NYUIN-FLG(IDX)   =   "1"
      **                DISPLAY  "=  IDX  === " IDX
      **                DISPLAY  "=  ZAITEN = " LNK-SROUNYUIN-ZAITEN(IDX)
      **                DISPLAY  "=  KSNTEN = " 
      **                                 LNK-SROUNYUIN-ZAITEN-NACCT(IDX)
      **                PERFORM   VARYING  IDY  FROM  1  BY  1
      **                  UNTIL   IDY      >  7
      **                     DISPLAY "==  IDY  ===" IDY
      **                     MOVE    LNK-RNYURECEDEN-HOSPNUM
      **                                           TO  TNS-HOSPNUM
      **                     MOVE    LNK-SROUNYUIN-SRYCD(IDX IDY)
      **                                           TO  TNS-SRYCD
      **                     MOVE    LNK-RNYURECEDEN-SANTEIYM
      **                                           TO  TNS-YUKOSTYMD(1:6)
      **                     MOVE    "01"          TO  TNS-YUKOSTYMD(7:2)
      **                     MOVE    TNS-YUKOSTYMD TO  TNS-YUKOEDYMD
      **                     PERFORM   910-TENSU-READ-SEC
      **                     DISPLAY  "LNK-SROUNYUIN-SRYCD(IDX IDY) = "
      **                               LNK-SROUNYUIN-SRYCD(IDX IDY)
      **                              " (" 
      **                               LNK-SROUNYUIN-SRYCD-SK(IDX IDY)
      **                              ") " 
      **                               TNS-NAME(1:50)
      **                END-PERFORM
      **            END-IF
      *
      **        END-PERFORM
      *
      **     END-IF
      *
      *
      *Æþ±¡ÎÁ¤Î¼èÆÀ
           MOVE    ZERO                    TO  FLG-OK
           MOVE    SPACE                   TO  WRK-NACCT-DAY-TBL
           INITIALIZE                          WRK-NACCT-DAY-TBL
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "1"                     TO  NACCT-ZAISKBKBN
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               MOVE    "key17"             TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   UNTIL   (FLG-NYUINACCT    =   1)
                   MOVE      ZERO     TO      FLG-RYAKU
                                              WRK-KSNKBN
                   MOVE      SPACE    TO      WRK-CHUKSNCD-XXX
                   MOVE      ZERO     TO      WRK-NYUKHNKBN-XXX
                   IF    NACCT-SRYCDTOTAL     =    99999916
                       CONTINUE
                   ELSE
      *                ³ºÅöÆþ±¡¹Ô°Ù¥Æ¡¼¥Ö¥ë¤ÎÆÉ¤ß¹þ¤ß
                       PERFORM    210-NYUINACT-GET-SEC
      *                Æþ±¡´ðËÜÎÁ¤È½é´ü²Ã»»¡ÊÄ¹´ü¸º»»¡Ë¤ÎÂàÈò
                       PERFORM    VARYING   IDX1   FROM   1   BY   1
                                  UNTIL     IDX1   >   31
                           IF     NACCT-DAY(IDX1)  NOT =  ZERO
                             MOVE   NACCT-DAY(IDX1)  TO   WRK-NACCT-DAY
                                                                (IDX1)
                           END-IF
                           IF    (WRK-HKNCOMBI-DAY(IDX1) NOT = ZERO)
                           AND   (NACCT-DAY(IDX1)    NOT =  ZERO)
                             MOVE    NSRY-SRYCD(1)   TO  
                                                   WRK-NYUINKHN(IDX1)
      *
      *                      Æþ±¡¤Î´ü´Ö²Ã»»
                             IF  (NSRY-SRYCD(2) NOT =  SPACE)  AND
                                 (NSRY-SRYCD(2) NOT = CONS-HYOKETU1 AND
                                                      CONS-HYOKETU2 AND
                                                      CONS-HYOKETU3 AND
                                                      CONS-HYOKETU4 AND
                                                      CONS-TEISU1   AND
                                                      CONS-TEISU2   AND
                                                      CONS-TEISU3   AND
                                                      CONS-TEISU4)
                                                                AND
                                   (NSRY-SRYCD(2)(1:3) NOT = "188")
                                   MOVE   NSRY-SRYCD(2)  TO
                                                   WRK-SHOKIKSN(IDX1)
                             END-IF
      *                      É¸·ç¥³¡¼¥É
                             IF  (NSRY-SRYCD(2)  NOT =   SPACE)  AND
                                 (NSRY-SRYCD(2)  =   CONS-HYOKETU1 OR
                                                     CONS-HYOKETU2 OR
                                                     CONS-HYOKETU3 OR
                                                     CONS-HYOKETU4)
                                 MOVE   NSRY-SRYCD(2)  TO
                                                 WRK-HYOUKETSU(IDX1)
                             END-IF
      *                      É¸·ç¥³¡¼¥É
                             IF  (NSRY-SRYCD(3)  NOT =   SPACE)  AND
                                 (NSRY-SRYCD(3)  =   CONS-HYOKETU1 OR
                                                     CONS-HYOKETU2 OR
                                                     CONS-HYOKETU3 OR
                                                     CONS-HYOKETU4)
                                 MOVE   NSRY-SRYCD(3)  TO
                                                   WRK-HYOUKETSU(IDX1)
                             END-IF
      *                      Äê¿ôÄ¶²á¥³¡¼¥É
                             IF  (NSRY-SRYCD(2)  NOT =   SPACE)  AND
                                 (NSRY-SRYCD(2)  =   CONS-TEISU1 OR
                                                     CONS-TEISU2 OR
                                                     CONS-TEISU3 OR
                                                     CONS-TEISU4)
                                 MOVE   NSRY-SRYCD(2)  TO
                                                 WRK-TEISU(IDX1)
                             END-IF
      *                      Äê¿ôÄ¶²á¥³¡¼¥É
                             IF  (NSRY-SRYCD(3)  NOT =   SPACE)  AND
                                 (NSRY-SRYCD(3)  =   CONS-TEISU1 OR
                                                     CONS-TEISU2 OR
                                                     CONS-TEISU3 OR
                                                     CONS-TEISU4)
                                 MOVE   NSRY-SRYCD(3)  TO
                                                 WRK-TEISU(IDX1)
                             END-IF
      *                      ¿ÇÎÅ¶èÊ¬
                             MOVE    NACCT-SRYKBN
                                              TO  WRK-SRYKBN(IDX1)
                             IF   FLG-RYAKU   =   ZERO
      *
      *                         ³°Çñ¥³¡¼¥ÉÊÔ½¸ÍÑ¤ËÆþ±¡´ðËÜÎÁ²Ã»»¶èÊ¬
      *                         ¤ÎÂàÈò
                                PERFORM   210-GAIHAKU-MAE-SEC
      *
                                MOVE    1     TO    FLG-RYAKU
                             END-IF
      *
                             MOVE  WRK-KSNKBN
                                         TO  WRK-NYUKHNKSNKBN(IDX1)
                             MOVE  WRK-CHUKSNCD-XXX
                                         TO  WRK-CHUKSNCD(IDX1)
                             MOVE  WRK-NYUKHNKBN-XXX
                                         TO  WRK-NYUKHNKBN(IDX1)
      *
                             MOVE    1    TO   FLG-OK
                         END-IF
                         IF    (WRK-HKNCOMBI-DAY(IDX1) NOT = ZERO)
                         AND   (LNK-NYUINDAY-KBN(IDX1)  =  "1")
                             MOVE    1    TO   FLG-OK
                         END-IF
                       END-PERFORM
                   END-IF
                   MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
                   MOVE    "key17"                 TO  MCP-PATHNAME
                   PERFORM 910-NYUINACCT-READ-SEC
               END-PERFORM
               IF  (FLG-OK     =   ZERO)   AND
                   (WRK-DOUJITSU-KBN   =   SPACE)
                   MOVE     4      TO      LNK-RNYURECEDEN-RC
      *            Æþ±¡²ñ·×¥¯¥í¡¼¥º
                   MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
                   MOVE    "key17"                 TO  MCP-PATHNAME
                   PERFORM   900-CLOSE-SEC
                   GO   TO    200-MAIN-1-EXT
               END-IF
           ELSE
               MOVE     4      TO      LNK-RNYURECEDEN-RC
      *        Æþ±¡²ñ·×¥¯¥í¡¼¥º
               MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
               MOVE    "key17"                 TO  MCP-PATHNAME
               PERFORM   900-CLOSE-SEC
               GO   TO    200-MAIN-1-EXT
           END-IF
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *    Æþ±¡ÎÁ¤Î»»Äê¤¬Ìµ¤¤Æü¤Ï¿©»öÊÝ¸±¤ò¥¯¥ê¥¢
           PERFORM    VARYING  IDX1   FROM  1  BY  1
             UNTIL    IDX1     >   31
              IF  (WRK-NYUINKHN(IDX1)    =    SPACE)    AND
                  (LNK-NYUINDAY-KBN(IDX1)  =  SPACE)    AND
                  (WRK-NACCT-DAY(IDX1)     =  ZERO)
                   MOVE  ZERO          TO  WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                           WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                           WRK-SKJ-HKNCOMBI-YORU(IDX1)
              END-IF
           END-PERFORM
      *
      *
      *Æþ±¡»þ¤Î³°Çñ¼èÆÀ
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "2"                     TO  NACCT-ZAISKBKBN
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               MOVE    "key17"             TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   UNTIL   (FLG-NYUINACCT    =   1)
      *            ³°Çñ¶èÊ¬¤ÎÂàÈò
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                              UNTIL     IDX1   >   31
                       IF    (WRK-NYUINKHN(IDX1) NOT = SPACE) 
                       AND   (NACCT-DAY(IDX1)    NOT =  ZERO) 
                              PERFORM     210-GAIHAKU-SET-SEC
                       END-IF
                   END-PERFORM
                   MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
                   MOVE    "key17"                 TO  MCP-PATHNAME
                   PERFORM 910-NYUINACCT-READ-SEC
               END-PERFORM
           END-IF
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *
      *¿©»öÎÅÍÜ¾ðÊó¤Î¼èÆÀ¡Ê¥·¥¹¥Æ¥à´ÉÍý¥Æ¡¼¥Ö¥ë¤è¤ê¡Ë
           MOVE    ZERO                TO  FLG-SYSKANRI
           INITIALIZE                      SYSKANRI-REC
           MOVE    "5000"              TO  SYS-KANRICD
           MOVE    "*"                 TO  SYS-KBNCD
           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                       TO  SYS-STYUKYMD(1:6)
           MOVE    "01"                TO  SYS-STYUKYMD(7:2)
           MOVE    SYS-STYUKYMD        TO  SYS-EDYUKYMD
           MOVE    LNK-RNYURECEDEN-HOSPNUM
                                       TO  SYS-HOSPNUM
           MOVE    SYSKANRI-REC        TO  MCPDATA-REC
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key10"             TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"  TO  MCP-TABLE
               MOVE    "key10"         TO  MCP-PATHNAME
               PERFORM  910-SYSKANRI-READ-SEC
      *        ¿©»ö¾ðÊó¤ÎÂàÈò
               PERFORM    VARYING   IDX  FROM  1  BY  1
                          UNTIL     IDX   >    31
      *            Æþ±¡»þ¿©»öÎÅÍÜÈñ
                   IF     SYS-5000-SHOKUJIRYOYOCD  NOT =  SPACE
                       MOVE  SYS-5000-SHOKUJIRYOYOCD
                                          TO WRK-SYS5000-SHOKUCD(1 IDX)
                   END-IF
               END-PERFORM
           END-IF
      *    ¥·¥¹¥Æ¥à´ÉÍý¥¯¥í¡¼¥º
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key10"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *·îÆâ¤Î¿©»öÎÅÍÜ¾ðÊó¤Î¼èÆÀ¡Ê¥·¥¹¥Æ¥à´ÉÍý¥Æ¡¼¥Ö¥ë¤è¤ê¡Ë
           MOVE    ZERO                TO  FLG-SYSKANRI
           INITIALIZE                      SYSKANRI-REC
           MOVE    "5000"              TO  SYS-KANRICD
           MOVE    "*"                 TO  SYS-KBNCD
           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                       TO  SYS-STYUKYMD(1:6)
           MOVE    "__"                TO  SYS-STYUKYMD(7:2)
           MOVE    LNK-RNYURECEDEN-HOSPNUM
                                       TO  SYS-HOSPNUM
           MOVE    SYSKANRI-REC        TO  MCPDATA-REC
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key11"             TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_syskanri"  TO  MCP-TABLE
               MOVE    "key11"         TO  MCP-PATHNAME
               PERFORM  910-SYSKANRI-READ-SEC
               PERFORM  UNTIL  FLG-SYSKANRI   =   1
                  MOVE  SYS-5000-STYUKYMD(7:2)   TO  IDV
      *           ¿©»ö¾ðÊó¤ÎÂàÈò
                  PERFORM    VARYING   IDX  FROM  IDV  BY  1
                             UNTIL     IDX   >    31
      *               Æþ±¡»þ¿©»öÎÅÍÜÈñ
                      IF     SYS-5000-SHOKUJIRYOYOCD  NOT =  SPACE
                          MOVE  SYS-5000-SHOKUJIRYOYOCD
                                       TO WRK-SYS5000-SHOKUCD(1 IDX)
                      END-IF
                  END-PERFORM
                  MOVE    "tbl_syskanri"  TO  MCP-TABLE
                  MOVE    "key11"         TO  MCP-PATHNAME
                  PERFORM  910-SYSKANRI-READ-SEC
               END-PERFORM
           END-IF
      *    ¥·¥¹¥Æ¥à´ÉÍý¥¯¥í¡¼¥º
           MOVE    "tbl_syskanri"      TO  MCP-TABLE
           MOVE    "key11"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *
      *¿©Æ²²Ã»»¼èÆÀ¡ÊÆþ±¡²ñ·×¤è¤ê¡Ë
           MOVE    ZERO                    TO  KSN-IDX
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key43"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE     "tbl_nyuinacct"    TO  MCP-TABLE
               MOVE     "key43"            TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   UNTIL   (FLG-NYUINACCT    =   1)
                 IF   NACCT-SRYCDTOTAL     =   197000570
      *            ¿©Æ²²Ã»»¤ÎÂàÈò
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                              UNTIL     IDX1   >   31
                       IF    (WRK-HKNCOMBI-DAY(IDX1) NOT = ZERO)
                       AND  ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO) OR
                             (WRK-GAIHAKU-KBN(IDX1) >=  4))
                       AND   (NACCT-DAY(IDX1)    NOT =  ZERO)
      *                  Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¤Î¾ì¹ç¤Î¤ß¥»¥Ã¥È
                           IF  WRK-SYS5000-SHOKUCD(1 IDX1)  =
                                                          "197000110"
                               MOVE  "197000570"
                                       TO WRK-SYS5000-SHOKUCD(3 IDX1)
      **                       DISPLAY  "== SHOKUDO-SET IDX1 = " IDX1
                           END-IF
                       END-IF
                   END-PERFORM
      *            ¿©Æ²²Ã»»¤ÎÂàÈò¡ÊÆ±ÆüºÆÆþ±¡Æü¡Ë
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                              UNTIL     IDX1   >   31
                       IF  (LNK-NYUINDAY-DOUJITSU-KBN(IDX1)  = "1")
                       AND (LNK-NYUINDAY-DOUJITSU-HKNHENKBN(IDX1) = "2"
                                                                 OR "4")
                       AND (LNK-RNYURECEDEN-HKNKBN  =
                                     LNK-NYUINDAY-DOUJITSU-HKNSYU(IDX1))
                       AND (NACCT-DAY(IDX1)    NOT =  ZERO)
      *                  Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¤Î¾ì¹ç¤Î¤ß¥»¥Ã¥È
                           IF  WRK-SYS5000-SHOKUCD(1 IDX1)  =
                                                          "197000110"
                               MOVE  "197000570"
                                       TO WRK-SYS5000-SHOKUCD(3 IDX1)
      **                       DISPLAY  "=== SHOKUDO-DOU-SET IDX1 = " IDX1
                           END-IF
                       END-IF
                   END-PERFORM
      *            ¿©Æ²²Ã»»¤ÎÂàÈò¡Ê¿©»ö¤ÎÊÝ¸±»ØÄêÆþÎÏÆü¡Ë
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                              UNTIL     IDX1   >   31
                       IF ((WRK-SKJ-HKNCOMBI-ASA(IDX1)  NOT =  ZERO) OR
                           (WRK-SKJ-HKNCOMBI-HIRU(IDX1) NOT =  ZERO) OR
                           (WRK-SKJ-HKNCOMBI-YORU(IDX1) NOT =  ZERO))
                       AND (NACCT-DAY(IDX1)    NOT =  ZERO)
      *                  Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¤Î¾ì¹ç¤Î¤ß¥»¥Ã¥È
                           IF  WRK-SYS5000-SHOKUCD(1 IDX1)  =
                                                          "197000110"
                               MOVE  "197000570"
                                       TO WRK-SYS5000-SHOKUCD(3 IDX1)
                           END-IF
                       END-IF
                   END-PERFORM
                 END-IF
                 MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
                 MOVE    "key43"                 TO  MCP-PATHNAME
                 PERFORM 910-NYUINACCT-READ-SEC
               END-PERFORM
           END-IF
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key43"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *
      *    Æþ±¡ÎÁ²Ã»»¼èÆÀ¡ÊÆþ±¡²ñ·×¡Ë
           MOVE    ZERO                    TO  KSN-IDX
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "6"                     TO  NACCT-ZAISKBKBN
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
             MOVE     "tbl_nyuinacct"      TO  MCP-TABLE
             MOVE     "key17"              TO  MCP-PATHNAME
             PERFORM   910-NYUINACCT-READ-SEC
             PERFORM   UNTIL   (FLG-NYUINACCT    =   1)
              IF       NACCT-ZAIKAISU   NOT =    ZERO
      *        ³ºÅöÆþ±¡¹Ô°Ù¥Æ¡¼¥Ö¥ë¤ÎÆÉ¤ß¹þ¤ß
               PERFORM    210-NYUINACT-GET-SEC
      *        ÅÀ¿ô¥Þ¥¹¥¿¤è¤êÃí²Ã»»¤ÎÈ½Äê
               INITIALIZE                      TNS-TENSU-REC
               MOVE    LNK-RNYURECEDEN-HOSPNUM
                                           TO  TNS-HOSPNUM
               MOVE    NSRY-SRYCD(1)       TO  TNS-SRYCD
               MOVE    LNK-RNYURECEDEN-SANTEIYM
                                           TO  TNS-YUKOSTYMD(1:6)
               MOVE    "01"                TO  TNS-YUKOSTYMD(7:2)
               MOVE    TNS-YUKOSTYMD       TO  TNS-YUKOEDYMD
               PERFORM   910-TENSU-READ-SEC
      *
      *        ÉÂ°áÂßÍ¿ÎÁ¤ÈÏ«ºÒ¼£ÎÅ·×²è²Ã»»¤Ï"ORCSRNYURECEDEN"¤ÎÊÖµÑ
      *        ÂÐ¾Ý³°¤È¤¹¤ë
               IF    NSRY-SRYCD(1)     =    "101910050"  OR
                     NSRY-SRYCD(2)     =    "101910050"  OR
                     NSRY-SRYCD(3)     =    "101910050"  OR
                     NSRY-SRYCD(4)     =    "101910050"  OR
                     NSRY-SRYCD(5)     =    "101910050"  OR
                     NSRY-SRYCD(1)     =    "101910060"  OR
                     NSRY-SRYCD(2)     =    "101910060"  OR
                     NSRY-SRYCD(3)     =    "101910060"  OR
                     NSRY-SRYCD(4)     =    "101910060"  OR
                     NSRY-SRYCD(5)     =    "101910060"
                   MOVE   "9999"       TO   TNS-CHUKSNCD
                   MOVE   999          TO   TNS-CDKBN-KBNNUM
               END-IF
      *
      *        Æþ±¡ÎÁ²Ã»»¤ÎÆâÍÆ¤òÏ«ºÒ¥Þ¥¹¥¿¤ÎÆâÍÆ¤ËÃÖ¤­´¹¤¨¤ë
      *        °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡Ê°ìÈÌÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190131570"
                 IF  LNK-RNYURECEDEN-SANTEIYM  >=  "201404"
                   MOVE   "9017"       TO   TNS-CHUKSNCD
                   MOVE   "6"          TO   TNS-CHUKSNTUBAN
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
                 ELSE
                   MOVE   "9017"       TO   TNS-CHUKSNCD
                   MOVE   "5"          TO   TNS-CHUKSNTUBAN
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
                 END-IF
               END-IF
      *        °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡ÊÀìÌçÉÂ±¡¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190134970"
                 IF  LNK-RNYURECEDEN-SANTEIYM  >=  "201404"
                   MOVE   "9030"       TO   TNS-CHUKSNCD
                   MOVE   "5"          TO   TNS-CHUKSNTUBAN
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
                 ELSE
                   MOVE   "9030"       TO   TNS-CHUKSNCD
                   MOVE   "4"          TO   TNS-CHUKSNTUBAN
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
                 END-IF
               END-IF
      *        ½ÅÅÙÇ§ÃÎ¾É²Ã»»¡ÊÀº¿ÀÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF   (NSRY-SRYCD(1)  =  "190118570")   AND
                    (LNK-RNYURECEDEN-SANTEIYM  <=  "201803")
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190167970"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ºßÂðÉüµ¢µ¡Ç½¶¯²½²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190168070"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        Ìë´Ö´Ç¸î²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190204570"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190240110"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÍ­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190242610"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *    ¤³¤³¤«¤éÎáÏÂ£¶Ç¯¿·ÀßÊ¬
      *        Ìë´Ö´Ç¸îÂÎÀ©²Ã»»¡Ê¾ã³²¼Ô»ÜÀßÅùÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190205770"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        Æþ±¡±ÉÍÜ´ÉÍýÂÎÀ©²Ã»»¡ÊÆÃÄêµ¡Ç½ÉÂ±¡Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190240210"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£±¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190829710"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£²¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190829810"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£³¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190829910"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *
      *-------------------------------------------------------------
      *        ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¤ÎÏ«ºÒÍÑ¥Þ¥¹¥¿¤Ï¹ð¼¨Åù¼±ÊÌ
      *        ¶èÊ¬¡Ê£±¡Ë¤Ï£¹¡ÊÄÌÂ§²Ã»»¹àÌÜ¡Ë¤À¤¬¡¢ÊÂ¤ÙÂØ¤¨¤Î°Ù
      *        £·¡Ê²Ã»»¹àÌÜ¡Ë¤ò¥»¥Ã¥È¤·¤Æ¤ª¤¯
      *-------------------------------------------------------------
      *        ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190182590"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÆÃÄêÆþ±¡ÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190182690"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÃ»¼ê£³¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190876890"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *-------------------------------------------------------------
      *        ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¤ÎÏ«ºÒÍÑ¥Þ¥¹¥¿¤Ï¹ð¼¨Åù¼±ÊÌ
      *        ¶èÊ¬¡Ê£±¡Ë¤Ï£¹¡ÊÄÌÂ§²Ã»»¹àÌÜ¡Ë¤À¤¬¡¢ÊÂ¤ÙÂØ¤¨¤Î°Ù
      *        £·¡Ê²Ã»»¹àÌÜ¡Ë¤ò¥»¥Ã¥È¤·¤Æ¤ª¤¯
      *-------------------------------------------------------------
      *        ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¡ÊÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190814310"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¡ÊÆÃÄêÆþ±¡ÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190814410"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *        ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¡ÊÃ»¼ê£³¡Ë¡ÊÏ«ºÒÍÑ¡Ë
               IF    NSRY-SRYCD(1)  =  "190876910"
                   MOVE   7            TO   TNS-KOKUJISKBKBN1
               END-IF
      *-------------------------------------------------------------
      *        Æþ±¡ÎÁ²Ã»»¤Ç¹ð¼¨Åù¼±ÊÌ¶èÊ¬£±¤¬£·¡ÊÃí²Ã»»¹àÌÜ¡Ë¤Î¤â¤Î¤Ç¡¢
      *        Ãí²Ã»»¤È¤Ê¤ë²Ã»»¤Ë¤Ä¤¤¤Æ¤Ï¡¢£±¡Ê´ðËÜ¹àÌÜ¡Ë¤ò¥»¥Ã¥È
      *        ¤·¤Æ¤ª¤¯
      *-------------------------------------------------------------
               IF   (TNS-KOKUJISKBKBN1   =   7)     AND
                    (TNS-CDKBN-KBN       =  "A")    AND
                   ((TNS-CDKBN-KBNNUM    >=  200)   AND
                    (TNS-CDKBN-KBNNUM    <=  299))  AND
                    (TNS-CHUKSNCD        NOT = "0000")  AND
                    (TNS-CHUKSNTUBAN     NOT = "0")
                   MOVE   1            TO   TNS-KOKUJISKBKBN1
               END-IF
      *
      *        ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë°Ê³°¤ÎÆþ±¡ÎÁ²Ã»»¤ÎÂàÈò
               IF   TNS-KOKUJISKBKBN1   NOT =   7
      *          ÉÂ°áÂßÍ¿ÎÁ¤ÈÏ«ºÒ¼£ÎÅ·×²è²Ã»»¤Ï½èÍýÂÐ¾Ý³°
                 IF    NSRY-SRYCD(1)     =    "101910050"  OR
                       NSRY-SRYCD(2)     =    "101910050"  OR
                       NSRY-SRYCD(3)     =    "101910050"  OR
                       NSRY-SRYCD(4)     =    "101910050"  OR
                       NSRY-SRYCD(5)     =    "101910050"  OR
                       NSRY-SRYCD(1)     =    "101910060"  OR
                       NSRY-SRYCD(2)     =    "101910060"  OR
                       NSRY-SRYCD(3)     =    "101910060"  OR
                       NSRY-SRYCD(4)     =    "101910060"  OR
                       NSRY-SRYCD(5)     =    "101910060"
                     CONTINUE
                 ELSE
                   ADD    1         TO  IDX-CHUKSN0
                   MOVE   NSRY-SRYCD(1) TO  WRK-CHUKSN-SRYCD-0
                                                      (IDX-CHUKSN0)
                   MOVE   TNS-CHUKSNCD  TO  WRK-CHUKSN-CHUKSNCD-0
                                                      (IDX-CHUKSN0)
                   MOVE   TNS-CHUKSNTUBAN
                                        TO  WRK-CHUKSN-CHUKSNTUBAN-0
                                                          (IDX-CHUKSN0)
                   MOVE   NACCT-ZAITEN  TO  WRK-CHUKSN-ZAITEN-0
                                                      (IDX-CHUKSN0)
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                     UNTIL     IDX1   >   31
                       IF   ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                             (LNK-NYUINDAY-KBN(IDX1) = "1"))
                       AND  ((WRK-GAIHAKU-KBN(IDX1) = ZERO) OR
                             (WRK-GAIHAKU-KBN(IDX1) >= 4))
                       AND   (NACCT-DAY(IDX1)    NOT =  ZERO)
                          MOVE   NACCT-DAY(IDX1)
                                          TO WRK-CHUKSN-DAY-0
                                                (IDX-CHUKSN0 IDX1)
                       END-IF
                   END-PERFORM
                   MOVE   "9999"       TO   TNS-CHUKSNCD
                   MOVE   999          TO   TNS-CDKBN-KBNNUM
                 END-IF
               END-IF
      *
      *
      *        ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë¤ÎÆþ±¡ÎÁ²Ã»»¤ÎÂàÈò
      *
               IF   TNS-CHUKSNCD     =   "0000"
                   ADD    1         TO  IDX-NYUKSN
                   MOVE   NSRY-SRYCD(1)    TO  WRK-NYUKSN-SRYCD-1
                                                      (IDX-NYUKSN)
                   MOVE   NACCT-ZAITEN     TO  WRK-NYUKSN-ZAITEN-1
                                                      (IDX-NYUKSN)
                   PERFORM    VARYING   IDX1   FROM   1   BY   1
                     UNTIL     IDX1   >   31
                        IF   ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                              (LNK-NYUINDAY-KBN(IDX1) = "1"))
                        AND  ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO) OR
                              (WRK-GAIHAKU-KBN(IDX1) >=  4))
                        AND   (NACCT-DAY(IDX1)    NOT =  ZERO)
                          MOVE   NACCT-DAY(IDX1)  TO WRK-NYUKSN-DAY-1
                                                      (IDX-NYUKSN IDX1)
                        END-IF
                   END-PERFORM
               ELSE
                 IF ((TNS-CDKBN-KBNNUM   >=   100)   AND
                     (TNS-CDKBN-KBNNUM   <=   199))  OR
                    ((TNS-CDKBN-KBNNUM   >=   300)   AND
                     (TNS-CDKBN-KBNNUM   <=   399))
                      ADD    1         TO  IDX-CHUKSN1
                      MOVE   NSRY-SRYCD(1) TO  WRK-CHUKSN-SRYCD-1
                                                      (IDX-CHUKSN1)
                      MOVE   TNS-CHUKSNCD  TO  WRK-CHUKSN-CHUKSNCD-1
                                                      (IDX-CHUKSN1)
                      MOVE   TNS-CHUKSNTUBAN
                                           TO  WRK-CHUKSN-CHUKSNTUBAN-1
                                                          (IDX-CHUKSN1)
                      MOVE   NACCT-ZAITEN  TO  WRK-CHUKSN-ZAITEN-1
                                                      (IDX-CHUKSN1)
                      PERFORM    VARYING   IDX1   FROM   1   BY   1
                        UNTIL     IDX1   >   31
                          IF   ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                                (LNK-NYUINDAY-KBN(IDX1) = "1"))
                          AND  ((WRK-GAIHAKU-KBN(IDX1) = ZERO) OR
                                (WRK-GAIHAKU-KBN(IDX1) >= 4))
                          AND   (NACCT-DAY(IDX1)    NOT =  ZERO)
                             MOVE   NACCT-DAY(IDX1)
                                                 TO WRK-CHUKSN-DAY-1
                                                     (IDX-CHUKSN1 IDX1)
                          END-IF
                      END-PERFORM
                 END-IF
      *
                 IF ((TNS-CDKBN-KBNNUM   >=   200)   AND
                     (TNS-CDKBN-KBNNUM   <=   299))
                    ADD    1         TO  IDX-CHUKSN2
                    MOVE   NSRY-SRYCD(1)   TO  WRK-CHUKSN-SRYCD-2
                                                     (IDX-CHUKSN2)
                    MOVE   TNS-CHUKSNCD    TO  WRK-CHUKSN-CHUKSNCD-2
                                                     (IDX-CHUKSN2)
                    MOVE   TNS-CHUKSNTUBAN TO  WRK-CHUKSN-CHUKSNTUBAN-2
                                                          (IDX-CHUKSN2)
                    MOVE   NACCT-ZAITEN    TO  WRK-CHUKSN-ZAITEN-2
                                                          (IDX-CHUKSN2)
                    PERFORM    VARYING   IDX1   FROM   1   BY   1
                      UNTIL     IDX1   >   31
                        IF   ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                              (LNK-NYUINDAY-KBN(IDX1) = "1"))
                        AND  ((WRK-GAIHAKU-KBN(IDX1) = ZERO) OR
                              (WRK-GAIHAKU-KBN(IDX1) >= 4))
                        AND   (NACCT-DAY(IDX1)    NOT =  ZERO)
                           MOVE   NACCT-DAY(IDX1)  TO WRK-CHUKSN-DAY-2
                                                     (IDX-CHUKSN2 IDX1)
                        END-IF
                    END-PERFORM
                 END-IF
               END-IF
      *
              END-IF
      *
              MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
              MOVE    "key17"                 TO  MCP-PATHNAME
              PERFORM 910-NYUINACCT-READ-SEC
      *
             END-PERFORM
      *
           END-IF
      *
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key17"                 TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *
      *    Æþ±¡ÎÁ²Ã»»¼èÆÀ¡Ê¿ÇÎÅ²ñ·×¡Ë
           INITIALIZE                          SRYACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  ACCT-HOSPNUM
           MOVE    "1"                     TO  ACCT-NYUGAIKBN
           MOVE    LNK-RNYURECEDEN-PTID     TO  ACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  ACCT-SRYYM
           MOVE    "tbl_sryacct"           TO  MCP-TABLE
           MOVE    "key30"                 TO  MCP-PATHNAME
           PERFORM 910-SRYACCT-SELECT-SEC
           IF      FLG-SRYACCT             =   ZERO
               MOVE    "tbl_sryacct"       TO  MCP-TABLE
               MOVE    "key30"             TO  MCP-PATHNAME
               PERFORM   910-SRYACCT-READ-SEC
               PERFORM   UNTIL   (FLG-SRYACCT    =   1)
                 MOVE      ZERO     TO      FLG-RYAKU
                 IF   (ACCT-ZAITEN    NOT =    ZERO)    AND
                      (ACCT-ZAIKAISU  NOT =    ZERO)    AND
                      (ACCT-ZAIKBN    =        ZERO)
                   IF   ACCT-SRYKBN  =  "90" OR "92"
                     INITIALIZE      SRYACT-REC
                     MOVE    ACCT-HOSPNUM   TO   SRY-HOSPNUM
                     MOVE    ACCT-NYUGAIKBN TO   SRY-NYUGAIKBN
                     MOVE    ACCT-PTID      TO   SRY-PTID
                     MOVE    ACCT-SRYKA     TO   SRY-SRYKA
                     MOVE    ACCT-SRYYM     TO   SRY-SRYYM
                     MOVE    ACCT-ZAINUM    TO   SRY-ZAINUM
                     MOVE    1              TO   SRY-RENNUM
                     MOVE    "tbl_sryact"   TO  MCP-TABLE
                     MOVE    "key"          TO  MCP-PATHNAME
                     PERFORM 910-SRYACT-SELECT-SEC
                     IF      FLG-SRYACT     =    ZERO
                        MOVE     "tbl_sryact"   TO  MCP-TABLE
                        MOVE     "key"          TO  MCP-PATHNAME
                        PERFORM   910-SRYACT-READ-SEC
                        IF  FLG-SRYACT    =    ZERO
      *                    ÅÀ¿ô¥Þ¥¹¥¿¤è¤êÃí²Ã»»¤ÎÈ½Äê
                           INITIALIZE                TNS-TENSU-REC
                           MOVE    LNK-RNYURECEDEN-HOSPNUM
                                                 TO  TNS-HOSPNUM
                           MOVE    SRY-SRYCD(1)  TO  TNS-SRYCD
                           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                                 TO  TNS-YUKOSTYMD(1:6)
                           MOVE    "01"          TO  TNS-YUKOSTYMD(7:2)
                           MOVE    TNS-YUKOSTYMD TO  TNS-YUKOEDYMD
                           PERFORM   910-TENSU-READ-SEC
      *
      *                    ´Ç¸î¿¦°÷½è¶ø²þÁ±É¾²ÁÎÁ£±¤«¤é£±£¶£µ¤Ï¥ì¥»ÅÅ
      *                    ÊÔ½¸¥µ¥Ö¤ÎÊÖµÑÂÐ¾Ý³°¡Ê³°ÇñÆü¤â»»Äê¤Î°Ù¡Ë
      *                     IF   (SRY-SRYCD(1)   >=  "190273510"   AND
      *                           SRY-SRYCD(1)   <=  "190289910")  OR
      *                          (SRY-SRYCD(2)   >=  "190273510"   AND
      *                           SRY-SRYCD(2)   <=  "190289910")  OR
      *                          (SRY-SRYCD(3)   >=  "190273510"   AND
      *                           SRY-SRYCD(3)   <=  "190289910")  OR
      *                          (SRY-SRYCD(4)   >=  "190273510"   AND
      *                           SRY-SRYCD(4)   <=  "190289910")  OR
      *                          (SRY-SRYCD(5)   >=  "190273510"   AND
      *                           SRY-SRYCD(5)   <=  "190289910")
                           IF   (TNS-CDKBN-KBN    =  "A")  AND
                                (TNS-CDKBN-KBNNUM =   500)
                              MOVE  "9999"   TO   TNS-CHUKSNCD
                              MOVE   999     TO   TNS-CDKBN-KBNNUM
                           END-IF
      *
      *                   ÉÂ°áÂßÍ¿ÎÁ¤ÈÏ«ºÒ¼£ÎÅ·×²è²Ã»»¤Ï
      *                   "ORCSRNYURECEDEN"¤ÎÊÖµÑÂÐ¾Ý³°¤È¤¹¤ë
                           IF    SRY-SRYCD(1)     =    "101910050"  OR
                                 SRY-SRYCD(2)     =    "101910050"  OR
                                 SRY-SRYCD(3)     =    "101910050"  OR
                                 SRY-SRYCD(4)     =    "101910050"  OR
                                 SRY-SRYCD(5)     =    "101910050"  OR
                                 SRY-SRYCD(1)     =    "101910060"  OR
                                 SRY-SRYCD(2)     =    "101910060"  OR
                                 SRY-SRYCD(3)     =    "101910060"  OR
                                 SRY-SRYCD(4)     =    "101910060"  OR
                                 SRY-SRYCD(5)     =    "101910060"
                               MOVE   "9999"      TO   TNS-CHUKSNCD
                               MOVE   999         TO   TNS-CDKBN-KBNNUM
                           END-IF
      *
      *                   Æþ±¡ÎÁ²Ã»»¤ÎÆâÍÆ¤òÏ«ºÒ¥Þ¥¹¥¿¤ÎÆâÍÆ¤ËÃÖ¤­´¹¤¨¤ë
      *                   °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡Ê°ìÈÌÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =    "190131570"
                            IF  LNK-RNYURECEDEN-SANTEIYM  >=  "201404"
                              MOVE   "9017"       TO   TNS-CHUKSNCD
                              MOVE   "6"          TO   TNS-CHUKSNTUBAN
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                            ELSE
                              MOVE   "9017"       TO   TNS-CHUKSNCD
                              MOVE   "5"          TO   TNS-CHUKSNTUBAN
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                            END-IF
                          END-IF
      *                   °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡ÊÀìÌçÉÂ±¡¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =    "190134970"
                            IF  LNK-RNYURECEDEN-SANTEIYM  >=  "201404"
                              MOVE   "9030"       TO   TNS-CHUKSNCD
                              MOVE   "5"          TO   TNS-CHUKSNTUBAN
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                            ELSE
                              MOVE   "9030"       TO   TNS-CHUKSNCD
                              MOVE   "4"          TO   TNS-CHUKSNTUBAN
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                            END-IF
                          END-IF
      *                   ½ÅÅÙÇ§ÃÎ¾É²Ã»»¡ÊÀº¿ÀÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF    (SRY-SRYCD(1)     =    "190118570")  AND
                                (LNK-RNYURECEDEN-SANTEIYM <= "201803")
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =    "190167970"
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ºßÂðÉüµ¢µ¡Ç½¶¯²½²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =    "190168070"
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   Ìë´Ö´Ç¸î²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =    "190204570"
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =    "190240110"
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÍ­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF     SRY-SRYCD(1)     =  "190242610"
                              MOVE   7            TO   TNS-KOKUJISKBKBN1
                          END-IF
      *
      *                   °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡Ê°ìÈÌÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900100"
                              MOVE   100          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡ÊÀìÌçÉÂ±¡¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900120"
                              MOVE   105          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ½ÅÅÙÇ§ÃÎ¾É²Ã»»¡ÊÀº¿ÀÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900110"
                              MOVE   103          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900130"
                              MOVE   101          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ºßÂðÉüµ¢µ¡Ç½¶¯²½²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900140"
                              MOVE   101          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   Ìë´Ö´Ç¸î²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF    SRY-SRYCD(1)      =   "101900170"
                              MOVE   101          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ¤³¤³¤«¤éÎáÏÂ£¶Ç¯¿·ÀßÊ¬
      *                   Ìë´Ö´Ç¸îÂÎÀ©²Ã»»¡Ê¾ã³²¼Ô»ÜÀßÅùÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF    SRY-SRYCD(1)  =  "190205770"
                               MOVE   7           TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   Æþ±¡±ÉÍÜ´ÉÍýÂÎÀ©²Ã»»¡ÊÆÃÄêµ¡Ç½ÉÂ±¡Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF    SRY-SRYCD(1)  =  "190240210"
                               MOVE   7           TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£±¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF    SRY-SRYCD(1)  =  "190829710"
                               MOVE   7           TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£²¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF    SRY-SRYCD(1)  =  "190829810"
                               MOVE   7           TO   TNS-KOKUJISKBKBN1
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£³¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF    SRY-SRYCD(1)  =  "190829910"
                               MOVE   7           TO   TNS-KOKUJISKBKBN1
                          END-IF
      *
      *                   Ìë´Ö´Ç¸îÂÎÀ©²Ã»»¡Ê¾ã³²¼Ô»ÜÀßÅùÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900200"
                              MOVE   106          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   Æþ±¡±ÉÍÜ´ÉÍýÂÎÀ©²Ã»»¡ÊÆÃÄêµ¡Ç½ÉÂ±¡Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900210"
                              MOVE   104          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£±¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900230"
                              MOVE   101          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£²¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900240"
                              MOVE   101          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£³¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
      *                   ¤òÄ¾ÀÜÆþÎÏ¤µ¤ì¤¿¾ì¹ç¤Ë¥³¡¼¥ÉÉ½ÍÑÈÖ¹æ¤ÎÈÖ¹æ¤¬
      *                   Äó¶¡¥Þ¥¹¥¿¤ËÌ¤ÀßÄê¤Î°Ù¡¢¥»¥Ã¥È¤ò¹Ô¤¦
                          IF     SRY-SRYCD(1)     =    "101900250"
                              MOVE   101          TO   TNS-CDKBN-KBNNUM
                          END-IF
      *
                        END-IF
                     END-IF
      *              ¿ÇÎÅ¹Ô°Ù¥¯¥í¡¼¥º
                     MOVE     "tbl_sryact"   TO  MCP-TABLE
                     MOVE     "key"          TO  MCP-PATHNAME
                     PERFORM   900-CLOSE-SEC
      *
      *-------------------------------------------------------------
      *             Æþ±¡ÎÁ²Ã»»¤Ç¹ð¼¨Åù¼±ÊÌ¶èÊ¬£±¤¬£·¡ÊÃí²Ã»»¹àÌÜ¡Ë¤Î¤â¤Î¤Ç¡¢
      *             Ãí²Ã»»¤È¤Ê¤ë²Ã»»¤Ë¤Ä¤¤¤Æ¤Ï¡¢£±¡Ê´ðËÜ¹àÌÜ¡Ë¤ò¥»¥Ã¥È
      *             ¤·¤Æ¤ª¤¯
      *-------------------------------------------------------------
                     IF   (TNS-KOKUJISKBKBN1   =   7)     AND
                          (TNS-CDKBN-KBN       =  "A")    AND
                         ((TNS-CDKBN-KBNNUM    >=  200)   AND
                          (TNS-CDKBN-KBNNUM    <=  299))  AND
                          (TNS-CHUKSNCD        NOT = "0000")  AND
                          (TNS-CHUKSNTUBAN     NOT = "0")
                         MOVE   1            TO   TNS-KOKUJISKBKBN1
                     END-IF
      *
      *              ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë°Ê³°¤ÎÆþ±¡ÎÁ²Ã»»¤ÎÂàÈò
                     IF   TNS-KOKUJISKBKBN1   NOT =   7
      *                ÉÂ°áÂßÍ¿ÎÁ¤ÈÏ«ºÒ¼£ÎÅ·×²è²Ã»»¤È´Ç¸î¿¦°÷½è¶ø²þÁ±É¾²ÁÎÁ¤Ï
      *                ½èÍýÂÐ¾Ý³°
                       IF    SRY-SRYCD(1)     =    "101910050"  OR
                             SRY-SRYCD(2)     =    "101910050"  OR
                             SRY-SRYCD(3)     =    "101910050"  OR
                             SRY-SRYCD(4)     =    "101910050"  OR
                             SRY-SRYCD(5)     =    "101910050"  OR
                             SRY-SRYCD(1)     =    "101910060"  OR
                             SRY-SRYCD(2)     =    "101910060"  OR
                             SRY-SRYCD(3)     =    "101910060"  OR
                             SRY-SRYCD(4)     =    "101910060"  OR
                             SRY-SRYCD(5)     =    "101910060"  OR
                            (SRY-SRYCD(1)     =   "190273510")  OR
                            (SRY-SRYCD(1)     >=   "190273610"  AND
                             SRY-SRYCD(1)     <=   "190289910") OR
                            (SRY-SRYCD(2)     =   "190273510")  OR
                            (SRY-SRYCD(2)     >=   "190273610"  AND
                             SRY-SRYCD(2)     <=   "190289910") OR
                            (SRY-SRYCD(3)     =   "190273510")  OR
                            (SRY-SRYCD(3)     >=   "190273610"  AND
                             SRY-SRYCD(3)     <=   "190289910") OR
                            (SRY-SRYCD(4)     =   "190273510")  OR
                            (SRY-SRYCD(4)     >=   "190273610"  AND
                             SRY-SRYCD(4)     <=   "190289910") OR
                            (SRY-SRYCD(5)     =   "190273510")  OR
                            (SRY-SRYCD(5)     >=   "190273610"  AND
                             SRY-SRYCD(5)     <=   "190289910")
      *                     ((TNS-CDKBN-KBN    =  "A")  AND
      *                      (TNS-CDKBN-KBNNUM =   500))
                           CONTINUE
                       ELSE
                         ADD    1         TO  IDX-CHUKSN0
                         MOVE   SRY-SRYCD(1) TO  WRK-CHUKSN-SRYCD-0
                                                       (IDX-CHUKSN0)
                         MOVE   TNS-CHUKSNCD TO WRK-CHUKSN-CHUKSNCD-0
                                                       (IDX-CHUKSN0)
                         MOVE   TNS-CHUKSNTUBAN
                                        TO  WRK-CHUKSN-CHUKSNTUBAN-0
                                                          (IDX-CHUKSN0)
                         MOVE   ACCT-ZAITEN TO WRK-CHUKSN-ZAITEN-0
                                                          (IDX-CHUKSN0)
                         PERFORM   VARYING  IDX1   FROM   1   BY   1
                           UNTIL     IDX1   >   31
                             IF  ((WRK-NYUINKHN(IDX1) NOT = SPACE) OR
                                  (LNK-NYUINDAY-KBN(IDX1) = "1"))
                             AND ((WRK-GAIHAKU-KBN(IDX1) = ZERO) OR
                                  (WRK-GAIHAKU-KBN(IDX1) >= 4))
                             AND  (ACCT-DAY(1 IDX1)    NOT =  ZERO)
                             AND  (ACCT-HKNCOMBI  =
                                                WRK-HKNCOMBI-DAY(IDX1))
                                MOVE   ACCT-DAY(1 IDX1)
                                              TO WRK-CHUKSN-DAY-0
                                                    (IDX-CHUKSN0 IDX1)
                             END-IF
                         END-PERFORM
                         MOVE   "9999"       TO   TNS-CHUKSNCD
                         MOVE   999          TO   TNS-CDKBN-KBNNUM
                      END-IF
                     END-IF
      *
      *             ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë¤ÎÆþ±¡ÎÁ²Ã»»¤ÎÂàÈò
                    IF  TNS-CHUKSNCD         =   "0000"
                       ADD    1              TO  IDX-NYUKSN
                       MOVE   SRY-SRYCD(1)   TO  WRK-NYUKSN-SRYCD-1
                                                        (IDX-NYUKSN)
                       MOVE   ACCT-ZAITEN    TO  WRK-NYUKSN-ZAITEN-1
                                                        (IDX-NYUKSN)
                       PERFORM    VARYING   IDX1   FROM   1   BY   1
                         UNTIL     IDX1   >   31
                         IF  ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                              (LNK-NYUINDAY-KBN(IDX1) = "1"))
                         AND ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO) OR
                              (WRK-GAIHAKU-KBN(IDX1)  >= 4))
                         AND  (ACCT-DAY(1 IDX1)    NOT =  ZERO)
                         AND   (ACCT-HKNCOMBI  =
                                                WRK-HKNCOMBI-DAY(IDX1))
                           MOVE   ACCT-DAY(1 IDX1)  TO WRK-NYUKSN-DAY-1
                                                      (IDX-NYUKSN IDX1)
                         END-IF
                       END-PERFORM
                    ELSE
      *
                      IF ((TNS-CDKBN-KBNNUM   >=   100)   AND
                          (TNS-CDKBN-KBNNUM   <=   199))  OR
                         ((TNS-CDKBN-KBNNUM   >=   300)   AND
                          (TNS-CDKBN-KBNNUM   <=   399))
                         ADD    1         TO  IDX-CHUKSN1
                         MOVE   SRY-SRYCD(1)
                                           TO  WRK-CHUKSN-SRYCD-1
                                                          (IDX-CHUKSN1)
                         MOVE   TNS-CHUKSNCD
                                           TO  WRK-CHUKSN-CHUKSNCD-1
                                                          (IDX-CHUKSN1)
                         MOVE   TNS-CHUKSNTUBAN
                                           TO  WRK-CHUKSN-CHUKSNTUBAN-1
                                                          (IDX-CHUKSN1)
                         MOVE   ACCT-ZAITEN
                                           TO  WRK-CHUKSN-ZAITEN-1
                                                          (IDX-CHUKSN1)
                         PERFORM    VARYING   IDX1   FROM   1   BY   1
                           UNTIL     IDX1   >   31
                            IF   ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                                  (LNK-NYUINDAY-KBN(IDX1) = "1"))
                            AND  ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO) OR
                                  (WRK-GAIHAKU-KBN(IDX1) >=  4))
                            AND   (ACCT-DAY(1 IDX1)    NOT =  ZERO)
                            AND   (ACCT-HKNCOMBI  =
                                                WRK-HKNCOMBI-DAY(IDX1))
                              MOVE   ACCT-DAY(1 IDX1)
                                                  TO  WRK-CHUKSN-DAY-1
                                                     (IDX-CHUKSN1 IDX1)
                            END-IF
                         END-PERFORM
                      END-IF
      *
                      IF ((TNS-CDKBN-KBNNUM   >=   200)   AND
                          (TNS-CDKBN-KBNNUM   <=   299))
                         ADD    1         TO  IDX-CHUKSN2
                         MOVE   SRY-SRYCD(1)
                                           TO  WRK-CHUKSN-SRYCD-2
                                                          (IDX-CHUKSN2)
                         MOVE   TNS-CHUKSNCD
                                           TO  WRK-CHUKSN-CHUKSNCD-2
                                                          (IDX-CHUKSN2)
                         MOVE   TNS-CHUKSNTUBAN
                                           TO  WRK-CHUKSN-CHUKSNTUBAN-2
                                                          (IDX-CHUKSN2)
                         MOVE   ACCT-ZAITEN
                                           TO  WRK-CHUKSN-ZAITEN-2
                                                          (IDX-CHUKSN2)
                         PERFORM    VARYING   IDX1   FROM   1   BY   1
                           UNTIL     IDX1   >   31
                            IF   ((WRK-NYUINKHN(IDX1) NOT = SPACE)  OR
                                  (LNK-NYUINDAY-KBN(IDX1) = "1"))
                            AND  ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO) OR
                                  (WRK-GAIHAKU-KBN(IDX1) >=   4))
                            AND   (ACCT-DAY(1 IDX1)    NOT =  ZERO)
                            AND   (ACCT-HKNCOMBI  =
                                                WRK-HKNCOMBI-DAY(IDX1))
                              MOVE   ACCT-DAY(1 IDX1)
                                                  TO  WRK-CHUKSN-DAY-2
                                                     (IDX-CHUKSN2 IDX1)
                            END-IF
                         END-PERFORM
                      END-IF
      *
                    END-IF
      *
                   END-IF
                 END-IF
                 MOVE     "tbl_sryacct"      TO  MCP-TABLE
                 MOVE     "key30"            TO  MCP-PATHNAME
                 PERFORM   910-SRYACCT-READ-SEC
               END-PERFORM
           END-IF
      *    ¿ÇÎÅ²ñ·×¥¯¥í¡¼¥º
           MOVE     "tbl_sryacct"   TO  MCP-TABLE
           MOVE     "key30"          TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *
      *    ¼èÆÀ¤·¤¿Æþ±¡ÎÁ²Ã»»¤òÃí²Ã»»¥³¡¼¥É¡¢Ãí²Ã»»ÄÌÈÖ½ç¤ËÊÂ¤ÓÂØ¤¨
           PERFORM      VARYING    IDX-CHUKSN0   FROM   1  BY  1
             UNTIL     (IDX-CHUKSN0   >   50)   OR
                       (WRK-CHUKSN-SRYCD-0(IDX-CHUKSN0)  =   SPACE)
               COMPUTE   IDX-CHUKSN0SS   =   IDX-CHUKSN0  +  1
               PERFORM   VARYING IDX-CHUKSN0S FROM IDX-CHUKSN0SS  BY  1
                 UNTIL   (IDX-CHUKSN0S   >   50)   OR
                         (WRK-CHUKSN-SRYCD-0(IDX-CHUKSN0S) =  SPACE)
                   IF  WRK-CHUKSN-CHUCD-0(IDX-CHUKSN0)
                                   <=  WRK-CHUKSN-CHUCD-0(IDX-CHUKSN0S)
                       CONTINUE
                   ELSE
                       MOVE   WRK-CHUKSN-TBL-0(IDX-CHUKSN0)
                                      TO   WRK-CHUKSN-TAIHI
                       MOVE   WRK-CHUKSN-TBL-0(IDX-CHUKSN0S)
                                      TO  WRK-CHUKSN-TBL-0(IDX-CHUKSN0)
                       MOVE   WRK-CHUKSN-TAIHI
                                      TO  WRK-CHUKSN-TBL-0(IDX-CHUKSN0S)
                   END-IF
               END-PERFORM
           END-PERFORM
           PERFORM      VARYING    IDX-CHUKSN1   FROM   1  BY  1
             UNTIL     (IDX-CHUKSN1   >   50)   OR
                       (WRK-CHUKSN-SRYCD-1(IDX-CHUKSN1)  =   SPACE)
               COMPUTE   IDX-CHUKSN1SS   =   IDX-CHUKSN1  +  1
               PERFORM   VARYING IDX-CHUKSN1S FROM IDX-CHUKSN1SS  BY  1
                 UNTIL   (IDX-CHUKSN1S   >   50)   OR
                         (WRK-CHUKSN-SRYCD-1(IDX-CHUKSN1S) =  SPACE)
                   IF  WRK-CHUKSN-CHUCD-1(IDX-CHUKSN1)
                                   <=  WRK-CHUKSN-CHUCD-1(IDX-CHUKSN1S)
                       CONTINUE
                   ELSE
                       MOVE   WRK-CHUKSN-TBL-1(IDX-CHUKSN1)
                                      TO   WRK-CHUKSN-TAIHI
                       MOVE   WRK-CHUKSN-TBL-1(IDX-CHUKSN1S)
                                      TO  WRK-CHUKSN-TBL-1(IDX-CHUKSN1)
                       MOVE   WRK-CHUKSN-TAIHI
                                      TO  WRK-CHUKSN-TBL-1(IDX-CHUKSN1S)
                   END-IF
               END-PERFORM
           END-PERFORM
           PERFORM      VARYING    IDX-CHUKSN2   FROM   1  BY  1
             UNTIL     (IDX-CHUKSN2   >   50)   OR
                       (WRK-CHUKSN-SRYCD-2(IDX-CHUKSN2)  =   SPACE)
               COMPUTE   IDX-CHUKSN2SS   =   IDX-CHUKSN2  +  1
               PERFORM   VARYING IDX-CHUKSN2S FROM IDX-CHUKSN2SS  BY  1
                 UNTIL   (IDX-CHUKSN2S   >   50)   OR
                         (WRK-CHUKSN-SRYCD-2(IDX-CHUKSN2S) =  SPACE)
                   IF  WRK-CHUKSN-CHUCD-2(IDX-CHUKSN2)
                                   <=  WRK-CHUKSN-CHUCD-2(IDX-CHUKSN2S)
                       CONTINUE
                   ELSE
                       MOVE   WRK-CHUKSN-TBL-2(IDX-CHUKSN2)
                                      TO   WRK-CHUKSN-TAIHI
                       MOVE   WRK-CHUKSN-TBL-2(IDX-CHUKSN2S)
                                      TO  WRK-CHUKSN-TBL-2(IDX-CHUKSN2)
                       MOVE   WRK-CHUKSN-TAIHI
                                      TO  WRK-CHUKSN-TBL-2(IDX-CHUKSN2S)
                   END-IF
               END-PERFORM
           END-PERFORM
      *
      *    ¼èÆÀ¤·¤¿Æþ±¡¾ðÊó¤«¤éÆüÃ±°Ì¤ÎÆþ±¡²ñ·×¾ðÊó¤òºÆ¹½ÃÛ
           PERFORM      VARYING    IDX1   FROM   1  BY  1
                        UNTIL      IDX1   >   31
      *        ¿ÇÎÅ¶èÊ¬
               MOVE   WRK-SRYKBN(IDX1)  TO  WRK-SO-SRYKBN(IDX1)
               IF    (LNK-NYUINDAY-KBN(IDX1)   =    "1")   AND
                     (LNK-NYUINDAY-TANKI2-KBN(IDX1)  NOT =    SPACE)
                   MOVE   "92"     TO       WRK-SO-SRYKBN(IDX1)
               END-IF
               IF    (LNK-NYUINDAY-KBN(IDX1)   =    "1")   AND
                     (LNK-NYUINDAY-TANKI2-KBN(IDX1)  =    SPACE)
                   MOVE   "90"     TO       WRK-SO-SRYKBN(IDX1)
               END-IF
      *        ÊÝ¸±ÁÈ¹ç¤»
               MOVE   WRK-HKNCOMBI-DAY(IDX1)
                                        TO  WRK-SO-HKNCOMBI-DAY(IDX1)
               MOVE     ZERO                TO  WRK-MEISAISU
      *        Æþ±¡´ðËÜÎÁ
               IF         WRK-NYUINKHN(IDX1)  NOT =        SPACE
                   ADD      1               TO  WRK-MEISAISU
                   MOVE   WRK-NYUINKHN(IDX1) TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
               END-IF
      *
      *        Ìë´Ö´Ç¸îÂÎÀ©ÆÃÄêÆü¸º»»
               IF         WRK-KANGOGEN(IDX1)  NOT =        SPACE
                   ADD      1                TO  WRK-MEISAISU
                   MOVE   WRK-KANGOGEN(IDX1) TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
               END-IF
      *
      *        Â¾°åÎÅµ¡´Ø¼õ¿Ç¡Ê£³£°¡ó¸º»»¤È£·£°¡ó¸º»»¡Ë
      *        ÆÃÄê»þ´ÖÂà±¡¸º»»
      *        ÆÃÄêÍËÆüÆþÂà±¡¸º»»
               IF     ((WRK-GAIHAKU(IDX1)        =
                                    "190142190" OR  "190142090" OR
                                    "190142290" OR  "190141590" OR
                                    "190108790" OR  "190108890" OR
                                    "190109090" OR
                                    "190153190" OR  "190153090" OR
                                    "190153390" OR  "190153290" OR
                                    "190161470" OR  "190161570" OR
                                    "190161670" OR  "190161770" OR
                                    "190161870" OR  "190161970" OR
                                    "190162070" OR  "190162170" OR
                                    "190182990" OR
                                    "190198570" OR  "190198670" OR
                                    "190213790" OR  "190214290" OR
                                    "190213890" OR  "190214090" OR
                                    "190214390" OR  "190213990" OR
                                    "190214190"                 )  OR
                       (WRK-GAIHAKU2(IDX1)       =
                                    "190108890" OR  "190142190" OR
                                    "190141590" OR  "190213790"))
                   ADD      1               TO  WRK-MEISAISU
                   MOVE   WRK-GAIHAKU(IDX1) TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
                   IF        (WRK-NYUINKHN(IDX1)  NOT =   SPACE)
                   AND       (WRK-GAIHAKU2(IDX1)  NOT =   SPACE)
                       ADD      1               TO  WRK-MEISAISU
                       MOVE   WRK-GAIHAKU2(IDX1) TO  WRK-SO-SRYCD
                                               (IDX1 WRK-MEISAISU)
                   END-IF
               END-IF
      *
      *        ½é´ü²Ã»»¡ÊÄ¹´ü¸º»»¡Ë
               IF     ((WRK-GAIHAKU(IDX1)       =   SPACE       OR
                                    "190142190" OR  "190142090" OR
                                    "190142290" OR  "190141590" OR
                                    "190108790" OR  "190108890" OR
                                    "190109090" OR
                                    "190153190" OR  "190153090" OR
                                    "190153390" OR  "190153290" OR
                                    "190161470" OR  "190161570" OR
                                    "190161670" OR  "190161770" OR
                                    "190161870" OR  "190161970" OR
                                    "190162070" OR  "190162170" OR
                                    "190182990" OR
                                    "190198570" OR  "190198670" OR
                                    "190213790" OR  "190214290" OR
                                    "190213890" OR  "190214090" OR
                                    "190214390" OR  "190213990" OR
                                    "190214190"                 )  OR
                       (WRK-GAIHAKU2(IDX1)       =
                                    "190108890" OR  "190142190" OR
                                    "190141590" OR  "190213790"))
               AND     (WRK-SHOKIKSN(IDX1)      NOT =   SPACE)
                   ADD      1               TO  WRK-MEISAISU
                   MOVE   WRK-SHOKIKSN(IDX1) TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
               END-IF
      *
      *        É¸·ç
               IF     ((WRK-GAIHAKU(IDX1)       =   SPACE       OR
                                    "190142190" OR  "190142090" OR
                                    "190142290" OR  "190141590" OR
                                    "190108790" OR  "190108890" OR
                                    "190109090" OR
                                    "190153190" OR  "190153090" OR
                                    "190153390" OR  "190153290" OR
                                    "190161470" OR  "190161570" OR
                                    "190161670" OR  "190161770" OR
                                    "190161870" OR  "190161970" OR
                                    "190162070" OR  "190162170" OR
                                    "190182990" OR
                                    "190198570" OR  "190198670" OR
                                    "190213790" OR  "190214290" OR
                                    "190213890" OR  "190214090" OR
                                    "190214390" OR  "190213990" OR
                                    "190214190"                 )  OR
                       (WRK-GAIHAKU2(IDX1)       =
                                    "190108890" OR  "190142190" OR
                                    "190141590" OR  "190213790"))
               AND     (WRK-HYOUKETSU(IDX1)   NOT =         SPACE)
                   ADD      1               TO  WRK-MEISAISU
                   MOVE   WRK-HYOUKETSU(IDX1) TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
               END-IF
      *
      *        Äê¿ôÄ¶²á
               IF     ((WRK-GAIHAKU(IDX1)       =   SPACE       OR
                                    "190142190" OR  "190142090" OR
                                    "190142290" OR  "190141590" OR
                                    "190108790" OR  "190108890" OR
                                    "190109090" OR
                                    "190153190" OR  "190153090" OR
                                    "190153390" OR  "190153290" OR
                                    "190161470" OR  "190161570" OR
                                    "190161670" OR  "190161770" OR
                                    "190161870" OR  "190161970" OR
                                    "190162070" OR  "190162170" OR
                                    "190182990" OR
                                    "190198570" OR  "190198670" OR
                                    "190213790" OR  "190214290" OR
                                    "190213890" OR  "190214090" OR
                                    "190214390" OR  "190213990" OR
                                    "190214190"                 )  OR
                       (WRK-GAIHAKU2(IDX1)       =
                                    "190108890" OR  "190142190" OR
                                    "190141590" OR  "190213790"))
               AND     (WRK-TEISU(IDX1)       NOT =         SPACE)
                   ADD      1               TO  WRK-MEISAISU
                   MOVE   WRK-TEISU(IDX1)  TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
               END-IF
      *
      *        ³°Çñ
               IF         WRK-GAIHAKU(IDX1)   NOT =        SPACE
                 IF     ((WRK-GAIHAKU(IDX1)     =
                                    "190142190" OR  "190142090" OR
                                    "190142290" OR  "190141590" OR
                                    "190108790" OR  "190108890" OR
                                    "190109090" OR
                                    "190153190" OR  "190153090" OR
                                    "190153390" OR  "190153290" OR
                                    "190161470" OR  "190161570" OR
                                    "190161670" OR  "190161770" OR
                                    "190161870" OR  "190161970" OR
                                    "190162070" OR  "190162170" OR
                                    "190182990" OR
                                    "190198570" OR  "190198670" OR
                                    "190213790" OR  "190214290" OR
                                    "190213890" OR  "190214090" OR
                                    "190214390" OR  "190213990" OR
                                    "190214190"                 )  OR
                       (WRK-GAIHAKU2(IDX1)       =
                                    "190108890" OR  "190142190" OR
                                    "190141590" OR  "190213790"))
                          CONTINUE
                 ELSE
                   ADD      1               TO  WRK-MEISAISU
                   MOVE   WRK-GAIHAKU(IDX1) TO  WRK-SO-SRYCD
                                           (IDX1 WRK-MEISAISU)
                   MOVE   WRK-GAIHAKU-KBN(IDX1)
                                            TO  WRK-SO-GAIHAKU-KBN
                                                           (IDX1 IDX1)
                 END-IF
               END-IF
      *
      *        ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë¤ÎÆþ±¡ÎÁ²Ã»»¥»¥Ã¥È
      *       ¡Ê£Á£±£°£°ÈÖÂæ¡¢£Á£³£°£°ÈÖÂæ¡Ë
               PERFORM    VARYING   IDX-CHUKSN1  FROM  1   BY  1
                 UNTIL    (IDX-CHUKSN1    >   50)    OR
                          (WRK-CHUKSN-SRYCD-1(IDX-CHUKSN1)  =  SPACE)
                   IF    WRK-CHUKSN-DAY-1(IDX-CHUKSN1 IDX1)  =  ZERO
                       CONTINUE
                   ELSE
                       ADD   1    TO  WRK-MEISAISU
                       MOVE  WRK-CHUKSN-SRYCD-1(IDX-CHUKSN1)
                                  TO  WRK-SO-SRYCD(IDX1 WRK-MEISAISU)
                   END-IF
               END-PERFORM
      *
      *        ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë¤ÎÆþ±¡ÎÁ²Ã»»¥»¥Ã¥È
      *       ¡Ê£Á£²£°£°ÈÖÂæ¡Ë
               PERFORM    VARYING   IDX-CHUKSN2  FROM  1   BY  1
                 UNTIL    (IDX-CHUKSN2    >   50)    OR
                          (WRK-CHUKSN-SRYCD-2(IDX-CHUKSN2)  =  SPACE)
                   IF    WRK-CHUKSN-DAY-2(IDX-CHUKSN2 IDX1)  =  ZERO
                       CONTINUE
                   ELSE
                       ADD   1    TO  WRK-MEISAISU
                       MOVE  WRK-CHUKSN-SRYCD-2(IDX-CHUKSN2)
                                  TO  WRK-SO-SRYCD(IDX1 WRK-MEISAISU)
                   END-IF
               END-PERFORM
      *
      *        ¤½¤ÎÂ¾Æþ±¡ÎÁ²Ã»»¥»¥Ã¥È
               PERFORM   VARYING   IDX-NYUKSN   FROM   1  BY   1
                 UNTIL  (IDX-NYUKSN    >     50)    OR
                        (WRK-NYUKSN-SRYCD-1(IDX-NYUKSN)  =  SPACE)
                  IF    WRK-NYUKSN-DAY-1(IDX-NYUKSN IDX1)  =  ZERO
                      CONTINUE
                  ELSE
                      ADD   1    TO  WRK-MEISAISU
                      MOVE  WRK-NYUKSN-SRYCD-1(IDX-NYUKSN)
                                 TO  WRK-SO-SRYCD(IDX1 WRK-MEISAISU)
                  END-IF
               END-PERFORM
      *
      *        Ï«ºÒ¾è¿ô¥»¥Ã¥È
               IF    WRK-SO-SRYKBN(IDX1)    =     "90"
                 IF         LNK-SROUNYUIN-JOUSU-KBN(IDX1)   =    "1"
                     ADD      1               TO  WRK-MEISAISU
                     MOVE   "101900010"   TO  WRK-SO-SRYCD
                                               (IDX1 WRK-MEISAISU)
                 END-IF
                 IF         LNK-SROUNYUIN-JOUSU-KBN(IDX1)   =    "2"
                     ADD      1               TO  WRK-MEISAISU
                     MOVE   "101900020"   TO  WRK-SO-SRYCD
                                               (IDX1 WRK-MEISAISU)
                 END-IF
               END-IF
      *
      *        ¹ð¼¨Åù¼±ÊÌ¶èÊ¬¡Ê£±¡Ë¤¬£·¡Ê²Ã»»¹àÌÜ¡Ë°Ê³°¤ÎÆþ±¡ÎÁ²Ã»»¥»¥Ã¥È
               PERFORM    VARYING   IDX-CHUKSN0  FROM  1   BY  1
                 UNTIL    (IDX-CHUKSN0    >   50)    OR
                          (WRK-CHUKSN-SRYCD-0(IDX-CHUKSN0)  =  SPACE)
                   IF    WRK-CHUKSN-DAY-0(IDX-CHUKSN0 IDX1)  =  ZERO
                       CONTINUE
                   ELSE
                       ADD   1    TO  WRK-MEISAISU
                       MOVE  WRK-CHUKSN-SRYCD-0(IDX-CHUKSN0)
                                  TO  WRK-SO-SRYCD(IDX1 WRK-MEISAISU)
                   END-IF
               END-PERFORM
      *
           END-PERFORM
      *
      *    ºÆ¹½ÃÛ¤·¤¿Æþ±¡²ñ·×¾ðÊó¤«¤éÅÀ¿ô¤Î»»Äê
           PERFORM      VARYING    IDX1   FROM   1  BY  1
                        UNTIL      IDX1   >   31
      *        ÅÀ¿ô¥Þ¥¹¥¿¤ÎÆÉ¤ß¹þ¤ß
               PERFORM   VARYING   IDX2    FROM   1  BY   1
                         UNTIL (WRK-SO-SRYCD(IDX1 IDX2) = SPACE)
                            OR (IDX2    >      30)
                   PERFORM    210-TENSU-KEISAN-SEC
               END-PERFORM
      *
      *        Ï«ºÒÅÀ¿ô¤ÎºÆ¥»¥Ã¥È
      *      ¡ÊÎáÏÂ£´Ç¯£±£°·î¤«¤é´Ç¸î¿¦°÷½è¶ø²þÁ±É¾²ÁÎÁ¤ò´Þ¤Þ¤Ê¤¤ºÞÅÀ¿ô¡Ë
                   COMPUTE    WRK-SO-TEN(IDX1)    =
                              LNK-SROUNYUIN-ZAITEN(IDX1)  +
                              LNK-SROUNYUIN-ZAITEN-NACCT(IDX1)  +
                              LNK-SROUNYUIN-ZAITEN-ACCT9(IDX1)
      *        ²ó¿ô¾ðÊó¤Î¥»¥Ã¥È
               IF    WRK-SO-SRYCD(IDX1 1) NOT  =   SPACE
                   MOVE     1      TO    WRK-SO-DAY(IDX1 IDX1)
               END-IF
           END-PERFORM
      *
      *     PERFORM    VARYING   IDX1   FROM  1  BY  1
      *                UNTIL     (IDX1   >     31)
      *          DISPLAY  "IDX1 = " IDX1
      *          DISPLAY  "WRK-SO-HKNCOMBI-DAY = " WRK-SO-HKNCOMBI-DAY
      *                                                         (IDX1)
      *          DISPLAY  "WRK-SO-SRYKBN   = " WRK-SO-SRYKBN(IDX1)
      *          DISPLAY  "WRK-SO-MEISAISU = " WRK-SO-MEISAISU(IDX1)
      *          DISPLAY  "WRK-SO-SRYCD(1) = " WRK-SO-SRYCD(IDX1 1)
      *          DISPLAY  "WRK-SO-SRYCD(2) = " WRK-SO-SRYCD(IDX1 2)
      *          DISPLAY  "WRK-SO-SRYCD(3) = " WRK-SO-SRYCD(IDX1 3)
      *          DISPLAY  "WRK-SO-SRYCD(4) = " WRK-SO-SRYCD(IDX1 4)
      *          DISPLAY  "WRK-SO-SRYCD(5) = " WRK-SO-SRYCD(IDX1 5)
      *          DISPLAY  "WRK-SO-SRYCDTOTAL = " WRK-SO-SRYCDTOTAL(IDX1)
      *          DISPLAY  "WRK-SO-TEN      = " WRK-SO-TEN(IDX1)
      *          DISPLAY  "WRK-SO-KAISU    = " WRK-SO-KAISU(IDX1)
      *     END-PERFORM
      *
      *    °åÎÅ¶èÊ¬¡¢£Á£Ä£ÌÅÀ¿ô¾ðÊó¤Î¼èÆÀ¡ÊÊ¿À®£³£°Ç¯£³·îËø¡Ë
           IF      LNK-RNYURECEDEN-SANTEIYM <=  "201803"
               INITIALIZE                          ORCSRYOCOM-AREA
               MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  LNK-RYOCOM-HOSPNUM
               MOVE    LNK-RNYURECEDEN-PTID     TO  LNK-RYOCOM-PTID
               MOVE    LNK-RNYURECEDEN-SANTEIYM TO  LNK-RYOCOM-SANTEIYM
               CALL    "ORCSRYOCOM"     USING  ORCSRYOCOM-AREA
                                               SPA-AREA
               IF      LNK-RYOCOM-RC           NOT =  ZERO
                   DISPLAY  "LNK-RYOCOM-RC = " LNK-RYOCOM-RC
               END-IF
           ELSE
               INITIALIZE                          ORCSRYOCOM-AREA
               MOVE      1                 TO      LNK-RYOCOM-RC
           END-IF
      *
      *     PERFORM   VARYING  IDX1   FROM  1   BY   1
      *               UNTIL    IDX1    >   31
      *       DISPLAY "IDX1 = " IDX1
      *       DISPLAY "LNK-RYOCOM-NYUINKBN = " LNK-RYOCOM-NYUINKBN(IDX1)
      *       DISPLAY "LNK-RYOCOM-MEISAISU = " LNK-RYOCOM-MEISAISU(IDX1)
      *       DISPLAY "LNK-RYOCOM-SRYCDTOTAL = " 
      *                                     LNK-RYOCOM-SRYCDTOTAL(IDX1)
      *       DISPLAY "LNK-RYOCOM-SRYCDTOTAL2 = " 
      *                                     LNK-RYOCOM-SRYCDTOTAL2(IDX1)
      *       DISPLAY "LNK-RYOCOM-IRYO-SRYCD (IDX1 1) = "
      *                             LNK-RYOCOM-IRYO-SRYCD(IDX1 1)
      *       DISPLAY "LNK-RYOCOM-IRYO-SRYCD (IDX1 2) = "
      *                             LNK-RYOCOM-IRYO-SRYCD(IDX1 2)
      *       DISPLAY "LNK-RYOCOM-IRYO-SRYCD (IDX1 3) = "
      *                             LNK-RYOCOM-IRYO-SRYCD(IDX1 3)
      *       DISPLAY "LNK-RYOCOM-IRYO-SRYCD (IDX1 4) = "
      *                             LNK-RYOCOM-IRYO-SRYCD(IDX1 4)
      *       DISPLAY "LNK-RYOCOM-IRYO-SRYCD (IDX1 5) = "
      *                             LNK-RYOCOM-IRYO-SRYCD(IDX1 5)
      *       DISPLAY "LNK-RYOCOM-ADL-SRYCD (IDX1) = "
      *                             LNK-RYOCOM-ADL-SRYCD(IDX1)
      *       DISPLAY "LNK-RYOCOM-ADL-TEN (IDX1) = "
      *                             LNK-RYOCOM-ADL-TEN(IDX1)
      *       DISPLAY "LNK-RYOCOM-ADL-TEN-MOJI (IDX1) = "
      *                             LNK-RYOCOM-ADL-TEN-MOJI(IDX1)
      *     END-PERFORM
      *
           MOVE      ZERO      TO   MATOME-IDX
      *
      *    ºÆ¹½ÃÛ¤·¤¿Æþ±¡²ñ·×¾ðÊó¤«¤éÆ±°ìºÞ¤Î¤Þ¤È¤á½èÍý
           PERFORM      VARYING    IDX1   FROM   1  BY  1
                        UNTIL      IDX1   >   31
               IF   (WRK-SO-MEISAISU(IDX1)  NOT =   ZERO)   AND
                    (WRK-SO-TEN(IDX1)       NOT =   ZERO)
                   IF    (LNK-RYOCOM-NYUINKBN(IDX1)   =   "1")   AND
                         (LNK-RYOCOM-MEISAISU(IDX1)   NOT =  ZERO)
                       ADD   1              TO  MATOME-IDX
                       MOVE  MATOME-IDX     TO  WRK-IRYOADL-DAY(IDX1)
                       MOVE  MATOME-IDX     TO  WRK-SO-IRYOADL-DAY(IDX1)
                   END-IF
                   ADD   1                  TO  WRK-SO-KAISU(IDX1)
                   MOVE       ZERO          TO  IDX2
                   COMPUTE    IDX2          =   IDX1    +   1
                   PERFORM    VARYING    IDX3   FROM   IDX2  BY  1
                              UNTIL      IDX3   >   31
                       IF    (WRK-SO-MEISAISU(IDX3)  =
                                             WRK-SO-MEISAISU(IDX1)) AND
                             (WRK-SO-HKNCOMBI-DAY(IDX3)  =
                                         WRK-SO-HKNCOMBI-DAY(IDX1)) AND
                             (WRK-SO-SRYCDTOTAL(IDX3)  =
                                         WRK-SO-SRYCDTOTAL(IDX1))   AND
                             (WRK-SO-TEN(IDX3)  =
                                         WRK-SO-TEN(IDX1))
                             IF (LNK-RYOCOM-NYUINKBN(IDX3) = "1")   AND
                                (LNK-RYOCOM-MEISAISU(IDX3) NOT =  ZERO)
                                 MOVE  MATOME-IDX    TO  
                                                 WRK-IRYOADL-DAY(IDX3)
                             END-IF
                             ADD     1    TO    WRK-SO-KAISU(IDX1)
                             MOVE    1    TO    WRK-SO-DAY(IDX1 IDX3)
                             IF  WRK-SO-GAIHAKU-KBN(IDX3 IDX3)
                                                             NOT = ZERO
                                 MOVE  WRK-SO-GAIHAKU-KBN(IDX3 IDX3)
                                          TO  WRK-SO-GAIHAKU-KBN
                                                            (IDX1 IDX3)
                             END-IF
                             INITIALIZE   WRK-NYUIN-SORT-TBL(IDX3)
                       END-IF
                   END-PERFORM
               END-IF
           END-PERFORM
      *
      **     DISPLAY "===  DAY-SET2 ======"
      **     PERFORM   VARYING   IDX1    FROM   1  BY  1
      **       UNTIL   IDX1     >   31
      **       DISPLAY "IDX1 = "IDX1
      **         DISPLAY "      ----5----0----5----0----5----0-"
      **         DISPLAY "DAY = " WRK-SO-DAY-TBL(IDX1)
      **     END-PERFORM
      *
      *    ÎÅÍÜ¥ì¥»¥³¥á¥ó¥È¤ÎÆ±°ìºÞ¤Þ¤È¤á½èÍý
           IF    (MATOME-IDX     NOT =   ZERO)   AND
                 (LNK-RYOCOM-RC  =       ZERO)
      *      ÎÅÍÜ¥ì¥»¥³¥á¥ó¥È¼èÆÀ¥µ¥Ö¤ÎÊÖµÑ·ë²Ì¤ò¤Þ¤È¤á¥ï¡¼¥¯¤ËÅ¾Á÷
             PERFORM      VARYING    IDX1   FROM   1  BY  1
               UNTIL      IDX1   >   31
                 IF   (LNK-RYOCOM-NYUINKBN(IDX1)  NOT =   ZERO)   AND
                      (LNK-RYOCOM-MEISAISU(IDX1)  NOT =   ZERO)
                     MOVE   LNK-RYOCOM-MEISAISU(IDX1)
                                   TO  WRK-IRYOADL-MEISAISU(IDX1)
                     PERFORM  VARYING  IDX2  FROM  1  BY  1
                       UNTIL  IDX2 >  LNK-RYOCOM-MEISAISU(IDX1)
                         MOVE  LNK-RYOCOM-IRYO-SRYCD(IDX1 IDX2)
                                     TO  WRK-IRYOADL-SRYCD(IDX1 IDX2)
                     END-PERFORM
                     MOVE   LNK-RYOCOM-SRYCDTOTAL2(IDX1)
                                   TO  WRK-IRYOADL-SRYCDTOTAL(IDX1)
                     IF     LNK-RNYURECEDEN-SANTEIYM   <=  "201003"
                         MOVE   LNK-RYOCOM-ADL-SRYCD(IDX1)
                                       TO  WRK-IRYOADL-ADL-SRYCD(IDX1)
                         MOVE   LNK-RYOCOM-ADL-TEN(IDX1)
                                       TO  WRK-IRYOADL-TEN(IDX1)
                         MOVE   LNK-RYOCOM-ADL-TEN-MOJI(IDX1)
                                       TO  WRK-IRYOADL-TEN-MOJI(IDX1)
                     ELSE
                         MOVE   LNK-RYOCOM-ADL-SRYCD-H22(IDX1 1)
                                   TO  WRK-IRYOADL-ADL-SRYCD-H22(IDX1 1)
                         MOVE   LNK-RYOCOM-ADL-TEN-H22(IDX1 1)
                                   TO  WRK-IRYOADL-TEN-H22(IDX1 1)
                         MOVE   LNK-RYOCOM-ADL-TEN-MOJI-H22(IDX1 1)
                                   TO  WRK-IRYOADL-TEN-MOJI-H22(IDX1 1)
                         MOVE   LNK-RYOCOM-ADL-SRYCD-H22(IDX1 2)
                                   TO  WRK-IRYOADL-ADL-SRYCD-H22(IDX1 2)
                         MOVE   LNK-RYOCOM-ADL-TEN-H22(IDX1 2)
                                   TO  WRK-IRYOADL-TEN-H22(IDX1 2)
                         MOVE   LNK-RYOCOM-ADL-TEN-MOJI-H22(IDX1 2)
                                   TO  WRK-IRYOADL-TEN-MOJI-H22(IDX1 2)
                         MOVE   LNK-RYOCOM-ADL-SRYCD-H22(IDX1 3)
                                   TO  WRK-IRYOADL-ADL-SRYCD-H22(IDX1 3)
                         MOVE   LNK-RYOCOM-ADL-TEN-H22(IDX1 3)
                                   TO  WRK-IRYOADL-TEN-H22(IDX1 3)
                         MOVE   LNK-RYOCOM-ADL-TEN-MOJI-H22(IDX1 3)
                                   TO  WRK-IRYOADL-TEN-MOJI-H22(IDX1 3)
                         MOVE   LNK-RYOCOM-ADL-SRYCD-H22(IDX1 4)
                                   TO  WRK-IRYOADL-ADL-SRYCD-H22(IDX1 4)
                         MOVE   LNK-RYOCOM-ADL-TEN-H22(IDX1 4)
                                   TO  WRK-IRYOADL-TEN-H22(IDX1 4)
                         MOVE   LNK-RYOCOM-ADL-TEN-MOJI-H22(IDX1 4)
                                   TO  WRK-IRYOADL-TEN-MOJI-H22(IDX1 4)
                     END-IF
                 END-IF
             END-PERFORM
      *
      *      ÎÅÍÜ¥ì¥»¥³¥á¥ó¥È¤Þ¤È¤á
             PERFORM      VARYING    IDX1   FROM   1  BY  1
                        UNTIL      IDX1   >   31
               IF   (WRK-IRYOADL-DAY(IDX1)  NOT =   ZERO)   AND
                    (WRK-IRYOADL-MEISAISU(IDX1)  NOT =   ZERO)
                   MOVE       1   TO  WRK-IRYOADL-GAITOU-KBN(IDX1 IDX1)
                   MOVE       ZERO      TO  IDX2
                   COMPUTE    IDX2      =   IDX1    +   1
                   PERFORM    VARYING    IDX3   FROM   IDX2  BY  1
                              UNTIL      IDX3   >   31
                     IF    LNK-RNYURECEDEN-SANTEIYM   <=   "201003"
                       IF    (WRK-IRYOADL-DAY(IDX3)  =
                                         WRK-IRYOADL-DAY(IDX1)) AND
                             (WRK-IRYOADL-MEISAISU(IDX3)  =
                                         WRK-IRYOADL-MEISAISU(IDX1)) AND
                             (WRK-IRYOADL-SRYCDTOTAL(IDX3)  =
                                       WRK-IRYOADL-SRYCDTOTAL(IDX1)) AND
                             (WRK-IRYOADL-TEN(IDX3)  =
                                         WRK-IRYOADL-TEN(IDX1))
                             MOVE      1    TO
                                       WRK-IRYOADL-GAITOU-KBN(IDX1 IDX3)
                             INITIALIZE   WRK-IRYOADL-SORT-TBL(IDX3)
                       END-IF
                     ELSE
                       IF    (WRK-IRYOADL-DAY(IDX3)  =
                                         WRK-IRYOADL-DAY(IDX1)) AND
                             (WRK-IRYOADL-MEISAISU(IDX3)  =
                                         WRK-IRYOADL-MEISAISU(IDX1)) AND
                             (WRK-IRYOADL-SRYCDTOTAL(IDX3)  =
                                       WRK-IRYOADL-SRYCDTOTAL(IDX1)) AND
                             (WRK-IRYOADL-TEN-H22(IDX3 1)  =
                                       WRK-IRYOADL-TEN-H22(IDX1 1))  AND
                             (WRK-IRYOADL-TEN-H22(IDX3 2)  =
                                       WRK-IRYOADL-TEN-H22(IDX1 2))  AND
                             (WRK-IRYOADL-TEN-H22(IDX3 3)  =
                                       WRK-IRYOADL-TEN-H22(IDX1 3))  AND
                             (WRK-IRYOADL-TEN-H22(IDX3 4)  =
                                       WRK-IRYOADL-TEN-H22(IDX1 4))
                             MOVE      1    TO
                                       WRK-IRYOADL-GAITOU-KBN(IDX1 IDX3)
                             INITIALIZE   WRK-IRYOADL-SORT-TBL(IDX3)
                       END-IF
                     END-IF
                   END-PERFORM
               END-IF
             END-PERFORM
           END-IF
      *    ¤Þ¤È¤á·ë²Ì³ÎÇ§
      *     PERFORM    VARYING   IDX1   FROM  1  BY  1
      *                UNTIL     (IDX1   >     31)
      *          DISPLAY  "IDX1 = " IDX1
      *          DISPLAY  "WRK-IRYOADL-DAY(IDX1) = "
      *                    WRK-IRYOADL-DAY(IDX1)
      *          DISPLAY  "WRK-IRYOADL-MEISAISU(IDX1) = "
      *                    WRK-IRYOADL-MEISAISU(IDX1)
      *          DISPLAY  "WRK-IRYOADL-SRYCDTOTAL(IDX1) = "
      *                    WRK-IRYOADL-SRYCDTOTAL(IDX1)
      *          DISPLAY  "WRK-IRYOADL-TEN(IDX1) = "
      *                    WRK-IRYOADL-TEN(IDX1)
      *          DISPLAY  "WRK-IRYOADL-GAITOU-TBL(IDX1) = "
      *                    WRK-IRYOADL-GAITOU-TBL(IDX1)
      *     END-PERFORM
      *
      *    Æþ±¡²ñ·×¤Þ¤È¤á·ë²Ì¤ÈÎÅÍÜ¥ì¥»¥³¥á¥ó¥È¤Î¥ê¥ó¥¯¤ò³ÎÇ§
      *     PERFORM    VARYING   IDX1   FROM  1  BY  1
      *                UNTIL     (IDX1   >     31)
      *          DISPLAY  "IDX1 = " IDX1
      *          DISPLAY  "WRK-IRYOADL-DAY(IDX1) = "
      *                    WRK-IRYOADL-DAY(IDX1)
      *          DISPLAY  "WRK-SO-IRYOADL-DAY(IDX1) = "
      *                    WRK-SO-IRYOADL-DAY(IDX1)
      *     END-PERFORM
      *
      *   ·ë²ÌÉ½¼¨
      *     PERFORM    VARYING   IDX1   FROM  1  BY  1
      *                UNTIL     (IDX1   >     31)
      *          DISPLAY  "IDX1 = " IDX1
      *          DISPLAY  "WRK-SO-HKNCOMBI-DAY = " WRK-SO-HKNCOMBI-DAY
      *                                                         (IDX1)
      *          DISPLAY  "WRK-SO-SRYKBN   = " WRK-SO-SRYKBN(IDX1)
      *          DISPLAY  "WRK-SO-MEISAISU = " WRK-SO-MEISAISU(IDX1)
      *          DISPLAY  "WRK-SO-SRYCD(1) = " WRK-SO-SRYCD(IDX1 1)
      *          DISPLAY  "WRK-SO-SRYCD(2) = " WRK-SO-SRYCD(IDX1 2)
      *          DISPLAY  "WRK-SO-SRYCD(3) = " WRK-SO-SRYCD(IDX1 3)
      *          DISPLAY  "WRK-SO-SRYCD(4) = " WRK-SO-SRYCD(IDX1 4)
      *          DISPLAY  "WRK-SO-SRYCD(5) = " WRK-SO-SRYCD(IDX1 5)
      *          DISPLAY  "WRK-SO-SRYCDTOTAL = " WRK-SO-SRYCDTOTAL(IDX1)
      *          DISPLAY  "WRK-SO-TEN      = " WRK-SO-TEN(IDX1)
      *          DISPLAY  "WRK-SO-KAISU    = " WRK-SO-KAISU(IDX1)
      *          PERFORM   VARYING  IDX2  FROM  1  BY  1
      *                    UNTIL  IDX2  >  31
      *                     DISPLAY  "IDX2 = " IDX2
      *                     DISPLAY  "WRK-SO-GAIHAKU-KBN = " 
      *                               WRK-SO-GAIHAKU-KBN(IDX1 IDX2)
      *          END-PERFORM
      *     END-PERFORM
      *
      *    ¥ì¥»ÅÅ¥µ¥ÖÊÖµÑ¥¨¥ê¥¢¤Ø¤Î¥»¥Ã¥È¡ÊÆþ±¡ÎÁ¡¡¿ÇÎÅ¶èÊ¬£¹£°¡Ë
           MOVE       ZERO      TO     IDX2
           PERFORM    VARYING   IDX1   FROM  1  BY  1
                      UNTIL     (IDX1   >     31)
               IF   (WRK-SO-MEISAISU(IDX1)  NOT =   ZERO)   AND
                    (WRK-SO-TEN(IDX1)       NOT =   ZERO)   AND
                    (WRK-SO-SRYKBN(IDX1)    =       "90")
                     ADD    1      TO    IDX2
                     MOVE  WRK-SO-MEISAISU(IDX1)   TO
                                     LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                     MOVE  WRK-SO-DAY-TBL(IDX1)    TO
                                      LNK-RNYURECEDEN-DAY-TBL(1 IDX2)
      *
                     PERFORM   VARYING   IDX3   FROM   1   BY  1
                               UNTIL (WRK-SO-SRYCD(IDX1 IDX3) = SPACE)
                                  OR (IDX3   >   30)
                         MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                         IF    IDX3   =    1
                               MOVE   WRK-SO-SRYKBN(IDX1)  TO   
                                    LNK-RNYURECEDEN-SRYSKB(1 IDX2 IDX3)
                         END-IF
      *                Æþ±¡ÎÁ²Ã»»¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨
      *                  °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡Ê°ìÈÌÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190131570"
                            MOVE "101900100" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *                  °ìÈÌÉÂÅï´Ç¸îÉ¬Í×ÅÙÉ¾²Á²Ã»»¡ÊÀìÌçÉÂ±¡¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190134970"
                            MOVE "101900120" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *                  ½ÅÅÙÇ§ÃÎ¾É²Ã»»¡ÊÀº¿ÀÉÂÅï¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF   (WRK-SO-SRYCD(IDX1 IDX3)  =  "190118570")
                         AND  (LNK-RNYURECEDEN-SANTEIYM <= "201803")
                            MOVE "101900110" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *
      *                Æþ±¡ÎÁ²Ã»»¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÊ¿À®£²£¶Ç¯ÄÉ²Ã¡Ë
      *                  ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190167970"
                            MOVE "101900130" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *                  ºßÂðÉüµ¢µ¡Ç½¶¯²½²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190168070"
                            MOVE "101900140" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *
      *                Æþ±¡ÎÁ²Ã»»¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÊ¿À®£³£°Ç¯ÄÉ²Ã¡Ë
      *                  Ìë´Ö´Ç¸î²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190204570"
                            MOVE "101900170" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *                Æþ±¡ÎÁ²Ã»»¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÎáÏÂ£´Ç¯ÄÉ²Ã¡Ë
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190240110"
                            MOVE "101900190" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *                   ËýÀ­°Ý»ýÆ©ÀÏ´ÉÍý²Ã»»¡ÊÍ­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190242610"
                            MOVE "101900180" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *
      *                ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÊ¿À®£²£¶Ç¯£··îÄÉ²Ã¡Ë
      *                  ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190182590"
                            MOVE "101900150" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *
      *                Æþ±¡ÎÁ²Ã»»¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÎáÏÂ£¶Ç¯£¶·îÄÉ²Ã¡Ë
      *                   Ìë´Ö´Ç¸îÂÎÀ©²Ã»»¡Ê¾ã³²¼Ô»ÜÀßÅùÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190205770"
                            MOVE "101900200" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *                   Æþ±¡±ÉÍÜ´ÉÍýÂÎÀ©²Ã»»¡ÊÆÃÄêµ¡Ç½ÉÂ±¡Æþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190240210"
                            MOVE "101900210" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£±¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190829710"
                            MOVE "101900230" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£²¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190829810"
                            MOVE "101900240" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *                   ´Ç¸îÊä½õÂÎÀ©½¼¼Â²Ã»»£³¡ÊÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                          IF   WRK-SO-SRYCD(IDX1 IDX3)  =  "190829910"
                            MOVE "101900250" TO WRK-SO-SRYCD(IDX1 IDX3)
                          END-IF
      *
      *                ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÎáÏÂ£¶Ç¯£¶·îÄÉ²Ã¡Ë
      *                  ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¡ÊÆþ±¡´ðËÜÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190814310"
                            MOVE "101900260" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *
                         MOVE  WRK-SO-SRYCD(IDX1 IDX3) TO
                                    LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                         MOVE   WRK-SO-KAISU(IDX1)   TO
                                      LNK-RNYURECEDEN-KAISU(1 IDX2 IDX3)
                         MOVE  ZERO     TO    IDX4
                         COMPUTE   IDX4 =    IDX3   +   1
                         IF    WRK-SO-SRYCD(IDX1 IDX4)    =   SPACE
                               MOVE   WRK-SO-TEN(IDX1)   TO
                                      LNK-RNYURECEDEN-TEN(1 IDX2 IDX3)
                         END-IF
                     END-PERFORM
      *
      *              ³°Çñ¥³¥á¥ó¥È¥»¥Ã¥È½èÍý
                     INITIALIZE    WRK-GAIHAKU-DAY-TABLE
                     IF   WRK-SO-GAIHAKU-TBL(IDX1)   =  ALL"0"
                         CONTINUE
                     ELSE
                         MOVE     ZERO    TO   IDX6
                         PERFORM  VARYING  IDX5   FROM  1  BY  1
                           UNTIL  IDX5   >  31
                               IF   WRK-SO-GAIHAKU-KBN(IDX1 IDX5)  =
                                                         1   OR  2
                                 IF  IDX5   =   1
                                    ADD   1    TO   IDX6
                                    MOVE  IDX5   TO  
                                               WRK-GAIHAKU-DAY-ST(IDX6)
                                    MOVE  IDX5   TO  
                                               WRK-GAIHAKU-DAY-ED(IDX6)
                                 ELSE
                                   COMPUTE   IDX7  =   IDX5  -  1
                                   IF WRK-SO-GAIHAKU-KBN(IDX1 IDX7) =
                                                         1   OR  2
                                        MOVE  IDX5  TO
                                              WRK-GAIHAKU-DAY-ED(IDX6)
                                   ELSE
                                     ADD   1    TO   IDX6
                                     MOVE  IDX5   TO  
                                              WRK-GAIHAKU-DAY-ST(IDX6)
                                     MOVE  IDX5   TO  
                                              WRK-GAIHAKU-DAY-ED(IDX6)
                                   END-IF
                                 END-IF
                               END-IF
                         END-PERFORM
                       PERFORM   VARYING  IDX5  FROM  1  BY  1
                       UNTIL   (IDX5  >  31)   OR
                               (WRK-GAIHAKU-DAY-ST(IDX5) =  ZERO)
                           ADD    1     TO
                                       LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                           IF   WRK-GAIHAKU-DAY-ST(IDX5) = 
                                               WRK-GAIHAKU-DAY-ED(IDX5)
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                                MOVE  "840000015"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                MOVE   WRK-GAIHAKU-DAY-ST(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           ELSE
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                                MOVE  "840000016"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                MOVE   WRK-GAIHAKU-DAY-ST(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (1:4)
                                MOVE   WRK-GAIHAKU-DAY-ED(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (5:4)
                           END-IF
                           ADD    1     TO   IDX3
                       END-PERFORM
                     END-IF
      *
                     IF  LNK-RYOCOM-RC  =       ZERO
      *              ÎÅÍÜ¥ì¥»¥×¥È¥³¥á¥ó¥È¥»¥Ã¥È½èÍý
      *              ·îÆü¥»¥Ã¥È
                     PERFORM   VARYING  CIDX   FROM   1  BY  1
                       UNTIL   CIDX     >   31
                      IF   WRK-SO-IRYOADL-DAY(IDX1)  =
                                         WRK-IRYOADL-DAY(CIDX)
                       INITIALIZE    WRK-RYOYO-DAY-TABLE
                       IF   WRK-IRYOADL-GAITOU-TBL(CIDX)   =  ALL"0"
                         CONTINUE
                       ELSE
                         MOVE     ZERO    TO   IDX6
                         PERFORM  VARYING  IDX5   FROM  1  BY  1
                           UNTIL  IDX5   >  31
                               IF   WRK-IRYOADL-GAITOU-KBN(CIDX IDX5)
                                                          =       1
                                 IF  IDX5   =   1
                                    ADD   1    TO   IDX6
                                    MOVE  IDX5   TO  
                                               WRK-RYOYO-DAY-ST(IDX6)
                                    MOVE  IDX5   TO  
                                               WRK-RYOYO-DAY-ED(IDX6)
                                 ELSE
                                   COMPUTE   IDX7  =   IDX5  -  1
                                   IF WRK-IRYOADL-GAITOU-KBN(CIDX IDX7)
                                                           =     1
                                        MOVE  IDX5  TO
                                              WRK-RYOYO-DAY-ED(IDX6)
                                   ELSE
                                     ADD   1    TO   IDX6
                                     MOVE  IDX5   TO  
                                              WRK-RYOYO-DAY-ST(IDX6)
                                     MOVE  IDX5   TO  
                                              WRK-RYOYO-DAY-ED(IDX6)
                                   END-IF
                                 END-IF
                               END-IF
                         END-PERFORM
      *                  Ê¿À®£²£²Ç¯£´·î¤è¤êµ­Ï¿¥³¥á¥ó¥È¤ÎÊÑ¹¹
      *                  ¡Êµ­Ï¿¥³¥á¥ó¥È¥³¡¼¥É810000001  ->  840000125 840000134¡Ë
                         IF  LNK-RNYURECEDEN-SANTEIYM    <=   "201003"
                          PERFORM   VARYING  IDX5  FROM  1  BY  1
                          UNTIL   (IDX5  >  31)   OR
                               (WRK-RYOYO-DAY-ST(IDX5) =  ZERO)
                           IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                             ADD    1     TO
                                       LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                             IF   WRK-RYOYO-DAY-ST(IDX5) = 
                                               WRK-RYOYO-DAY-ED(IDX5)
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                                MOVE  "810000001"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                MOVE   "¡¡¡¡·î¡¡¡¡Æü"  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                MOVE   LNK-RNYURECEDEN-SANTEIYM(5:2)
                                                       TO  WRK-MM-X
                                MOVE   WRK-MM-9        TO  IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (1:4)
                                MOVE   WRK-RYOYO-DAY-ST(IDX5) TO  IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (7:4)
                             ELSE
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                                MOVE  "810000001"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                MOVE   "¡¡¡¡·î¡¡¡¡Æü¡Á¡¡¡¡·î¡¡¡¡Æü"  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                MOVE   LNK-RNYURECEDEN-SANTEIYM(5:2)
                                                       TO  WRK-MM-X
                                MOVE   WRK-MM-9        TO  IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (1:4)
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (15:4)
                                MOVE   WRK-RYOYO-DAY-ST(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (7:4)
                                MOVE   WRK-RYOYO-DAY-ED(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (21:4)
                             END-IF
                             ADD    1     TO   IDX3
                           END-IF
                          END-PERFORM
                         ELSE
                          PERFORM   VARYING  IDX5  FROM  1  BY  1
                          UNTIL   (IDX5  >  31)   OR
                               (WRK-RYOYO-DAY-ST(IDX5) =  ZERO)
                           IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                             ADD    1     TO
                                       LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                             IF   WRK-RYOYO-DAY-ST(IDX5) = 
                                               WRK-RYOYO-DAY-ED(IDX5)
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                                IF   SPA-HOSPSBT    =    1
                                    MOVE  "840000125"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                ELSE
                                    MOVE  "840000134"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                END-IF
                                MOVE   WRK-RYOYO-DAY-ST(IDX5) TO  IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (1:4)
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (5:4)
                             ELSE
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                                IF   SPA-HOSPSBT    =    1
                                    MOVE  "840000125"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                ELSE
                                    MOVE  "840000134"  TO
                                      LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                                END-IF
                                MOVE   WRK-RYOYO-DAY-ST(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (1:4)
                                MOVE   WRK-RYOYO-DAY-ED(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                                                          (5:4)
                             END-IF
                             ADD    1     TO   IDX3
                           END-IF
                          END-PERFORM
                         END-IF
      *
      *                  °åÎÅ¶èÊ¬¥³¥á¥ó¥È
                         PERFORM   VARYING  IDX5  FROM  1  BY  1
                         UNTIL   (IDX5  >  30)   OR
                           (WRK-IRYOADL-SRYCD(CIDX IDX5) =  SPACE)
                           IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                             ADD    1     TO
                                   LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                             MOVE   "CO"   TO   
                                LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                             MOVE  WRK-IRYOADL-SRYCD(CIDX IDX5)  TO
                                  LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                             ADD    1     TO   IDX3
                           END-IF
                         END-PERFORM
      *
      *                  £Á£Ä£Ì¥³¥á¥ó¥È¡ÊÊ¿À®£²£²Ç¯£´·î¤è¤êµ­Ï¿¥³¥á¥ó¥È¤ÎÊÑ¹¹¡Ë
                         IF  LNK-RNYURECEDEN-SANTEIYM    <=   "201003"
                          IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                           ADD    1     TO
                                   LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                           MOVE   "CO"   TO   
                                LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                           MOVE  "840000103"   TO
                                  LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                           IF   WRK-IRYOADL-TEN(CIDX)   =   ZERO
                             MOVE  "£°£°"    TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           ELSE
                             MOVE   WRK-IRYOADL-TEN(CIDX) TO IDX6
                             MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           END-IF
                           ADD    1     TO   IDX3
                          END-IF
                         ELSE
      *                   £Á£Ä£Ì£á
                          IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                           ADD    1     TO
                                   LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                           MOVE   "CO"   TO   
                                LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                           MOVE  "840000126"   TO
                                  LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                           IF   WRK-IRYOADL-TEN-H22(CIDX 1)   =   ZERO
                             MOVE  "£°£°"    TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           ELSE
                             MOVE   WRK-IRYOADL-TEN-H22(CIDX 1) TO IDX6
                             MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           END-IF
                           ADD    1     TO   IDX3
                          END-IF
      *                   £Á£Ä£Ì£â
                          IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                           ADD    1     TO
                                   LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                           MOVE   "CO"   TO   
                                LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                           MOVE  "840000127"   TO
                                  LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                           IF   WRK-IRYOADL-TEN-H22(CIDX 2)   =   ZERO
                             MOVE  "£°£°"    TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           ELSE
                             MOVE   WRK-IRYOADL-TEN-H22(CIDX 2) TO IDX6
                             MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           END-IF
                           ADD    1     TO   IDX3
                          END-IF
      *                   £Á£Ä£Ì£ã
                          IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                           ADD    1     TO
                                   LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                           MOVE   "CO"   TO   
                                LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                           MOVE  "840000128"   TO
                                  LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                           IF   WRK-IRYOADL-TEN-H22(CIDX 3)   =   ZERO
                             MOVE  "£°£°"    TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           ELSE
                             MOVE   WRK-IRYOADL-TEN-H22(CIDX 3) TO IDX6
                             MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           END-IF
                           ADD    1     TO   IDX3
                          END-IF
      *                   £Á£Ä£Ì£ä
                          IF   LNK-RNYURECEDEN-MEISAISU(1 IDX2) < 300
                           ADD    1     TO
                                   LNK-RNYURECEDEN-MEISAISU(1 IDX2)
                           MOVE   "CO"   TO   
                                LNK-RNYURECEDEN-RECSKB(1 IDX2 IDX3)
                           MOVE  "840000129"   TO
                                  LNK-RNYURECEDEN-SRYCD(1 IDX2 IDX3)
                           IF   WRK-IRYOADL-TEN-H22(CIDX 4)   =   ZERO
                             MOVE  "£°£°"    TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           ELSE
                             MOVE   WRK-IRYOADL-TEN-H22(CIDX 4) TO IDX6
                             MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(1 IDX2 IDX3)
                           END-IF
                           ADD    1     TO   IDX3
                          END-IF
                         END-IF
      *
                       END-IF
                      END-IF
                     END-PERFORM
      *
                     END-IF
      *
               END-IF
           END-PERFORM
      *    ¥ì¥»ÅÅ¥µ¥ÖÊÖµÑ¥¨¥ê¥¢¤Ø¤Î¥»¥Ã¥È¡ÊÆÃÄêÆþ±¡ÎÁ¡¡¿ÇÎÅ¶èÊ¬£¹£²¡Ë
           MOVE      ZERO     TO   IDX2
           PERFORM    VARYING   IDX1   FROM  1  BY  1
                      UNTIL     (IDX1   >     31)
               IF   (WRK-SO-MEISAISU(IDX1)  NOT =   ZERO)   AND
                    (WRK-SO-TEN(IDX1)       NOT =   ZERO)   AND
                    (WRK-SO-SRYKBN(IDX1)    =       "92")
                     ADD    1      TO    IDX2
                     MOVE  WRK-SO-MEISAISU(IDX1)   TO
                                     LNK-RNYURECEDEN-MEISAISU(2 IDX2)
                     MOVE  WRK-SO-DAY-TBL(IDX1)    TO
                                     LNK-RNYURECEDEN-DAY-TBL(2 IDX2)
      *
                     PERFORM   VARYING   IDX3   FROM   1   BY  1
                               UNTIL (WRK-SO-SRYCD(IDX1 IDX3) = SPACE)
                                  OR (IDX3   >   30)
                         MOVE   "RI"   TO   
                                    LNK-RNYURECEDEN-RECSKB(2 IDX2 IDX3)
                         IF    IDX3   =    1
                               MOVE   WRK-SO-SRYKBN(IDX1)  TO   
                                    LNK-RNYURECEDEN-SRYSKB(2 IDX2 IDX3)
                         END-IF
      *
      *                ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨
      *                  ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÆÃÄêÆþ±¡ÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190182690"
                            MOVE "101900160" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *                  ±ÉÍÜ´ÉÍýÂÎÀ©¸º»»µ¬Äê³ºÅö¡ÊÃ»¼ê£³¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190876890"
                            MOVE "101900220" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *
      *                ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¤ÎÏ«ºÒÍÑÃÖ¤­´¹¤¨¡ÊÎáÏÂ£¶Ç¯£¶·îÄÉ²Ã¡Ë
      *                  ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¡ÊÆÃÄêÆþ±¡ÎÁ¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190814410"
                            MOVE "101900270" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *                  ¿ÈÂÎÅª¹´Â«ºÇ¾®²½¸º»»µ¬Äê³ºÅö¡ÊÃ»¼ê£³¡Ë¡ÊÏ«ºÒÍÑ¡Ë
                         IF    WRK-SO-SRYCD(IDX1 IDX3)  =  "190876910"
                            MOVE "101900280" TO WRK-SO-SRYCD(IDX1 IDX3)
                         END-IF
      *
                         MOVE  WRK-SO-SRYCD(IDX1 IDX3) TO
                                    LNK-RNYURECEDEN-SRYCD(2 IDX2 IDX3)
                         MOVE   WRK-SO-KAISU(IDX1)   TO
                                      LNK-RNYURECEDEN-KAISU(2 IDX2 IDX3)
                         MOVE  ZERO     TO    IDX4
                         COMPUTE   IDX4 =    IDX3   +   1
                         IF    WRK-SO-SRYCD(IDX1 IDX4)    =    SPACE
                               MOVE   WRK-SO-TEN(IDX1)   TO
                                      LNK-RNYURECEDEN-TEN(2 IDX2 IDX3)
                         END-IF
                     END-PERFORM
      *              ³°Çñ¥³¥á¥ó¥È¥»¥Ã¥È½èÍý
                     INITIALIZE    WRK-GAIHAKU-DAY-TABLE
                     IF   WRK-SO-GAIHAKU-TBL(IDX1)   =  ALL"0"
                         CONTINUE
                     ELSE
                         MOVE     ZERO    TO   IDX6
                         PERFORM  VARYING  IDX5   FROM  1  BY  1
                           UNTIL  IDX5   >  31
                               IF   WRK-SO-GAIHAKU-KBN(IDX1 IDX5)  =
                                                         1   OR  2
                                 IF  IDX5   =   1
                                    ADD   1    TO   IDX6
                                    MOVE  IDX5   TO  
                                               WRK-GAIHAKU-DAY-ST(IDX6)
                                    MOVE  IDX5   TO  
                                               WRK-GAIHAKU-DAY-ED(IDX6)
                                 ELSE
                                   COMPUTE   IDX7  =   IDX5  -  1
                                   IF WRK-SO-GAIHAKU-KBN(IDX1 IDX7) =
                                                         1   OR  2
                                        MOVE  IDX5  TO
                                              WRK-GAIHAKU-DAY-ED(IDX6)
                                   ELSE
                                     ADD   1    TO   IDX6
                                     MOVE  IDX5   TO  
                                              WRK-GAIHAKU-DAY-ST(IDX6)
                                     MOVE  IDX5   TO  
                                              WRK-GAIHAKU-DAY-ED(IDX6)
                                   END-IF
                                 END-IF
                               END-IF
                         END-PERFORM
                       PERFORM   VARYING  IDX5  FROM  1  BY  1
                       UNTIL   (IDX5  >  31)   OR
                               (WRK-GAIHAKU-DAY-ST(IDX5) =  ZERO)
                           ADD    1     TO
                                       LNK-RNYURECEDEN-MEISAISU(2 IDX2)
                           IF   WRK-GAIHAKU-DAY-ST(IDX5) = 
                                               WRK-GAIHAKU-DAY-ED(IDX5)
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(2 IDX2 IDX3)
                                MOVE  "840000015"  TO
                                      LNK-RNYURECEDEN-SRYCD(2 IDX2 IDX3)
                                MOVE   WRK-GAIHAKU-DAY-ST(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(2 IDX2 IDX3)
                           ELSE
                                MOVE   "CO"   TO   
                                    LNK-RNYURECEDEN-RECSKB(2 IDX2 IDX3)
                                MOVE  "840000016"  TO
                                      LNK-RNYURECEDEN-SRYCD(2 IDX2 IDX3)
                                MOVE   WRK-GAIHAKU-DAY-ST(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(2 IDX2 IDX3)
                                                          (1:4)
                                MOVE   WRK-GAIHAKU-DAY-ED(IDX5) TO IDX6
                                MOVE   TBL-DAY(IDX6)  TO
                                    LNK-RNYURECEDEN-COMMENT(2 IDX2 IDX3)
                                                          (5:4)
                           END-IF
                           ADD    1     TO   IDX3
                       END-PERFORM
                     END-IF
                END-IF
           END-PERFORM
      *
      *
      *    ¿©»ö¾ðÊó¤ÎÊÔ½¸
           PERFORM   2103-SHOKUJI-HENSHU-SEC
      *
           .
       200-MAIN-1-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¼èÆÀ
      *****************************************************************
       210-NYUINACT-GET-SEC            SECTION.
      *
           INITIALIZE                      NYUINACT-REC
           MOVE    NACCT-HOSPNUM       TO  NSRY-HOSPNUM
           MOVE    NACCT-NYUGAIKBN     TO  NSRY-NYUGAIKBN
           MOVE    NACCT-PTID          TO  NSRY-PTID
           MOVE    NACCT-SRYYM         TO  NSRY-SRYYM
           MOVE    NACCT-ZAINUM        TO  NSRY-ZAINUM
           MOVE    "tbl_nyuinact"      TO  MCP-TABLE
           MOVE    "key9"              TO  MCP-PATHNAME
           PERFORM 910-NYUINACT-SELECT-SEC
           IF      FLG-NYUINACT        =   ZERO
               MOVE    "tbl_nyuinact"  TO  MCP-TABLE
               MOVE    "key9"          TO  MCP-PATHNAME
               PERFORM   910-NYUINACT-READ-SEC
           END-IF
      *
      *    Æþ±¡¹Ô°Ù¥¯¥í¡¼¥º
           MOVE     "tbl_nyuinact"     TO  MCP-TABLE
           MOVE     "key9"             TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       210-NYUINACT-GET-EXT.
           EXIT.
      *
      *****************************************************************
      *    ³°ÇñÁ°½èÍý
      *****************************************************************
       210-GAIHAKU-MAE-SEC            SECTION.
      *
      *    ³°Çñ¥³¡¼¥ÉÊÔ½¸ÍÑ¤ËÆþ±¡´ðËÜÎÁ²Ã»»¶èÊ¬¤È¿ÇÎÅ¶èÊ¬¤ÎÂàÈò
           INITIALIZE                      TNS-TENSU-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM
                                       TO  TNS-HOSPNUM
           MOVE    NSRY-SRYCD(1)       TO  TNS-SRYCD
           MOVE    LNK-RNYURECEDEN-SANTEIYM
                                       TO  TNS-YUKOSTYMD(1:6)
           MOVE    "01"                TO  TNS-YUKOSTYMD(7:2)
           MOVE    TNS-YUKOSTYMD       TO  TNS-YUKOEDYMD
           PERFORM 910-TENSU-READ-SEC
           IF  (LNK-RNYURECEDEN-SANTEIYM >= "202004")
           AND (TNS-SRYCD             NOT = SPACE   )
           AND (TNS-NYUKHNKSNKBN          = ZERO    )
             INITIALIZE                          SNTENSU-AREA
             MOVE  TNS-SRYCD                 TO  SNTENSU-SRYCD
             MOVE  LNK-RNYURECEDEN-SANTEIYM  TO  SNTENSU-BASEYMD(1:6)
             MOVE  "01"                      TO  SNTENSU-BASEYMD(7:2)
             CALL  "ORCSNTENSU"              USING
                                             SNTENSU-AREA
                                             TNS-TENSU-REC
                                             SPA-AREA
           END-IF
           MOVE    TNS-NYUKHNKSNKBN    TO  WRK-KSNKBN
           MOVE    TNS-CHUKSNCD        TO  WRK-CHUKSNCD-XXX
           MOVE    TNS-NYUKHNKBN       TO  WRK-NYUKHNKBN-XXX
      *
      *    Æþ±¡´ðËÜÎÁ²Ã»»¶èÊ¬ÃÖ¤­´¹¤¨
           IF  LNK-RNYURECEDEN-SANTEIYM >= "201804"
      *        ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
               IF   (TNS-NYUKHNKSNKBN = 27 )
               AND  (TNS-CDKBN-KBNNUM = 101)
                    MOVE   901   TO   WRK-KSNKBN
               END-IF
      *        Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ¡ÊÆÃÊÌÆþ±¡´ðËÜÎÁ¡Ë
               IF   (TNS-NYUKHNKSNKBN = 27 )
               AND  (TNS-CDKBN-KBNNUM = 109)
                    MOVE   909   TO   WRK-KSNKBN
               END-IF
           END-IF
      *
           .
       210-GAIHAKU-MAE-EXT.
           EXIT.
      *
      *****************************************************************
      *    ³°Çñ¿ÇÎÅ¥³¡¼¥É¼èÆÀ
      *****************************************************************
       210-GAIHAKU-SET-SEC            SECTION.
      *
           MOVE   NACCT-DAY(IDX1)     TO    WRK-GAIHAKU-KBN(IDX1)
      *
           EVALUATE   WRK-SRYKBN(IDX1)
              WHEN     "90"
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     1
                      MOVE   "190107290"   TO  WRK-GAIHAKU(IDX1)
                    WHEN     2
                      MOVE   "190107390"   TO  WRK-GAIHAKU(IDX1)
                    WHEN     4
                    WHEN     5
                    WHEN     6
                    WHEN     7
                    WHEN    14
                    WHEN    15
                    WHEN    16
                      PERFORM   2101-GAIHAKU-TAKIKAN-SEC
                    WHEN     8
                    WHEN     9
      ***           WHEN    10
      ***           WHEN    11
      ***           WHEN    12
                    WHEN    13
                    WHEN    17
                      PERFORM   2101-GAIHAKU-GENSAN-SEC
                 END-EVALUATE
              WHEN     "92"
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     1
                      MOVE   "190107490"   TO  WRK-GAIHAKU(IDX1)
                    WHEN     2
                      MOVE   "190107590"   TO  WRK-GAIHAKU(IDX1)
                    WHEN     4
                    WHEN     5
                    WHEN     6
                    WHEN     7
                    WHEN    14
                    WHEN    15
                    WHEN    16
                      PERFORM   2101-GAIHAKU-TAKIKAN-SEC
                    WHEN     8
                    WHEN     9
      ***           WHEN    10
      ***           WHEN    11
      ***           WHEN    12
                    WHEN    13
                    WHEN    17
                      PERFORM   2101-GAIHAKU-GENSAN-SEC
                 END-EVALUATE
           END-EVALUATE
      *
           .
       210-GAIHAKU-SET-EXT.
           EXIT.
      *
      *****************************************************************
      *    ³°Çñ¿ÇÎÅ¥³¡¼¥É¼èÆÀ
      *****************************************************************
       2101-GAIHAKU-TAKIKAN-SEC           SECTION.
      *
           IF       LNK-RNYURECEDEN-SANTEIYM  >=  "201804"
                   PERFORM   2101-GAIHAKU-TAKIKAN3-SEC
           ELSE
             IF     LNK-RNYURECEDEN-SANTEIYM  >=  "201604"
                   PERFORM   2101-GAIHAKU-TAKIKAN2-SEC
             ELSE
                   PERFORM   2101-GAIHAKU-TAKIKAN1-SEC
             END-IF
           END-IF
      *
           .
       2101-GAIHAKU-TAKIKAN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ³°Çñ¿ÇÎÅ¥³¡¼¥É¼èÆÀ£±
      *****************************************************************
       2101-GAIHAKU-TAKIKAN1-SEC           SECTION.
      *
           EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
      *
               WHEN   099  THRU  100
                 IF   LNK-RNYURECEDEN-SANTEIYM  >=  "201004"
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108890"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142190"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 END-IF
               WHEN   201  THRU  219
               WHEN   221  THRU  222
               WHEN   224
               WHEN   227  THRU  229
               WHEN   230  THRU  239
               WHEN   241  THRU  249
               WHEN   250  THRU  255
      *        (H26-ADD-ST)
               WHEN   256
               WHEN   257  THRU  259
               WHEN   260  THRU  261
               WHEN   262  THRU  265
               WHEN   266  THRU  267
      *        (H26-ADD-ED)
                 IF    WRK-NYUKHNKSNKBN(IDX1) = 221 OR 232
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108790"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142090"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     6
                      MOVE   "190153190"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     7
                      MOVE   "190153390"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 ELSE
                   IF  WRK-NYUKHNKSNKBN(IDX1) =
                           229 OR 238 OR 215 OR 216 OR 217 OR 239
                                                           OR 252
                     EVALUATE   NACCT-DAY(IDX1)
                       WHEN     4
                         MOVE   "190108790" TO   WRK-GAIHAKU(IDX1)
                       WHEN     5
                         MOVE   "190142090" TO   WRK-GAIHAKU(IDX1)
                       WHEN     6
                         MOVE   "190153190" TO   WRK-GAIHAKU(IDX1)
                     END-EVALUATE
                   ELSE
                     EVALUATE   NACCT-DAY(IDX1)
                       WHEN     4
                         MOVE   "190108790" TO   WRK-GAIHAKU(IDX1)
                       WHEN     5
                         MOVE   "190142090" TO   WRK-GAIHAKU(IDX1)
                     END-EVALUATE
                   END-IF
                 END-IF
               WHEN   013  THRU  021
               WHEN   101  THRU  109
               WHEN   147  THRU  152
               WHEN   173  THRU  190
               WHEN   196
      *        (H26-ADD-ST)
               WHEN   199
               WHEN   004  THRU  008
               WHEN   010  THRU  012
      *        (H26-ADD-ED)
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108890"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142190"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
               WHEN   075  THRU  080
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108990"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
               WHEN   085  THRU  086
               WHEN   132  THRU  133
               WHEN   153  THRU  158
                 IF    WRK-NYUKHNKSNKBN(IDX1) =
                           153 OR 154 OR 155 OR 156 OR 157 OR 158
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190109090"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142290"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     7
                      MOVE   "190153290"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 ELSE
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190109090"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142290"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 END-IF
               WHEN   226
               WHEN   240
                 CONTINUE
               WHEN   031
               WHEN   033
               WHEN   034
               WHEN   035
               WHEN   038
               WHEN   170
               WHEN   191
      *        (H26-ADD-ST)
               WHEN   017  THRU  020
      *        (H26-ADD-ED)
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     5
                      MOVE   "190141590"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     7
                      MOVE   "190153090"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
               WHEN   022
               WHEN   023
               WHEN   024
               WHEN   025
               WHEN   026
               WHEN   029
               WHEN   136
               WHEN   168
               WHEN   169
      *        (H26-ADD-ST)
               WHEN   013  THRU  016
      *        (H26-ADD-ED)
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     5
                      MOVE   "190141590"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     7
                      MOVE   "190153090"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
               WHEN   081
               WHEN   083
               WHEN   172
      *        (H26-ADD-ST)
               WHEN   032  THRU  037
      *        (H26-ADD-ED)
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     5
                      MOVE   "190141590"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     7
                      MOVE   "190153090"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
               WHEN   OTHER
                 EVALUATE   NACCT-DAY(IDX1)
                    WHEN     5
                      MOVE   "190141590"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
      *
           END-EVALUATE
      *
           .
       2101-GAIHAKU-TAKIKAN1-EXT.
           EXIT.
      *
      *****************************************************************
      *    ³°Çñ¿ÇÎÅ¥³¡¼¥É¼èÆÀ£²  201604
      *****************************************************************
       2101-GAIHAKU-TAKIKAN2-SEC           SECTION.
      *
           EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
      *        ÆÃÄêÆþ±¡ÎÁ
               WHEN   201  THRU  206
               WHEN   208  THRU  210
               WHEN   212  THRU  217
               WHEN   221
               WHEN   227  THRU  229
               WHEN   232  THRU  236
               WHEN   238  THRU  239
               WHEN   241  THRU  249
               WHEN   250  THRU  254
               WHEN   257  THRU  267
      *        --- H28.4 TUIKA ---
               WHEN   268  THRU  270
      *          Ç§ÃÎ¾É¼£ÎÅÉÂÅïÆþ±¡ÎÁ¡¢Àº¿ÀÎÅÍÜÉÂÅïÆþ±¡ÎÁ
      *          ÃÏ°è°Ü¹Ôµ¡Ç½¶¯²½ÉÂÅïÆþ±¡ÎÁ
                 IF  WRK-NYUKHNKSNKBN(IDX1) = 221 OR 232 OR 217 OR 268
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108790"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142090"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     6
                      MOVE   "190182990"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 ELSE
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108790"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142090"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 END-IF
      *        ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ
               WHEN   004  THRU  008
               WHEN   010  THRU  012
               WHEN   152
               WHEN   173  THRU  190
               WHEN   196
               WHEN   199
      *        --- H28.4 TUIKA ---
               WHEN   048  THRU  049
               WHEN   051  THRU  054
               WHEN   057  THRU  068
                 EVALUATE   NACCT-DAY(IDX1)
                  WHEN     4
                    MOVE   "190108890"    TO   WRK-GAIHAKU(IDX1)
                  WHEN     5
                    MOVE   "190142190"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
      *        Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ
               WHEN   153  THRU  158
                 EVALUATE   NACCT-DAY(IDX1)
                  WHEN     4
                    MOVE   "190108890"    TO   WRK-GAIHAKU(IDX1)
                  WHEN     5
                    MOVE   "190142190"    TO   WRK-GAIHAKU(IDX1)
                  WHEN     6
                    MOVE   "190109090"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
      *        Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡¦Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£³
               WHEN   226
               WHEN   240
                 CONTINUE
               WHEN   OTHER
                 EVALUATE   NACCT-DAY(IDX1)
                  WHEN     5
                    MOVE   "190141590"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
           END-EVALUATE
      *
           .
       2101-GAIHAKU-TAKIKAN2-EXT.
           EXIT.
      *
      *****************************************************************
      *    ³°Çñ¿ÇÎÅ¥³¡¼¥É¼èÆÀ£³  201804
      *****************************************************************
       2101-GAIHAKU-TAKIKAN3-SEC           SECTION.
      *
           EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
      *        ÆÃÄêÆþ±¡ÎÁ
               WHEN   200  THRU  257
               WHEN   260  THRU  263
               WHEN   902
      *          Ç§ÃÎ¾É¼£ÎÅÉÂÅïÆþ±¡ÎÁ¡¢Àº¿ÀÎÅÍÜÉÂÅïÆþ±¡ÎÁ
      *          ÃÏ°è°Ü¹Ôµ¡Ç½¶¯²½ÉÂÅïÆþ±¡ÎÁ
                 IF  WRK-NYUKHNKSNKBN(IDX1) = 255 OR 254 OR 257
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108790"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142090"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     6
                      MOVE   "190182990"    TO   WRK-GAIHAKU(IDX1)
                    WHEN    14
                      MOVE   "190214390"    TO   WRK-GAIHAKU(IDX1)
                    WHEN    15
                      MOVE   "190213990"    TO   WRK-GAIHAKU(IDX1)
                    WHEN    16
                      MOVE   "190214190"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 ELSE
                   EVALUATE   NACCT-DAY(IDX1)
                    WHEN     4
                      MOVE   "190108790"    TO   WRK-GAIHAKU(IDX1)
                    WHEN     5
                      MOVE   "190142090"    TO   WRK-GAIHAKU(IDX1)
                    WHEN    14
                      MOVE   "190214390"    TO   WRK-GAIHAKU(IDX1)
                    WHEN    15
                      MOVE   "190213990"    TO   WRK-GAIHAKU(IDX1)
                   END-EVALUATE
                 END-IF
      *        ÎÅÍÜÉÂÅïÆþ±¡´ðËÜÎÁ
               WHEN    11  THRU   14
               WHEN    51
               WHEN   901
                 EVALUATE   NACCT-DAY(IDX1)
                  WHEN     4
                    MOVE   "190108890"    TO   WRK-GAIHAKU(IDX1)
                  WHEN     5
                    MOVE   "190142190"    TO   WRK-GAIHAKU(IDX1)
                  WHEN    14
                    MOVE   "190214290"    TO   WRK-GAIHAKU(IDX1)
                  WHEN    15
                    MOVE   "190213890"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
      *        Í­¾²¿ÇÎÅ½êÎÅÍÜÉÂ¾²Æþ±¡´ðËÜÎÁ
               WHEN    26
               WHEN    53
               WHEN   909
                 EVALUATE   NACCT-DAY(IDX1)
                  WHEN     4
                    MOVE   "190108890"    TO   WRK-GAIHAKU(IDX1)
                  WHEN     5
                    MOVE   "190142190"    TO   WRK-GAIHAKU(IDX1)
                  WHEN     6
                    MOVE   "190109090"    TO   WRK-GAIHAKU(IDX1)
                  WHEN    14
                    MOVE   "190214290"    TO   WRK-GAIHAKU(IDX1)
                  WHEN    15
                    MOVE   "190213890"    TO   WRK-GAIHAKU(IDX1)
                  WHEN    16
                    MOVE   "190214090"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
      *        Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£²¡¦Ã»´üÂÚºß¼ê½Ñ´ðËÜÎÁ£³
               WHEN   258  THRU  259
                 CONTINUE
               WHEN   OTHER
                 EVALUATE   NACCT-DAY(IDX1)
                  WHEN     5
                    MOVE   "190141590"    TO   WRK-GAIHAKU(IDX1)
                  WHEN    14
                    MOVE   "190213790"    TO   WRK-GAIHAKU(IDX1)
                 END-EVALUATE
           END-EVALUATE
      *
           .
       2101-GAIHAKU-TAKIKAN3-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¸º»»¥³¡¼¥É¼èÆÀ
      *****************************************************************
       2101-GAIHAKU-GENSAN-SEC           SECTION.
      *
           IF       LNK-RNYURECEDEN-SANTEIYM  >=  "201804"
                   PERFORM   2101-GAIHAKU-GENSAN3-SEC
           ELSE
             IF     LNK-RNYURECEDEN-SANTEIYM  >=  "201604"
                   PERFORM   2101-GAIHAKU-GENSAN2-SEC
             ELSE
                   PERFORM   2101-GAIHAKU-GENSAN1-SEC
             END-IF
           END-IF
      *
           .
       2101-GAIHAKU-GENSAN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¸º»»¥³¡¼¥É¼èÆÀ£±
      *****************************************************************
       2101-GAIHAKU-GENSAN1-SEC           SECTION.
      *
           EVALUATE   NACCT-DAY(IDX1)
             WHEN     8
      ***    WHEN    11
                EVALUATE   WRK-CHUKSNCD(IDX1)
                   WHEN   "9017"
                      IF   LNK-RNYURECEDEN-SANTEIYM  >=  "201404"
                        IF  (WRK-NYUKHNKBN(IDX1) =   79 OR 88  )
                        OR  (WRK-NYUINKHN(IDX1)  =  "190799510")
                          MOVE  "190161570" TO   WRK-GAIHAKU(IDX1)
                        ELSE
                          MOVE  "190161470" TO   WRK-GAIHAKU(IDX1)
                        END-IF
                      ELSE
                          MOVE  "190161470" TO   WRK-GAIHAKU(IDX1)
                      END-IF
                   WHEN   "9018"
                      MOVE   "190161570"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9026"
                      MOVE   "190161870"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9030"
                      MOVE   "190162070"    TO   WRK-GAIHAKU(IDX1)
                END-EVALUATE
                IF   NACCT-DAY(IDX1) = 11
                    EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
                     WHEN   099  THRU  100
                      MOVE   "190142190"    TO   WRK-GAIHAKU2(IDX1)
                     WHEN   OTHER
                      MOVE   "190141590"    TO   WRK-GAIHAKU2(IDX1)
                    END-EVALUATE
                END-IF
             WHEN     9
             WHEN    13
                EVALUATE   WRK-CHUKSNCD(IDX1)
                   WHEN   "9017"
                      IF   LNK-RNYURECEDEN-SANTEIYM  >=  "201404"
                        IF  (WRK-NYUKHNKBN(IDX1) =   79 OR 88  )
                        OR  (WRK-NYUINKHN(IDX1)  =  "190799510")
                          MOVE  "190161770" TO   WRK-GAIHAKU(IDX1)
                        ELSE
                          MOVE  "190161670" TO   WRK-GAIHAKU(IDX1)
                        END-IF
                      ELSE
                          MOVE  "190161670" TO   WRK-GAIHAKU(IDX1)
                      END-IF
                   WHEN   "9018"
                      MOVE   "190161770"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9026"
                      MOVE   "190161970"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9030"
                      MOVE   "190162170"    TO   WRK-GAIHAKU(IDX1)
                END-EVALUATE
                IF   NACCT-DAY(IDX1) = 13
                    EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
                     WHEN   099  THRU  100
                      MOVE   "190142190"    TO   WRK-GAIHAKU2(IDX1)
                     WHEN   OTHER
                      MOVE   "190141590"    TO   WRK-GAIHAKU2(IDX1)
                    END-EVALUATE
                END-IF
           END-EVALUATE
      *
           .
       2101-GAIHAKU-GENSAN1-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¸º»»¥³¡¼¥É¼èÆÀ£²  201604
      *****************************************************************
       2101-GAIHAKU-GENSAN2-SEC           SECTION.
      *
           EVALUATE   NACCT-DAY(IDX1)
             WHEN     8
      ***    WHEN    11
                EVALUATE   WRK-CHUKSNCD(IDX1)
                   WHEN   "9017"
                      EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
                        WHEN     9
                        WHEN    42   THRU   44
                        WHEN    47
                        WHEN   166   THRU  167
                        WHEN   197   THRU  198
                          MOVE  "190161570" TO   WRK-GAIHAKU(IDX1)
                        WHEN   OTHER
                          MOVE  "190161470" TO   WRK-GAIHAKU(IDX1)
                      END-EVALUATE
                   WHEN   "9026"
                      MOVE   "190161870"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9030"
                      MOVE   "190162070"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9090"
                      MOVE   "190198570"    TO   WRK-GAIHAKU(IDX1)
                END-EVALUATE
                IF   NACCT-DAY(IDX1) = 11
                      MOVE   "190141590"    TO   WRK-GAIHAKU2(IDX1)
                END-IF
             WHEN     9
             WHEN    13
                EVALUATE   WRK-CHUKSNCD(IDX1)
                   WHEN   "9017"
                      EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
                        WHEN     9
                        WHEN    42   THRU   44
                        WHEN    47
                        WHEN   166   THRU  167
                        WHEN   197   THRU  198
                          MOVE  "190161770" TO   WRK-GAIHAKU(IDX1)
                        WHEN   OTHER
                          MOVE  "190161670" TO   WRK-GAIHAKU(IDX1)
                      END-EVALUATE
                   WHEN   "9026"
                      MOVE   "190161970"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9030"
                      MOVE   "190162170"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9090"
                      MOVE   "190198670"    TO   WRK-GAIHAKU(IDX1)
                END-EVALUATE
                IF   NACCT-DAY(IDX1) = 13
                      MOVE   "190141590"    TO   WRK-GAIHAKU2(IDX1)
                END-IF
           END-EVALUATE
      *
           .
       2101-GAIHAKU-GENSAN2-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¸º»»¥³¡¼¥É¼èÆÀ£³  201804
      *****************************************************************
       2101-GAIHAKU-GENSAN3-SEC           SECTION.
      *
           EVALUATE   NACCT-DAY(IDX1)
             WHEN     8
      ***    WHEN    11
                EVALUATE   WRK-CHUKSNCD(IDX1)
                   WHEN   "9017"
                      EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
                        WHEN    27
                        WHEN    40
                          MOVE  "190161570" TO   WRK-GAIHAKU(IDX1)
                        WHEN   OTHER
                          MOVE  "190161470" TO   WRK-GAIHAKU(IDX1)
                      END-EVALUATE
                   WHEN   "9026"
                      MOVE   "190161870"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9030"
                      MOVE   "190162070"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9090"
                      MOVE   "190198570"    TO   WRK-GAIHAKU(IDX1)
                END-EVALUATE
                IF   NACCT-DAY(IDX1) = 11
                      MOVE   "190141590"    TO   WRK-GAIHAKU2(IDX1)
                END-IF
             WHEN     9
             WHEN    13
             WHEN    17
                EVALUATE   WRK-CHUKSNCD(IDX1)
                   WHEN   "9017"
                      EVALUATE   WRK-NYUKHNKSNKBN(IDX1)
                        WHEN    27
                        WHEN    40
                          MOVE  "190161770" TO   WRK-GAIHAKU(IDX1)
                        WHEN   OTHER
                          MOVE  "190161670" TO   WRK-GAIHAKU(IDX1)
                      END-EVALUATE
                   WHEN   "9026"
                      MOVE   "190161970"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9030"
                      MOVE   "190162170"    TO   WRK-GAIHAKU(IDX1)
                   WHEN   "9090"
                      MOVE   "190198670"    TO   WRK-GAIHAKU(IDX1)
                END-EVALUATE
                IF   NACCT-DAY(IDX1) = 13
                      MOVE   "190141590"    TO   WRK-GAIHAKU2(IDX1)
                END-IF
                IF   NACCT-DAY(IDX1) = 17
                      MOVE   "190213790"    TO   WRK-GAIHAKU2(IDX1)
                END-IF
           END-EVALUATE
      *
           .
       2101-GAIHAKU-GENSAN3-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÅÀ¿ô·×»»½èÍý
      *****************************************************************
       210-TENSU-KEISAN-SEC            SECTION.
      *
           INITIALIZE                      TNS-TENSU-REC
           IF     (IDX2                   =     1  )
           AND    (WRK-GAIHAKU(IDX1)   NOT =   SPACE)
               MOVE    SPACE           TO      WRK-GAIHAKU-SRYCD
               IF    LNK-RNYURECEDEN-SANTEIYM   <=  "201203"
                  PERFORM    2101-GAIHAKU-NYUINKHN-SET-SEC
               END-IF
               IF    WRK-GAIHAKU-SRYCD    NOT =   SPACE
                  MOVE    WRK-GAIHAKU-SRYCD   TO  TNS-SRYCD
               ELSE
                  MOVE    WRK-SO-SRYCD(IDX1 IDX2)
                                              TO  TNS-SRYCD
               END-IF
           ELSE
                  MOVE    WRK-SO-SRYCD(IDX1 IDX2)
                                              TO  TNS-SRYCD
           END-IF
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  TNS-HOSPNUM
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  TNS-YUKOSTYMD(1:6)
           MOVE    "01"                    TO  TNS-YUKOSTYMD(7:2)
           MOVE    TNS-YUKOSTYMD           TO  TNS-YUKOEDYMD
           MOVE    TNS-SRYCD    TO   WRK-TENSU-CD
           PERFORM 910-TENSUWRK-CHK-SEC
           IF      FLG-TENSUWRK   =    ZERO
               PERFORM 910-TENSU-READ-SEC
               PERFORM 910-TTNS-HEN-SEC
           END-IF
      *
      *    ÅÀ¿ô»»Äê
           EVALUATE    TNS-TENSIKIBETU
      *        ÅÀ¿ô¡Ê¥×¥é¥¹¡Ë
               WHEN    3
                   ADD   TNS-TEN     TO  WRK-SO-TEN(IDX1)
      *        ¡ó²Ã»»
               WHEN    5
                   COMPUTE    WRK-SO-TEN(IDX1)  =
                              WRK-SO-TEN(IDX1)  +
                            ((WRK-SO-TEN(IDX1)  *
                              (TNS-TEN   /  100))  + 0.5)
      *        ¡ó¸º»»
               WHEN    6
                   COMPUTE    WRK-SO-TEN(IDX1)  =
                            ( WRK-SO-TEN(IDX1)  -
                             (WRK-SO-TEN(IDX1)  *
                             (TNS-TEN   /  100)))        +  0.5
      *        ÅÀ¿ô¡Ê¥Þ¥¤¥Ê¥¹¡Ë
               WHEN    8
                   COMPUTE  WRK-SO-TEN(IDX1)  =
                            WRK-SO-TEN(IDX1)  -  TNS-TEN
      *        WHEN  OTHER
      *            ADD   TNS-TEN     TO  WRK-SO-TEN(IDX1)
           END-EVALUATE
      *
      *    ¿ÇÎÅ¥³¡¼¥É·×
           MOVE    TNS-SRYCD          TO  WRK-SRYCD-X
           COMPUTE WRK-SO-SRYCDTOTAL(IDX1)  =
                   WRK-SO-SRYCDTOTAL(IDX1)  +   WRK-SRYCD-9
           ADD      1          TO  WRK-SO-MEISAISU(IDX1)
      *
           .
       210-TENSU-KEISAN-EXT.
           EXIT.
      *
      **************************************************************
      *    ³°Çñ»þ¤ÎÆþ±¡´ðËÜÎÁ¼èÆÀ
      **************************************************************
       2101-GAIHAKU-NYUINKHN-SET-SEC           SECTION.
      *
           MOVE    SPACE    TO   WRK-GAIHAKU-SRYCD
      *
           EVALUATE  WRK-SO-SRYCD(IDX1 IDX2)
               WHEN  "190078210"
                     MOVE  "190077410"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078310"
                     MOVE  "190077510"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078410"
                     MOVE  "190077610"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078510"
                     MOVE  "190077710"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078610"
                     MOVE  "190077810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078710"
                     MOVE  "190077910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078810"
                     MOVE  "190078010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190078910"
                     MOVE  "190078110"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190082410"
                     MOVE  "190081710"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190082510"
                     MOVE  "190081810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190082610"
                     MOVE  "190081910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190082710"
                     MOVE  "190082010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190082810"
                     MOVE  "190082110"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190082910"
                     MOVE  "190082210"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190083010"
                     MOVE  "190082310"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190084310"
                     MOVE  "190083610"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190084410"
                     MOVE  "190083710"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190084510"
                     MOVE  "190083810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190084610"
                     MOVE  "190083910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190084710"
                     MOVE  "190084010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190084810"
                     MOVE  "190084110"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190084910"
                     MOVE  "190084210"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190087410"
                     MOVE  "190085910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190087510"
                     MOVE  "190086010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190087610"
                     MOVE  "190086110"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190087710"
                     MOVE  "190086210"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190087810"
                     MOVE  "190086310"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190087910"
                     MOVE  "190086410"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088010"
                     MOVE  "190086510"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088110"
                     MOVE  "190086610"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088210"
                     MOVE  "190086710"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088310"
                     MOVE  "190086810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088410"
                     MOVE  "190086910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088510"
                     MOVE  "190087010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088610"
                     MOVE  "190087110"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088710"
                     MOVE  "190087210"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190088810"
                     MOVE  "190087310"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190094710"
                     MOVE  "190093710"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190094810"
                     MOVE  "190093810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190094910"
                     MOVE  "190093910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190095010"
                     MOVE  "190094010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190095110"
                     MOVE  "190094110"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190797410"
                     MOVE  "190796610"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190797510"
                     MOVE  "190796710"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190797610"
                     MOVE  "190796810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190797710"
                     MOVE  "190796910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190797810"
                     MOVE  "190797010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190797910"
                     MOVE  "190797110"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190798010"
                     MOVE  "190797210"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190798110"
                     MOVE  "190797310"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190803510"
                     MOVE  "190802810"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190803610"
                     MOVE  "190802910"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190803710"
                     MOVE  "190803010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190803810"
                     MOVE  "190803110"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190803910"
                     MOVE  "190803210"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190804010"
                     MOVE  "190803310"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190804110"
                     MOVE  "190803410"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190091210"
                     MOVE  "190090210"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190091310"
                     MOVE  "190090310"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190109670"
                     MOVE  "190097010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190808870"
                     MOVE  "190805710"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190117070"
                     MOVE  "190097010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190813270"
                     MOVE  "190805710"      TO   WRK-GAIHAKU-SRYCD
      *
               WHEN  "190117670"
                     MOVE  "190097010"      TO   WRK-GAIHAKU-SRYCD
               WHEN  "190813870"
                     MOVE  "190805710"      TO   WRK-GAIHAKU-SRYCD
      *        ¿ÇÎÅ½êÏ·¿Í°åÎÅ´ÉÍýÎÁ
               WHEN  "190774210"
                     MOVE  "190774110"      TO   WRK-GAIHAKU-SRYCD
      *        Ï·¿ÍÀ­Ç§ÃÎ¾É¼À´µ¼£ÎÅÉÂÅïÆþ±¡ÎÁ£±
               WHEN  "190740010"
                     MOVE  "190739910"      TO   WRK-GAIHAKU-SRYCD
      *        Ï·¿ÍÀ­Ç§ÃÎ¾É¼À´µ¼£ÎÅÉÂÅïÆþ±¡ÎÁ£²
               WHEN  "190813510"
                     MOVE  "190813410"      TO   WRK-GAIHAKU-SRYCD
           END-EVALUATE
      *
           IF   (LNK-RNYURECEDEN-SANTEIYM  >= "200604"   )
           AND  (WRK-GAIHAKU-SRYCD  = "190774110" OR
                                      "190739910" OR
                                      "190813410")
               MOVE    SPACE    TO    WRK-GAIHAKU-SRYCD
           END-IF
      *
           IF    WRK-GAIHAKU-SRYCD   NOT =   SPACE
               MOVE   WRK-GAIHAKU-SRYCD   TO   WRK-SO-SRYCD(IDX1 IDX2)
           END-IF
      *
           .
       2101-GAIHAKU-NYUINKHN-SET-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¿©»ö¾ðÊó¤ÎÊÔ½¸¡Ê¿©»öÎÅÍÜÈñ¿©¿ô¥Ù¡¼¥¹¡Ë
      *    Ê¿À®£²£¸Ç¯ÅÙ¿©»öÎÅÍÜÈñ²þÄê¡ÊÎ®Æ°¿©ÂÐ±þ¡Ë
      *****************************************************************
       2103-SHOKUJI-HENSHU-SEC        SECTION.
      *
      **     DISPLAY "2103-SHOKUJI-HENSHU-SEC"
      **     DISPLAY "LNK-RNYURECEDEN-HKNCOMBI = "
      **              LNK-RNYURECEDEN-HKNCOMBI
      *
      *¿©»ö¤ÎÊÝ¸±ÁÈ¹ç¤»¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤ëÆü¤ÏÆþ±¡°·¤¤¤È¤¹¤ë
           PERFORM   VARYING   IDX1   FROM  1   BY  1
                     UNTIL     IDX1   >    31
                IF   (WRK-SKJ-HKNCOMBI-ASA(IDX1) NOT = ZERO) OR
                     (WRK-SKJ-HKNCOMBI-HIRU(IDX1) NOT = ZERO) OR
                     (WRK-SKJ-HKNCOMBI-YORU(IDX1) NOT = ZERO)
                     MOVE   "XXXXXXXXX"   TO  WRK-NYUINKHN(IDX1)
                END-IF
           END-PERFORM
      *
      *¿©»ö¾ðÊó¤Î¼èÆÀ¡ÊÄ«¿©¡Ë¡ÊÆþ±¡²ñ·×¡Ë
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key30"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               MOVE    "key30"             TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   VARYING   IDX1   FROM  1   BY  1
                         UNTIL     IDX1   >    31
      *
                   MOVE    NACCT-DAY(IDX1) TO  WRK-SKJ-ASA-ARI(IDX1)
      *
                   IF    (WRK-SKJ-HKNCOMBI-ASA(IDX1) NOT = ZERO)  AND
                         (NACCT-DAY(IDX1)    NOT =  ZERO)     AND
                        ((WRK-NYUINKHN(IDX1) NOT =  SPACE)    OR
                         (LNK-NYUINDAY-KBN(IDX1) =  "1"  ))   AND
                        ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO)     OR
                         (WRK-GAIHAKU-KBN(IDX1) >=  4))
                       MOVE   WRK-SKJ-HKNCOMBI-ASA(IDX1)
                                       TO  WRK-SKJ4-HKNCOMBI-DAY(IDX1)
      *                                     WRK-SKJ5-HKNCOMBI-DAY(IDX1)
      *                                     WRK-SKJ6-HKNCOMBI-DAY(IDX1)
                       EVALUATE   NACCT-DAY(IDX1)
                           WHEN   1
                               MOVE   WRK-SYS5000-SHOKUCD(1 IDX1)
                                              TO  WRK-SKJ4-RYOYO(IDX1)
                           WHEN   2
                               MOVE   WRK-SYS5000-SHOKUCD(1 IDX1)
                                              TO  WRK-SKJ4-RYOYO(IDX1)
      *                        ÆÃÊÌ¿©²Ã»»¤ÏÆþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¤Î¾ì¹ç
      *                        ¤Î¤ß¥»¥Ã¥È
                               IF   WRK-SYS5000-SHOKUCD(1 IDX1)  =
                                                            "197000110"
                                   MOVE   "197000470"
                                           TO  WRK-SKJ5-TOKU-SHOKU(IDX1)
                               END-IF
      *                    Î®Æ°¿©
                           WHEN   3
                               EVALUATE   WRK-SYS5000-SHOKUCD(1 IDX1)
      *                            Æþ±¡»þ¿©»öÎÅÍÜÈñ¡Ê£±¡Ë
                                   WHEN   "197000110"
                                      MOVE   "197003110"
                                              TO  WRK-SKJ4-RYOYO(IDX1)
      *                            Æþ±¡»þ¿©»öÎÅÍÜÈñ¡Ê£²¡Ë
                                   WHEN   "197000710"
                                      MOVE   "197003210"
                                              TO  WRK-SKJ4-RYOYO(IDX1)
                               END-EVALUATE
                       END-EVALUATE
      *                ¿©Æ²²Ã»»
                       IF    WRK-SYS5000-SHOKUCD(3 IDX1)  NOT = SPACE
                           MOVE  WRK-SYS5000-SHOKUCD(3 IDX1)
                                          TO  WRK-SKJ6-SHOKUDOU(IDX1)
                       END-IF
                   END-IF
      *
               END-PERFORM
           END-IF
      *
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"             TO  MCP-TABLE
           MOVE    "key30"                     TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *¿©»ö¾ðÊó¤Î¼èÆÀ¡ÊÃë¿©¡Ë¡ÊÆþ±¡²ñ·×¡Ë
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key31"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               MOVE    "key31"             TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   VARYING   IDX1   FROM  1   BY  1
                         UNTIL     IDX1   >    31
                   COMPUTE   IDX2   =    IDX1   +   31
      *
                   MOVE    NACCT-DAY(IDX1) TO  WRK-SKJ-HIRU-ARI(IDX1)
      *
                   IF    (WRK-SKJ-HKNCOMBI-HIRU(IDX1) NOT = ZERO)  AND
                         (NACCT-DAY(IDX1)    NOT =  ZERO)     AND
                        ((WRK-NYUINKHN(IDX1) NOT =  SPACE)    OR
                         (LNK-NYUINDAY-KBN(IDX1) =  "1"  ))   AND
                        ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO)     OR
                         (WRK-GAIHAKU-KBN(IDX1) >=  4))
                       MOVE   WRK-SKJ-HKNCOMBI-HIRU(IDX1)
                                       TO  WRK-SKJ4-HKNCOMBI-DAY(IDX2)
      *                                     WRK-SKJ5-HKNCOMBI-DAY(IDX2)
      *                                     WRK-SKJ6-HKNCOMBI-DAY(IDX2)
                       EVALUATE   NACCT-DAY(IDX1)
                           WHEN   1
                               MOVE   WRK-SYS5000-SHOKUCD(1 IDX1)
                                              TO  WRK-SKJ4-RYOYO(IDX2)
                           WHEN   2
                               MOVE   WRK-SYS5000-SHOKUCD(1 IDX1)
                                              TO  WRK-SKJ4-RYOYO(IDX2)
      *                        ÆÃÊÌ¿©²Ã»»¤ÏÆþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¤Î¾ì¹ç
      *                        ¤Î¤ß¥»¥Ã¥È
                               IF   WRK-SYS5000-SHOKUCD(1 IDX1)  =
                                                            "197000110"
                                   MOVE   "197000470"
                                           TO  WRK-SKJ5-TOKU-SHOKU(IDX2)
                               END-IF
      *                    Î®Æ°¿©
                           WHEN   3
                               EVALUATE   WRK-SYS5000-SHOKUCD(1 IDX1)
      *                            Æþ±¡»þ¿©»öÎÅÍÜÈñ¡Ê£±¡Ë
                                   WHEN   "197000110"
                                      MOVE   "197003110"
                                              TO  WRK-SKJ4-RYOYO(IDX2)
      *                            Æþ±¡»þ¿©»öÎÅÍÜÈñ¡Ê£²¡Ë
                                   WHEN   "197000710"
                                      MOVE   "197003210"
                                              TO  WRK-SKJ4-RYOYO(IDX2)
                               END-EVALUATE
                       END-EVALUATE
      *                ¿©Æ²²Ã»»
                       IF    WRK-SYS5000-SHOKUCD(3 IDX1)  NOT = SPACE
                           MOVE  WRK-SYS5000-SHOKUCD(3 IDX1)
                                          TO  WRK-SKJ6-SHOKUDOU(IDX1)
                       END-IF
                   END-IF
      *
               END-PERFORM
           END-IF
      *
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"             TO  MCP-TABLE
           MOVE    "key31"                     TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *¿©»ö¾ðÊó¤Î¼èÆÀ¡ÊÍ¼¿©¡Ë¡ÊÆþ±¡²ñ·×¡Ë
           INITIALIZE                          NYUINACCT-REC
           MOVE    LNK-RNYURECEDEN-HOSPNUM  TO  NACCT-HOSPNUM
           MOVE    LNK-RNYURECEDEN-PTID     TO  NACCT-PTID
           MOVE    LNK-RNYURECEDEN-SANTEIYM TO  NACCT-SRYYM
           MOVE    "tbl_nyuinacct"         TO  MCP-TABLE
           MOVE    "key32"                 TO  MCP-PATHNAME
           PERFORM 910-NYUINACCT-SELECT-SEC
           IF      FLG-NYUINACCT           =   ZERO
               MOVE    "tbl_nyuinacct"     TO  MCP-TABLE
               MOVE    "key32"             TO  MCP-PATHNAME
               PERFORM   910-NYUINACCT-READ-SEC
               PERFORM   VARYING   IDX1   FROM  1   BY  1
                         UNTIL     IDX1   >    31
                   COMPUTE   IDX3   =    IDX1   +   62
      *
                   IF    (WRK-SKJ-HKNCOMBI-YORU(IDX1) NOT = ZERO)  AND
                         (NACCT-DAY(IDX1)    NOT =  ZERO)     AND
                        ((WRK-NYUINKHN(IDX1) NOT =  SPACE)    OR
                         (LNK-NYUINDAY-KBN(IDX1) =  "1"  ))   AND
                        ((WRK-GAIHAKU-KBN(IDX1)  =  ZERO)     OR
                         (WRK-GAIHAKU-KBN(IDX1) >=  4))
                       MOVE   WRK-SKJ-HKNCOMBI-YORU(IDX1)
                                       TO  WRK-SKJ4-HKNCOMBI-DAY(IDX3)
      *                                     WRK-SKJ5-HKNCOMBI-DAY(IDX3)
      *                                     WRK-SKJ6-HKNCOMBI-DAY(IDX3)
                       EVALUATE   NACCT-DAY(IDX1)
                           WHEN   1
                               MOVE   WRK-SYS5000-SHOKUCD(1 IDX1)
                                              TO  WRK-SKJ4-RYOYO(IDX3)
                           WHEN   2
                               MOVE   WRK-SYS5000-SHOKUCD(1 IDX1)
                                              TO  WRK-SKJ4-RYOYO(IDX3)
      *                        ÆÃÊÌ¿©²Ã»»¤ÏÆþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¤Î¾ì¹ç
      *                        ¤Î¤ß¥»¥Ã¥È
                               IF   WRK-SYS5000-SHOKUCD(1 IDX1)  =
                                                            "197000110"
                                   MOVE   "197000470"
                                           TO  WRK-SKJ5-TOKU-SHOKU(IDX3)
                               END-IF
      *                    Î®Æ°¿©
                           WHEN   3
                               EVALUATE   WRK-SYS5000-SHOKUCD(1 IDX1)
      *                            Æþ±¡»þ¿©»öÎÅÍÜÈñ¡Ê£±¡Ë
                                   WHEN   "197000110"
                                      MOVE   "197003110"
                                              TO  WRK-SKJ4-RYOYO(IDX3)
      *                            Æþ±¡»þ¿©»öÎÅÍÜÈñ¡Ê£²¡Ë
                                   WHEN   "197000710"
                                      MOVE   "197003210"
                                              TO  WRK-SKJ4-RYOYO(IDX3)
                               END-EVALUATE
                       END-EVALUATE
      *                ¿©Æ²²Ã»»
                       IF    WRK-SYS5000-SHOKUCD(3 IDX1)  NOT = SPACE
                           MOVE  WRK-SYS5000-SHOKUCD(3 IDX1)
                                          TO  WRK-SKJ6-SHOKUDOU(IDX1)
                       END-IF
                   END-IF
      *
               END-PERFORM
           END-IF
      *
      *    Æþ±¡²ñ·×¥¯¥í¡¼¥º
           MOVE    "tbl_nyuinacct"             TO  MCP-TABLE
           MOVE    "key32"                     TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
      *     DISPLAY "---------SKJ4 SKJ5 CLEAR MAE -----------------"
      *     PERFORM    VARYING  IDX1   FROM 1 BY 1
      *       UNTIL    IDX1 > 93
      *           DISPLAY  "IDX1 = " IDX1
      *                    " WRK-SKJ4-HKNCOMBI-DAY = "
      *                    WRK-SKJ4-HKNCOMBI-DAY(IDX1)
      *                    " WRK-SKJ5-HKNCOMBI-DAY = "
      *                    WRK-SKJ5-HKNCOMBI-DAY(IDX1)
      *     END-PERFORM
      *
      *    °ú¿ô¤Ç¥»¥Ã¥È¤µ¤ì¤¿ÊÝ¸±ÁÈ¹ç¤»ÈÖ¹æ°Ê³°¤ÏSKJ4,SKJ5ÎÎ°è¤Î
      *    ¥»¥Ã¥ÈÆâÍÆ¤ò¥¯¥ê¥¢¤¹¤ë
           PERFORM    VARYING  IDX1   FROM 1 BY 1
             UNTIL    IDX1 > 93
                 IF   WRK-SKJ4-HKNCOMBI-DAY(IDX1)  NOT =  ZERO
                   IF   WRK-SKJ4-HKNCOMBI-DAY(IDX1)  =
                                  LNK-RNYURECEDEN-HKNCOMBI
                       CONTINUE
                   ELSE
                       MOVE    SPACE   TO   WRK-SKJ4-TBL(IDX1)
                       INITIALIZE           WRK-SKJ4-TBL(IDX1)
                   END-IF
                 END-IF
                 IF   WRK-SKJ5-HKNCOMBI-DAY(IDX1)  NOT =  ZERO
                   IF   WRK-SKJ5-HKNCOMBI-DAY(IDX1)  =
                                  LNK-RNYURECEDEN-HKNCOMBI
                       CONTINUE
                   ELSE
                       MOVE    SPACE   TO   WRK-SKJ5-TBL(IDX1)
                       INITIALIZE           WRK-SKJ5-TBL(IDX1)
                   END-IF
                 END-IF
           END-PERFORM
      *     DISPLAY "---------SKJ4 SKJ5 CLEAR ATO -----------------"
      *     PERFORM    VARYING  IDX1   FROM 1 BY 1
      *       UNTIL    IDX1 > 93
      *           DISPLAY  "IDX1 = " IDX1
      *                    " WRK-SKJ4-HKNCOMBI-DAY = "
      *                    WRK-SKJ4-HKNCOMBI-DAY(IDX1)
      *                    " WRK-SKJ5-HKNCOMBI-DAY = "
      *                    WRK-SKJ5-HKNCOMBI-DAY(IDX1)
      *     END-PERFORM
      *
      *    Æ±ÆüºÆÆþ±¡Æü¤ËÂ¾ÊÝ¸±¤Ç¿©»ö¤Î»»Äê¤¬¤¢¤ë¾ì¹ç¤Ë
      *    ¿©Æ²²Ã»»¤ò¥¯¥ê¥¢¤¹¤ë
           PERFORM      VARYING   IDX1   FROM   1  BY  1
             UNTIL      IDX1     >    31
                IF   LNK-NYUINDAY-DOUJITSU-KBN(IDX1)  =  "1"
      *            Ä«¿©¤òÂ¾ÊÝ¸±¤Ç»»Äê
                   IF  WRK-SKJ-ASA-ARI(IDX1)  NOT =  ZERO
                      IF   WRK-SKJ-HKNCOMBI-ASA(IDX1)   =  ZERO
                          MOVE   "1"  TO  WRK-TAHOKEN-SHOKUDOU-FLG(IDX1)
                      END-IF
                   END-IF
      *            Ä«¿©Ëô¤ÏÃë¿©¤òÂ¾ÊÝ¸±¤Ç»»Äê
                   IF (WRK-SKJ-ASA-ARI(IDX1)   NOT =  ZERO)  OR
                      (WRK-SKJ-HIRU-ARI(IDX1)  NOT =  ZERO)
                      IF  (WRK-SKJ-HKNCOMBI-ASA(IDX1)   =  ZERO) AND
                          (WRK-SKJ-HKNCOMBI-HIRU(IDX1)  =  ZERO)
                          MOVE   "1"  TO  WRK-TAHOKEN-SHOKUDOU-FLG(IDX1)
                      END-IF
                   END-IF
               END-IF
           END-PERFORM
      *
      *    ¿©Æ²²Ã»»¥¯¥ê¥¢¥Õ¥é¥°¤Ë¤è¤ë¿©Æ²²Ã»»ÎÎ°è¤Î¥¯¥ê¥¢
           PERFORM      VARYING   IDX1   FROM   1  BY  1
             UNTIL      IDX1     >    31
      **       DISPLAY "IDX1 = " IDX1 " WRK-TAHOKEN-SHOKUDOU-FLG = "
      **                WRK-TAHOKEN-SHOKUDOU-FLG(IDX1)
      **                       " SHOKUDOU = "  WRK-SKJ6-SHOKUDOU(IDX1)
      **                       " ASA " WRK-SKJ-ASA-ARI(IDX1)
      **                       " HIRU " WRK-SKJ-HIRU-ARI(IDX1)
             IF    WRK-TAHOKEN-SHOKUDOU-FLG(IDX1)  =   "1"
                 MOVE    SPACE     TO  WRK-SKJ6-SHOKUDOU(IDX1)
             END-IF
           END-PERFORM
      *
      *
      *    ¿©»ö¥ï¡¼¥¯£·¤ÎÊÔ½¸¡ÊÆ±°ìºÞ¤Þ¤È¤áÍÑ¡Ë
           PERFORM      VARYING    IDX1   FROM   1  BY  1
                        UNTIL      IDX1   >   31
      *        ¿©»öÎÅÍÜÈñ¡ÊÄ«¡Ë
               IF    WRK-SKJ4-RYOYO(IDX1)  NOT =   SPACE
                   MOVE  WRK-SKJ4-HKNCOMBI-DAY(IDX1)
                                       TO  WRK-SKJ7-HKNCOMBI-DAY(IDX1)
                   IF   WRK-SKJ4-RYOYO(IDX1)   =   CONS-SKJ-RYOYO-1-1
                                               OR  CONS-SKJ-RYOYO-2-1
                       MOVE  WRK-SKJ4-RYOYO(IDX1)
                                       TO  WRK-SKJ7-RYOYO(IDX1)
                       ADD   1     TO  WRK-SKJ7-RYOYO-SU(IDX1)
                   END-IF
                   IF   WRK-SKJ4-RYOYO(IDX1)   =   CONS-SKJ-RYOYO-1-2
                                               OR  CONS-SKJ-RYOYO-2-2
                       MOVE  WRK-SKJ4-RYOYO(IDX1)
                                       TO  WRK-SKJ7-RYOYO-RYU(IDX1)
                        ADD   1     TO  WRK-SKJ7-RYOYO-RYU-SU(IDX1)
                   END-IF
               END-IF
      *        ÆÃÊÌ¿©²Ã»»¡ÊÄ«¡Ë
               IF    WRK-SKJ5-TOKU-SHOKU(IDX1)  NOT =   SPACE
                   MOVE  WRK-SKJ5-TOKU-SHOKU(IDX1)
                                       TO  WRK-SKJ7-TOKU-SHOKU(IDX1)
                   ADD   1             TO  WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
               END-IF
      *        ¿©»öÎÅÍÜÈñ¡ÊÃë¡Ë
               MOVE      ZERO          TO  IDX2
               COMPUTE   IDX2     =    IDX1    +   31
               IF    WRK-SKJ4-RYOYO(IDX2)  NOT =   SPACE
                   MOVE  WRK-SKJ4-HKNCOMBI-DAY(IDX2)
                                       TO  WRK-SKJ7-HKNCOMBI-DAY(IDX1)
                   IF   WRK-SKJ4-RYOYO(IDX2)   =   CONS-SKJ-RYOYO-1-1
                                               OR  CONS-SKJ-RYOYO-2-1
                       MOVE  WRK-SKJ4-RYOYO(IDX2)
                                       TO  WRK-SKJ7-RYOYO(IDX1)
                       ADD   1     TO  WRK-SKJ7-RYOYO-SU(IDX1)
                   END-IF
                   IF   WRK-SKJ4-RYOYO(IDX2)   =   CONS-SKJ-RYOYO-1-2
                                               OR  CONS-SKJ-RYOYO-2-2
                       MOVE  WRK-SKJ4-RYOYO(IDX2)
                                       TO  WRK-SKJ7-RYOYO-RYU(IDX1)
                        ADD   1     TO  WRK-SKJ7-RYOYO-RYU-SU(IDX1)
                   END-IF
               END-IF
      *        ÆÃÊÌ¿©²Ã»»¡ÊÃë¡Ë
               IF    WRK-SKJ5-TOKU-SHOKU(IDX2)  NOT =   SPACE
                   MOVE  WRK-SKJ5-TOKU-SHOKU(IDX2)
                                       TO  WRK-SKJ7-TOKU-SHOKU(IDX1)
                   ADD   1             TO  WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
               END-IF
      *        ¿©»öÎÅÍÜÈñ¡ÊÍ¼¡Ë
               MOVE      ZERO          TO  IDX3
               COMPUTE   IDX3     =    IDX1    +   62
               IF    WRK-SKJ4-RYOYO(IDX3)  NOT =   SPACE
                   MOVE  WRK-SKJ4-HKNCOMBI-DAY(IDX3)
                                       TO  WRK-SKJ7-HKNCOMBI-DAY(IDX1)
                   IF   WRK-SKJ4-RYOYO(IDX3)   =   CONS-SKJ-RYOYO-1-1
                                               OR  CONS-SKJ-RYOYO-2-1
                       MOVE  WRK-SKJ4-RYOYO(IDX3)
                                       TO  WRK-SKJ7-RYOYO(IDX1)
                       ADD   1     TO  WRK-SKJ7-RYOYO-SU(IDX1)
                   END-IF
                   IF   WRK-SKJ4-RYOYO(IDX3)   =   CONS-SKJ-RYOYO-1-2
                                               OR  CONS-SKJ-RYOYO-2-2
                       MOVE  WRK-SKJ4-RYOYO(IDX3)
                                       TO  WRK-SKJ7-RYOYO-RYU(IDX1)
                        ADD   1     TO  WRK-SKJ7-RYOYO-RYU-SU(IDX1)
                   END-IF
               END-IF
      *        ÆÃÊÌ¿©²Ã»»¡ÊÍ¼¡Ë
               IF    WRK-SKJ5-TOKU-SHOKU(IDX3)  NOT =   SPACE
                   MOVE  WRK-SKJ5-TOKU-SHOKU(IDX3)
                                       TO  WRK-SKJ7-TOKU-SHOKU(IDX1)
                   ADD   1             TO  WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
               END-IF
      *        ¿©»ö²ó¿ô
      **         IF    (WRK-SKJ4-RYOYO(IDX1)  NOT =   SPACE)   AND
      **               (WRK-SKJ4-RYOYO(IDX2)  NOT =   SPACE)   AND
      **               (WRK-SKJ4-RYOYO(IDX3)  NOT =   SPACE)
      **             MOVE      1         TO   WRK-SKJ7-KAISU(IDX1)
      **         END-IF
      *        ¿©Æ²²Ã»»
               IF    WRK-SKJ6-SHOKUDOU(IDX1)  NOT =   SPACE
                   MOVE  WRK-SKJ6-SHOKUDOU(IDX1)
                                       TO  WRK-SKJ7-SHOKUDOU(IDX1)
               END-IF
           END-PERFORM
      *
      *    ¿©»ö¤Î¿ÇÎÅ¥³¡¼¥É·×
           PERFORM    VARYING   IDX1    FROM  1  BY  1
                      UNTIL     IDX1    >   31
               IF   WRK-SKJ7-RYOYO(IDX1)  NOT =  SPACE
                   MOVE    WRK-SKJ7-RYOYO(IDX1)       TO WRK-SRYCD-X
                   COMPUTE WRK-SKJ7-SRYCDTOTAL(IDX1)  =
                           WRK-SKJ7-SRYCDTOTAL(IDX1)  +  WRK-SRYCD-9
               END-IF
               IF   WRK-SKJ7-RYOYO-RYU(IDX1)  NOT =  SPACE
                   MOVE    WRK-SKJ7-RYOYO-RYU(IDX1)   TO WRK-SRYCD-X
                   COMPUTE WRK-SKJ7-SRYCDTOTAL(IDX1)  =
                           WRK-SKJ7-SRYCDTOTAL(IDX1)  +  WRK-SRYCD-9
               END-IF
               IF   WRK-SKJ7-SHOKUDOU(IDX1)  NOT =  SPACE
                   MOVE    WRK-SKJ7-SHOKUDOU(IDX1)    TO WRK-SRYCD-X
                   COMPUTE WRK-SKJ7-SRYCDTOTAL(IDX1)  =
                           WRK-SKJ7-SRYCDTOTAL(IDX1)  +  WRK-SRYCD-9
               END-IF
               IF   WRK-SKJ7-TOKU-SHOKU(IDX1)  NOT =  SPACE
                   MOVE    WRK-SKJ7-TOKU-SHOKU(IDX1)  TO WRK-SRYCD-X
                   COMPUTE WRK-SKJ7-SRYCDTOTAL(IDX1)  =
                           WRK-SKJ7-SRYCDTOTAL(IDX1)  +  WRK-SRYCD-9
               END-IF
               IF   WRK-SKJ7-SKJFTN(IDX1)      NOT =  SPACE
                   MOVE    WRK-SKJ7-SKJFTN(IDX1)  TO WRK-SRYCD-X
                   COMPUTE WRK-SKJ7-SRYCDTOTAL(IDX1)  =
                           WRK-SKJ7-SRYCDTOTAL(IDX1)  +  WRK-SRYCD-9
               END-IF
               ADD   WRK-SKJ7-RYOYO-SU(IDX1)
                                     TO  WRK-SKJ7-SRYCDTOTAL(IDX1)
      **         ADD   WRK-SKJ7-RYOYO-RYU-SU(IDX1)
      **                               TO  WRK-SKJ7-SRYCDTOTAL(IDX1)
               COMPUTE    WRK-SKJ7-SRYCDTOTAL(IDX1)  =
                          WRK-SKJ7-SRYCDTOTAL(IDX1)  +
                         (WRK-SKJ7-RYOYO-RYU-SU(IDX1)  *  3)
               ADD   WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
                                     TO  WRK-SKJ7-SRYCDTOTAL(IDX1)
               EVALUATE    WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
                   WHEN    1
                       ADD  1   TO   WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1)
                   WHEN    2
                       ADD  1   TO   WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1)
                   WHEN    3
                       ADD  1   TO   WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1)
               END-EVALUATE
               ADD   WRK-SKJ7-SKJFTN-SU(IDX1)
                                     TO  WRK-SKJ7-SRYCDTOTAL(IDX1)
               MOVE  1               TO  WRK-SKJ7-DAY(IDX1 IDX1)
           END-PERFORM
      *
      *     DISPLAY "WRK-SKJ7  MATOME BEFORE"
      *     PERFORM      VARYING    IDX1   FROM   1  BY  1
      *                  UNTIL      IDX1   >   31
      *          DISPLAY "IDX1 = " IDX1
      *          DISPLAY "WRK-SKJ7-HKNCOMBI-DAY(IDX1) = "
      *                   WRK-SKJ7-HKNCOMBI-DAY(IDX1)
      *          DISPLAY "WRK-SKJ7-RYOYO(IDX1) = "
      *                   WRK-SKJ7-RYOYO(IDX1)
      *          DISPLAY "WRK-SKJ7-RYOYO-SU(IDX1) = "
      *                   WRK-SKJ7-RYOYO-SU(IDX1)
      *          DISPLAY "WRK-SKJ7-SHOKUDOU(IDX1) = "
      *                   WRK-SKJ7-SHOKUDOU(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-SU(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1)
      *          DISPLAY "WRK-SKJ7-KAISU =(IDX1) = "
      *                   WRK-SKJ7-KAISU (IDX1)
      *          DISPLAY "WRK-SKJ7-SRYCDTOTAL =(IDX1) = "
      *                   WRK-SKJ7-SRYCDTOTAL (IDX1)
      *     END-PERFORM
      *
      *    ºÆ¹½ÃÛ¤·¤¿¿©»ö¾ðÊó¤«¤éÆ±°ìºÞ¤Î¤Þ¤È¤á½èÍý
      *    ¿©»ö¥ï¡¼¥¯
           PERFORM      VARYING    IDX1   FROM   1  BY  1
                        UNTIL      IDX1   >   31
               IF    WRK-SKJ7-SRYCDTOTAL(IDX1)  NOT =   ZERO
                   ADD   1                  TO  WRK-SKJ7-KAISU(IDX1)
                   MOVE       ZERO          TO  IDX2
                   COMPUTE    IDX2          =   IDX1    +   1
                   PERFORM    VARYING    IDX3   FROM   IDX2  BY  1
                              UNTIL      IDX3   >   31
                       IF    (WRK-SKJ7-HKNCOMBI-DAY(IDX3)  =
                                       WRK-SKJ7-HKNCOMBI-DAY(IDX1)) AND
                             (WRK-SKJ7-SRYCDTOTAL(IDX3)  =
                                       WRK-SKJ7-SRYCDTOTAL(IDX1))
                             IF   WRK-SKJ7-TOKU-SHOKU(IDX3) NOT = SPACE
                                 MOVE  WRK-SKJ7-TOKU-SHOKU(IDX3)  TO
                                           WRK-SKJ7-TOKU-SHOKU(IDX1)
                             END-IF
                             IF   WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX3)
                                                      NOT =  ZERO
                                     ADD   1   TO  
                                        WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1)
                             END-IF
                             IF   WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX3)
                                                      NOT =  ZERO
                                     ADD   1   TO  
                                        WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1)
                             END-IF
                             IF   WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX3)
                                                      NOT =  ZERO
                                     ADD   1   TO  
                                        WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1)
                             END-IF
                             ADD     1    TO    WRK-SKJ7-KAISU(IDX1)
                             MOVE    1    TO    WRK-SKJ7-DAY(IDX1 IDX3)
                             INITIALIZE   WRK-SKJ7-TBL(IDX3)
                       END-IF
                   END-PERFORM
               END-IF
           END-PERFORM
      *
      *    ¥ì¥»ÅÅ¥µ¥ÖÊÖµÑ¥¨¥ê¥¢¤Ø¤Î¿©»ö¥»¥Ã¥È
           MOVE       ZERO    TO   IDX2
           MOVE       ZERO    TO   IDX3
           PERFORM    VARYING   IDX1   FROM  1  BY  1
                      UNTIL     (IDX1   >     31)
      *          DISPLAY "WRK-SKJ7  MATOME AFTER"
      *          DISPLAY "IDX1 = " IDX1
      *          DISPLAY "WRK-SKJ7-HKNCOMBI-DAY(IDX1) = "
      *                   WRK-SKJ7-HKNCOMBI-DAY(IDX1)
      *          DISPLAY "WRK-SKJ7-RYOYO(IDX1) = "
      *                   WRK-SKJ7-RYOYO(IDX1)
      *          DISPLAY "WRK-SKJ7-RYOYO-SU(IDX1) = "
      *                   WRK-SKJ7-RYOYO-SU(IDX1)
      *          DISPLAY "WRK-SKJ7-RYOYO-RYU(IDX1) = "
      *                   WRK-SKJ7-RYOYO-RYU(IDX1)
      *          DISPLAY "WRK-SKJ7-RYOYO-RYU-SU(IDX1) = "
      *                   WRK-SKJ7-RYOYO-RYU-SU(IDX1)
      *          DISPLAY "WRK-SKJ7-SHOKUDOU(IDX1) = "
      *                   WRK-SKJ7-SHOKUDOU(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-SU(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-SU(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1)
      *          DISPLAY "WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1) = "
      *                   WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1)
      *          DISPLAY "WRK-SKJ7-KAISU =(IDX1) = "
      *                   WRK-SKJ7-KAISU (IDX1)
              IF   (WRK-SKJ7-RYOYO(IDX1)   NOT =  SPACE)   OR
                   (WRK-SKJ7-RYOYO-RYU(IDX1)   NOT =  SPACE)
                    ADD    1     TO    IDX2
                    MOVE  WRK-SKJ7-DAY-TBL(IDX1)  TO
                                    LNK-RNYURECEDEN-DAY-TBL(3 IDX2)
                    MOVE   ZERO     TO    IDX4
                 IF   WRK-SKJ7-RYOYO(IDX1)  NOT =  SPACE
                        ADD     1     TO    IDX4
                        MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                        IF     IDX4    =   1
                            MOVE   "97"   TO
                              LNK-RNYURECEDEN-SRYSKB(3 IDX2 IDX4)
                        END-IF
                        MOVE   WRK-SKJ7-RYOYO(IDX1)  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                    MOVE      WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                    MOVE  WRK-SKJ7-KAISU(IDX1)  TO
                                  LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
      *
                    EVALUATE  WRK-SKJ7-RYOYO(IDX1)
      *               Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë
                      WHEN  "197000110"
                        EVALUATE  WRK-SKJ7-RYOYO-SU(IDX1)
                            WHEN  1
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE   WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE   800     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE   770     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  2
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE   WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  1600     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  1540     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  3
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE   WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  2400     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  2310     TO
                                      LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                        END-EVALUATE
      *               Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£²¡Ë
                      WHEN  "197000710"
                        EVALUATE  WRK-SKJ7-RYOYO-SU(IDX1)
                            WHEN  1
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE   WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE   640     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE   610     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  2
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE   WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                    LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  1280     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  1220     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  3
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE   WRK-SKJ7-RYOYO-SU(IDX1)  TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  1920     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  1830     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                        END-EVALUATE
                    END-EVALUATE
                    MOVE  WRK-SKJ7-KAISU(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                 END-IF
      *
                 IF   WRK-SKJ7-RYOYO-RYU(IDX1)  NOT =  SPACE
                        ADD     1     TO    IDX4
                        MOVE   "SI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                        IF     IDX4   =   1
                            MOVE   "97"   TO
                              LNK-RNYURECEDEN-SRYSKB(3 IDX2 IDX4)
                        END-IF
                        MOVE   WRK-SKJ7-RYOYO-RYU(IDX1)  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                        MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1)  TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                    MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1)  TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                    MOVE  WRK-SKJ7-KAISU(IDX1)  TO
                                  LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                    EVALUATE  WRK-SKJ7-RYOYO-RYU(IDX1)
      *               Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£±¡Ë¡ÊÎ®Æ°¿©¡Ë
                      WHEN  "197003110"
                        EVALUATE  WRK-SKJ7-RYOYO-RYU-SU(IDX1)
                            WHEN  1
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1) TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE   730     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE   690     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  2
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1) TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  1460    TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  1380     TO  
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  3
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1) TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  2190    TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  2070     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                        END-EVALUATE
      *               Æþ±¡»þ¿©»öÎÅÍÜ¡Ê£²¡Ë¡ÊÎ®Æ°¿©¡Ë
                      WHEN  "197003210"
                          EVALUATE  WRK-SKJ7-RYOYO-RYU-SU(IDX1)
                            WHEN  1
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1) TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE   590    TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE   550     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  2
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1) TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  1180     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  1100     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                            WHEN  3
      *                         Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                                ADD     1     TO    IDX4
                                MOVE   "RI"   TO
                                    LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                                MOVE   "101970010"  TO
                                    LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                                MOVE      WRK-SKJ7-RYOYO-RYU-SU(IDX1) TO
                                      LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                                IF LNK-RNYURECEDEN-SANTEIYM >=  "202406"
                                  MOVE  1770     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                ELSE
                                  MOVE  1650     TO
                                    LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                                END-IF
                          END-EVALUATE
                    END-EVALUATE
                    MOVE  WRK-SKJ7-KAISU(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                 END-IF
      *             ¿©Æ²²Ã»»
                    IF   WRK-SKJ7-SHOKUDOU(IDX1)  NOT =  SPACE
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   WRK-SKJ7-SHOKUDOU(IDX1)  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-KAISU(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
      *                  Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   "101970010"  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   60     TO
                                 LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-KAISU(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                    END-IF
      *
      *             ÆÃÊÌ¿©²Ã»»
                    IF   WRK-SKJ7-TOKU-SHOKU(IDX1)   =  SPACE
                          CONTINUE
                    ELSE
                      IF  WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1) NOT = 0
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   WRK-SKJ7-TOKU-SHOKU(IDX1)  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   1    TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
      *                  Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   "101970010"  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   1    TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                         MOVE   90     TO
                                      LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-TOKU-SHOKU-KAISU1(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                      END-IF
                      IF  WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1) NOT = 0
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   WRK-SKJ7-TOKU-SHOKU(IDX1)  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   2    TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
      *                  Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   "101970010"  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   2    TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                         MOVE   180    TO
                                      LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-TOKU-SHOKU-KAISU2(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                      END-IF
                      IF  WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1) NOT = 0
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   WRK-SKJ7-TOKU-SHOKU(IDX1)  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   3    TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
      *                  Ï«ºÒ¡Ê£±¡¥£²ÇÜ¡Ë¡Ê¿©»öÎÅÍÜ¡Ë
                         ADD     1     TO    IDX4
                         MOVE   "RI"   TO
                              LNK-RNYURECEDEN-RECSKB(3 IDX2 IDX4)
                         MOVE   "101970010"  TO
                                  LNK-RNYURECEDEN-SRYCD(3 IDX2 IDX4)
                         MOVE   3    TO
                                  LNK-RNYURECEDEN-SURYO(3 IDX2 IDX4)
                         MOVE   270    TO
                                      LNK-RNYURECEDEN-TEN(3 IDX2 IDX4)
                         MOVE  WRK-SKJ7-TOKU-SHOKU-KAISU3(IDX1)  TO
                                LNK-RNYURECEDEN-KAISU(3 IDX2 IDX4)
                      END-IF
                    END-IF
                    MOVE  IDX4  TO  LNK-RNYURECEDEN-MEISAISU(3 IDX2)
              END-IF
           END-PERFORM
      *
           .
       2103-SHOKUJI-HENSHU-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÅÀ¿ô¥Þ¥¹¥¿ÂàÈò¥ï¡¼¥¯¥Á¥§¥Ã¥¯½èÍý
      *****************************************************************
       910-TENSUWRK-CHK-SEC               SECTION.
      *
           MOVE    ZERO                TO  FLG-TENSUWRK
      *
           PERFORM VARYING TTNS-IDX      FROM    1   BY  1
                   UNTIL ( TTNS-IDX      >   TTNS-MAX ) OR
                         ( FLG-TENSUWRK    =   1 )      OR
                         ( TTNS-IDX      >   200 )
               IF    ( WRK-TENSU-SRYCD (TTNS-IDX)
                                       =   WRK-TENSU-CD )
                   MOVE    1           TO  FLG-TENSUWRK
                   MOVE    WRK-TENSU-DATA (TTNS-IDX)
                                       TO  TNS-TENSU-REC
               END-IF
           END-PERFORM
      *
           .
       910-TENSUWRK-CHK-EXT.
           EXIT.
      *****************************************************************
      *    ÅÀ¿ô¥Þ¥¹¥¿ÂàÈò¥ï¡¼¥¯ÊÔ½¸½èÍý
      *****************************************************************
       910-TTNS-HEN-SEC               SECTION.
      *
           IF    ( TTNS-CONST-MAX  >   TTNS-MAX )
               COMPUTE TTNS-MAX    =   TTNS-MAX    +   1
               MOVE    TNS-SRYCD       TO  WRK-TENSU-SRYCD
                                                   (TTNS-MAX)
               MOVE    TNS-TENSU-REC   TO  WRK-TENSU-DATA
                                                   (TTNS-MAX)
           END-IF
      *
           .
       910-TTNS-HEN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¥·¥¹¥Æ¥à´ÉÍý¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-SYSKANRI-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  SYS-1001-REC
                                               SYS-5000-REC
               MOVE    ZERO                TO  FLG-SYSKANRI
           ELSE
               INITIALIZE                      SYS-1001-REC
                                               SYS-5000-REC
               MOVE    1                   TO  FLG-SYSKANRI
           END-IF
      *
           .
       910-SYSKANRI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ´µ¼Ô¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       900-PTINF-READ-SEC         SECTION.
      *
           MOVE    PTINF-REC           TO  MCPDATA-REC
           MOVE    "tbl_ptinf"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_ptinf"         TO  MCP-TABLE
               MOVE    "key"               TO  MCP-PATHNAME
               PERFORM   900-DBFETCH-SEC
               IF      MCP-RC          =   ZERO
                   MOVE    MCPDATA-REC TO  PTINF-REC
                   MOVE    ZERO        TO  FLG-PTINF
               ELSE
                   INITIALIZE              PTINF-REC
                   MOVE    1           TO  FLG-PTINF
               END-IF
           ELSE
               INITIALIZE                  PTINF-REC
               MOVE    1               TO  FLG-PTINF
           END-IF
      *
           MOVE    "tbl_ptinf"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       900-PTINF-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡²ñ·×¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-NYUINACCT-SELECT-SEC        SECTION.
      *
           MOVE    NYUINACCT-REC       TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-NYUINACCT
           ELSE
               MOVE    1                  TO  FLG-NYUINACCT
           END-IF
      *
           .
       910-NYUINACCT-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡²ñ·×¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-NYUINACCT-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC        TO  NYUINACCT-REC
               MOVE    ZERO               TO  FLG-NYUINACCT
           ELSE
               INITIALIZE                     NYUINACCT-REC
               MOVE    1                  TO  FLG-NYUINACCT
           END-IF
      *
           .
       910-NYUINACCT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-NYUINACT-SELECT-SEC        SECTION.
      *
           MOVE    NYUINACT-REC        TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-NYUINACT
           ELSE
               MOVE    1                  TO  FLG-NYUINACT
           END-IF
      *
           .
       910-NYUINACT-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    Æþ±¡¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-NYUINACT-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  NYUINACT-REC
               MOVE    ZERO                TO  FLG-NYUINACT
           ELSE
               INITIALIZE                      NYUINACT-REC
               MOVE    1                   TO  FLG-NYUINACT
           END-IF
      *
           .
       910-NYUINACT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¿ÇÎÅ²ñ·×¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-SRYACCT-SELECT-SEC        SECTION.
      *
           MOVE    SRYACCT-REC         TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-SRYACCT
           ELSE
               MOVE    1                  TO  FLG-SRYACCT
           END-IF
      *
           .
       910-SRYACCT-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¿ÇÎÅ²ñ·×¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-SRYACCT-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC        TO  SRYACCT-REC
               MOVE    ZERO               TO  FLG-SRYACCT
           ELSE
               INITIALIZE                     SRYACCT-REC
               MOVE    1                  TO  FLG-SRYACCT
           END-IF
      *
           .
       910-SRYACCT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-SRYACT-SELECT-SEC        SECTION.
      *
           MOVE    SRYACT-REC          TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO            TO  FLG-SRYACT
           ELSE
               MOVE    1               TO  FLG-SRYACT
           END-IF
      *
           .
       910-SRYACT-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¿ÇÎÅ¹Ô°Ù¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-SRYACT-READ-SEC        SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC     TO  SRYACT-REC
               MOVE    ZERO            TO  FLG-SRYACT
           ELSE
               INITIALIZE                  SRYACT-REC
               MOVE    1               TO  FLG-SRYACT
           END-IF
      *
           .
       910-SRYACT-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÊÝ¸±ÁÈ¹ç¤»¥Þ¥¹¥¿¡¼¸¡º÷
      *****************************************************************
       910-HKNCOMBI-SELECT-SEC        SECTION.
      *
           MOVE    HKNCOMBI-REC        TO  MCPDATA-REC
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    ZERO               TO  FLG-HKNCOMBI
           ELSE
               MOVE    1                  TO  FLG-HKNCOMBI
           END-IF
      *
           .
       910-HKNCOMBI-SELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÊÝ¸±ÁÈ¹ç¤»¥Þ¥¹¥¿¡¼ÆÉ¹þ
      *****************************************************************
       910-HKNCOMBI-READ-SEC         SECTION.
      *
           PERFORM   900-DBFETCH-SEC
           IF      MCP-RC              =   ZERO
               MOVE    MCPDATA-REC         TO  HKNCOMBI-REC
               MOVE    ZERO                TO  FLG-HKNCOMBI
           ELSE
               INITIALIZE                      HKNCOMBI-REC
               MOVE    1                   TO  FLG-HKNCOMBI
           END-IF
      *
           .
       910-HKNCOMBI-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    ÅÀ¿ô¥Þ¥¹¥¿¡¼ÆÉ¹þ¡Ê¼ç¥­¡¼¡Ë
      *****************************************************************
       910-TENSU-READ-SEC         SECTION.
      *
           MOVE    TNS-TENSU-REC       TO  MCPDATA-REC
           MOVE    "tbl_tensu"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM   900-DBSELECT-SEC
           IF      MCP-RC              =   ZERO
               MOVE    "tbl_tensu"         TO  MCP-TABLE
               MOVE    "key"               TO  MCP-PATHNAME
               PERFORM   900-DBFETCH-SEC
               IF      MCP-RC              =   ZERO
                   MOVE    MCPDATA-REC         TO  TNS-TENSU-REC
      *
      *            Ê¿À®£²£¸Ç¯²þÄê¤Ç¿·Àß¤µ¤ì¤¿Æþ±¡ÎÁ²Ã»»¤ÎÃí¤Î²Ã»»¤ò
      *            ¹ð¼¨Åù¼±ÊÌ¶èÊ¬£±¤ò£·¤«¤é£±¤ËÃÖ¤­´¹¤¨¤ë
      *            Ìë´Ö´Ç¸îÂÎÀ©²Ã»»¡ÊµÞÀ­´ü´Ç¸îÊä½õÂÎÀ©²Ã»»¡Ë
                   IF      TNS-SRYCD       =   "190190770"
                      MOVE   1             TO   TNS-KOKUJISKBKBN1
                   END-IF
      *            Ìë´Ö£·£µÂÐ£±´Ç¸îÊä½õ²Ã»»
                   IF      TNS-SRYCD       =   "190191170"
                      MOVE   1             TO   TNS-KOKUJISKBKBN1
                   END-IF
      *            Ìë´Ö´Ç¸îÂÎÀ©²Ã»»¡Ê´Ç¸îÊä½õ²Ã»»¡Ë
                   IF      TNS-SRYCD       =   "190191270"
                      MOVE   1             TO   TNS-KOKUJISKBKBN1
                   END-IF
                   MOVE    ZERO                TO  FLG-TENSU
               ELSE
                   MOVE    1                   TO  FLG-TENSU
                   INITIALIZE                  TNS-TENSU-REC
               END-IF
           ELSE
               MOVE    1                   TO  FLG-TENSU
               INITIALIZE                  TNS-TENSU-REC
           END-IF
      *
           MOVE    "tbl_tensu"         TO  MCP-TABLE
           MOVE    "key"               TO  MCP-PATHNAME
           PERFORM   900-CLOSE-SEC
      *
           .
       910-TENSU-READ-EXT.
           EXIT.
      *
      *****************************************************************
      *    £Ä£Â£Ó£Å£Ì£Å£Ã£Ô½èÍý
      *****************************************************************
       900-DBSELECT-SEC                SECTION.
      *
           MOVE    "DBSELECT"          TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
           IF      MCP-RC              =   ZERO
               CONTINUE
           ELSE
               DISPLAY "SELECT ERR table=" MCP-TABLE
                       " pathname="        MCP-PATHNAME
           END-IF
           .
       900-DBSELECT-EXT.
           EXIT.
      *
      *****************************************************************
      *    £Ä£Â£Æ£Å£Ô£Ã£È½èÍý
      *****************************************************************
       900-DBFETCH-SEC                SECTION.
      *
           MOVE    "DBFETCH"           TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-DBFETCH-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¥Æ¡¼¥Ö¥ë¥¢¥¯¥»¥¹½èÍý
      *****************************************************************
       900-ORCDBMAIN-SEC               SECTION.
      *
           CALL    "ORCDBMAIN"     USING   MCPAREA
                                           MCPDATA-REC
                                           SPA-AREA
           .
      *
       900-ORCDBMAIN-EXT.
           EXIT.
      *
      *****************************************************************
      *    ¥Æ¡¼¥Ö¥ë¥¯¥í¡¼¥º½èÍý
      *****************************************************************
       900-CLOSE-SEC               SECTION.
      *
           MOVE    "DBCLOSECURSOR"     TO  MCP-FUNC
           PERFORM 900-ORCDBMAIN-SEC
      *
           .
       900-CLOSE-EXT.
           EXIT.
